#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	КомпоновкаИРасписание_ПКМП.ОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Ошибки = Неопределено;
	Если НаправлениеРазделения.Количество() = 2 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.НаправлениеРазделения" , "Превышено максимальное количество направлений");
	КонецЕсли;
	
	Если не НаправлениеРазделения.Итог("Вероятность") = 100 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.НаправлениеРазделения" , "Сумма вероятностей отлична от 100");
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);
КонецПроцедуры

#КонецЕсли
