#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	КомпоновкаИРасписание_ПКМП.ОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если ВидТочкиУсловия = Перечисления.ВидыТочкиУсловия.ПоКлиенту Тогда
		Настройки = ХранилищеНастроекКомпоновкиДанных.Получить();
		Если не ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПериодовДействия" , "Не заполнено время ожидания");
		КонецЕсли;	
	ИначеЕсли ВидТочкиУсловия = Перечисления.ВидыТочкиУсловия.ПоНаличиюПродуктов Тогда
		Если не ЗначениеЗаполнено(СегментПродуктов) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.СегментПродуктов" , "Не заполнен сегмент продуктов");
		КонецЕсли;	
		Если КоличествоПродуктовВСегментеОт = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПродуктовВСегментеОт" , "Не заполнена нижняя граница количества в сегменте");
		КонецЕсли;	
		Если КоличествоПродуктовВСегментеДо = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПродуктовВСегментеДо" , "Не заполнена верхняя граница количества в сегменте");
		КонецЕсли;	
		Если КоличествоПродуктовВСегментеДо<КоличествоПродуктовВСегментеОт Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПродуктовВСегментеДо" , "Некорректный интервал количества");
		КонецЕсли;	
	ИначеЕсли ВидТочкиУсловия = Перечисления.ВидыТочкиУсловия.ПоДоступностиПромокода Тогда
			Если не ЗначениеЗаполнено(НаборПромокодов) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.НаборПромокодов" , "Не заполнен набор промокодов");
			КонецЕсли;	
	КонецЕсли;	

	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);

КонецПроцедуры

#КонецЕсли