Функция СгенерироватьИДКлиента() Экспорт

	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Константы");
	ЭлементБлокировкиДанных.УстановитьЗначение("Код", "НумераторИДКлиентов");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		СсылкаНаНумератор = ОбщегоНазначенияПКМП.КонстантаПолучить("НумераторИДКлиентов", Истина);
		Если СсылкаНаНумератор.Пустая() Тогда
		Иначе
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;

КонецФункции