Функция СгенерироватьИДКлиента() Экспорт

	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Константы");
	ЭлементБлокировкиДанных.УстановитьЗначение("Код", "НумераторИДКлиента");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		Нумератор = ОбщегоНазначенияПКМП.ПолучитьИнформациюОКонстанте("НумераторИДКлиента");
		ИдКлиента = Неопределено;
		Если Нумератор.Ссылка.Пустая() Тогда
			ОбщегоНазначенияПКМП.КонстантаУстановить("НумераторИДКлиента", 1);
			ИдКлиента = 1;
		Иначе
			Если ТипЗнч(Нумератор.Значение) = Тип("Число") Тогда
				ИДКлиента = Нумератор.Значение + 1;
			Иначе
				ИДКлиента = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
		ОбъектКонстанты = Нумератор.Ссылка.ПолучитьОбъект();
		ОбъектКонстанты.Значение = ИДКлиента;
		ОбъектКонстанты.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	Возврат ИдКлиента;
	
КонецФункции