&НаКлиенте
Перем ЭлементыСтиляКонфигурации;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ТипАкции.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не задан тип акции.",,,,Отказ);
		Возврат;
	КонецЕсли;	
	
	СлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект,,,Ложь);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	
	
	ИнициализацияДанныхФормы();

	ВидимостьПериодаВыполнения();
	Элементы.ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
КонецПроцедуры

&НаСервере
Процедура ИнициализацияДанныхФормы()
	
	ЗаполнениеЗависимыхДанныхНаСервере();
	
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказовПоПродуктам", Компоновщик_ЗаказыПоПродуктам);
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказов", Компоновщик_ПоЗаказам);
	
	ПолучитьСтатус();
	
	СписокОтбораТоваровПоПродуктам.ЗагрузитьЗначения(Объект.ТоварыОтбор.Выгрузить(Новый Структура("ПоПродуктам",Истина)).ВыгрузитьКолонку("Номенклатура"));
	СписокОтбораТоваровПоЗаказам.ЗагрузитьЗначения(Объект.ТоварыОтбор.Выгрузить(Новый Структура("ПоПродуктам",Ложь)).ВыгрузитьКолонку("Номенклатура"));
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказовПоПродуктам", "Компоновщик_ЗаказыПоПродуктам",
		Отказ);
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказов", "Компоновщик_ПоЗаказам",
		Отказ);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТоварыОтбор.Очистить();
	Для Каждого ЭлементСписка Из СписокОтбораТоваровПоПродуктам Цикл
		НоваяСтрока = Объект.ТоварыОтбор.Добавить();
		НоваяСтрока.Номенклатура = ЭлементСписка.Значение;
		НоваяСтрока.ПоПродуктам = Истина;
	КонецЦикла;
	Для Каждого ЭлементСписка Из СписокОтбораТоваровПоЗаказам Цикл
		НоваяСтрока = Объект.ТоварыОтбор.Добавить();
		НоваяСтрока.Номенклатура = ЭлементСписка.Значение;
		НоваяСтрока.ПоПродуктам = Ложь;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СверткаНажатие(Элемент)
	УправлениеГруппами(Элемент.Имя, Истина);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеГруппами(ИмяЭлементаЗаголовкаГруппы, ИзменятьСвернутость = Ложь)
	ИДГруппы = СтрЗаменить(ИмяЭлементаЗаголовкаГруппы,"Свертка","");
	Группа = Элементы[СтрЗаменить(ИмяЭлементаЗаголовкаГруппы,"Свертка","Группа")];
	ЭлементОписание = Элементы["Описание"+ИмяЭлементаЗаголовкаГруппы];
	Элемент = Элементы[ИмяЭлементаЗаголовкаГРуппы];
	ЗаголовокБезЗнака = Сред(Элемент.Заголовок,2);
	
	Свернута = Группа.Видимость;
	Если ИзменятьСвернутость Тогда
		Свернута = не Свернута;
		Группа.Видимость = Свернута;
	КонецЕсли;	
	
	ЕстьОшибки = Ложь;
	ЭлементОписание.Заголовок = ПолучитьОписаниеГруппы(ИДГруппы, ЕстьОшибки);
	
	Если Свернута Тогда
		Знак = "▼";
	Иначе
		Знак = "►";
	КонецЕсли;		
	
	Элемент.Заголовок = Знак + ЗаголовокБезЗнака;
	Если  ЕстьОшибки Тогда
		Элемент.ЦветТекста = WEBЦвета.Красный;
		ЭлементОписание.ЦветТекста = WEBЦвета.Красный;
	Иначе
		ЦветНормы = Новый Цвет(51,153,102);
		Элемент.ЦветТекста = ЦветНормы;
		ЭлементОписание.ЦветТекста = ЦветНормы;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеГруппы(ИДГруппы, ЕстьОшибки)
	
	ЕстьОшибки = Ложь;
	ОписаниеГруппы = Новый Массив;
	Если ИДГруппы = "Контрагенты" Тогда
		Если Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") Тогда
			ОписаниеГруппы.Добавить("Для всех клиентов.");
		ИначеЕсли не Объект.ВидОтбораПоКлиентам.Пустая() Тогда
			Если Объект.СегментКлиентов.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан сегмент клиентов. ");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Для клиентов %1 из сегмента <b>""%2""</b>. ", 
													?(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.Нет"), "не", ""),
													Объект.СегментКлиентов
													)
										);
			КонецЕсли;
		Иначе	
			ЕстьОшибки = Истина;
			ОписаниеГруппы.Добавить("Не указан вид отбора по клиентам.");
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Доступность" Тогда
		Если не Объект.ОграничитьПоПромокодам и не Объект.ОграничитьПоВремени Тогда
			ОписаниеГруппы.Добавить("Доступно всегда.");
		КонецЕсли;	
		Если Объект.ОграничитьПоПромокодам Тогда
			Если Объект.НаборПромокодов.Пустая() Тогда
				ОписаниеГруппы.Добавить("Не указан набор промокодов.");
				ЕстьОшибки = Истина;
			Иначе
				ДополнениеПромокодовПоКоличеству = "";
				Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
					ДополнениеПромокодовПоКоличеству = СтрШаблон("(не более <b>%1 %2</b> из набора в одном заказе)", Объект.КоличествоПромокодовВЗаказе,	Элементы.ДекорацияПромокоды2.Заголовок);
				КонецЕсли;
				ОписаниеГруппы.Добавить(СтрШаблон("При доступности промокода из набора <b>""%1""</b> %2. ", Объект.НаборПромокодов, ДополнениеПромокодовПоКоличеству));
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ОграничитьПоВремени Тогда
			Если ПустаяСтрока(Объект.ДниНедели) Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указаны дни недели доступности.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Доступна в дни недели <b>%1</b> ", ОбщегоНазначенияПКМПКлиентСервер.НаименованияДнейНедели(Объект.ДниНедели)));
			КонецЕсли;	
			Если не Объект.НеОграничиватьВремяСрабатывания Тогда
				ИнтервалНекорректен = "";
				Если Объект.ВремяС >= Объект.ВремяПо Тогда
					ЕстьОшибки = Истина;
					ИнтервалНекорректен = " - некорректно указан интервал времени";
				КонецЕсли;	 
				ОписаниеГруппы.Добавить(СтрШаблон("(с <b>%1</b> по <b>%2</b> %3) ", Формат(Объект.ВремяС,"ДФ=ЧЧ:мм; ДП=00:00;"), Формат(Объект.ВремяПо,"ДФ=ЧЧ:мм; ДП=00:00;"), ИнтервалНекорректен));
			КонецЕсли;		
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Места" Тогда
		ФильтрКаналов  = "во всех каналах";
		ФильтрЗон  = "во всех зонах";
		Если Объект.ОграничитьПоКаналам Тогда
			Если не ДеревоКаналов.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоКаналов, Новый Структура("Отметка", Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны каналы>";
				Иначе
					ФильтрКаналов =  "в каналах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных, 20, , "ЗначениеОтбора");
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;		
		Если Объект.ОграничитьПоЗонам Тогда
			Если не ДеревоЗон.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоЗон, Новый Структура("Отметка", Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны зоны>";
				Иначе
					ФильтрКаналов =  "в зонах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных, 20, , "ЗначениеОтбора");
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;		
		ОписаниеГруппы.Добавить(СтрШаблон("Промоакция действует <b>%1</b> и <b>%2</b>",ФильтрКаналов,ФильтрЗон));
	ИначеЕсли ИДГруппы = "Продукты" Тогда
		Если не Объект.ОграничитьПоПродуктам и не Объект.ОграничитьЗаказыПоПродуктам Тогда
			ОписаниеГруппы.Добавить("Не указаны условия по продуктам.");
		Иначе
			Если Объект.ДействиеАкцииПоПродуктам.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указано действие акции при установленных отборах.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Выполнить действие: <b>%1</b>", Объект.ДействиеАкцииПоПродуктам));
			КонецЕсли;		
		КонецЕсли;	
		Если Объект.ОграничитьПоПродуктам Тогда
			Если Объект.ВариантОграниченияПоПродуктам.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан вариант ограничения по продуктам.");
			ИначеЕсли Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.ВСписке") Тогда
				Если СписокОтбораТоваровПоПродуктам.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ОписаниеГруппы.Добавить("Список продуктов не заполнен.");
				Иначе
					ОписаниеГруппы.Добавить("Промоакция действует на товары: <b>" + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(СписокОтбораТоваровПоПродуктам, 100)+"<b>");
				КонецЕсли;	
			Иначе
				Если Объект.СегментНоменклатурыПоПродуктам.Пустая() Тогда
					ЕстьОшибки = Истина;
					ОписаниеГруппы.Добавить("Сегмент продуктов не указан.");
				Иначе
					ОписаниеГруппы.Добавить("Промоакция действует на товары сегмента: <b>" + Объект.СегментНоменклатурыПоПродуктам+ "</b>");
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;	
		Если Объект.ОграничитьЗаказыПоПродуктам Тогда
			Если Компоновщик_ЗаказыПоПродуктам.Настройки.Отбор.Элементы.Количество() = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан отбор по заказам.");
			Иначе
				ОписаниеГруппы.Добавить("Отбор по заказам: " + КомпоновкаИРасписание_ПКМПКлиентСервер.ТекстовоеПредставлениеОтбораКомпоновки(Компоновщик_ЗаказыПоПродуктам.Настройки));
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Заказы" Тогда
		Если Объект.ОграничитьПоЗаказам Тогда
			Если Компоновщик_ПоЗаказам.Настройки.Отбор.Элементы.Количество() = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан отбор по заказам.");
			Иначе
				ОписаниеГруппы.Добавить("Отбор по заказам: " + КомпоновкаИРасписание_ПКМПКлиентСервер.ТекстовоеПредставлениеОтбораКомпоновки(Компоновщик_ПоЗаказам.Настройки));
			КонецЕсли;	
		КонецЕсли;	
		
		Если Объект.ДействияАкцииПоЗаказам.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ОписаниеГруппы.Добавить("Не указаны действия акции по заказу.");
		Иначе
			ОписаниеГруппы.Добавить(СтрШаблон("Выполнить действия: <b>%1</b>", ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(Объект.ДействияАкцииПоЗаказам, 100,,"ДействиеАкции")));
		КонецЕсли;		
		
	ИначеЕсли ИДГруппы = "Лимиты" Тогда
		Если Объект.ЕстьЛимитОбщийКоличество Тогда
			Если Объект.ЛимитОбщийКоличество = 0 Тогда 
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан лимит общего количества.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитОбщийКоличество.Заголовок,
														Объект.ЛимитОбщийКоличество,
														Элементы.ТекстРазЛОК.Заголовок,
														?(Объект.ПериодЛимитаОбщийКоличество.Пустая(),"",Объект.КоличествоПериодовЛимитаОбщийКоличество),
														?(Объект.ПериодЛимитаОбщийКоличество.Пустая(),"всё время акции",НРег(Элементы.ПериодЛимитаОбщийКоличество.ТекстРедактирования)))
				);
			КонецЕсли;	
		КонецЕсли;
		
		Если Объект.ЕстьЛимитОбщийСумма Тогда
			Если Объект.ЛимитОбщийСумма = 0 Тогда 
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан лимит общей суммы.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитОбщийСумма.Заголовок,
														Объект.ЛимитОбщийСумма,
														Элементы.ТекстРубЛОС.Заголовок,
														?(Объект.ПериодЛимитаОбщийСумма.Пустая(),"",Объект.КоличествоПериодовЛимитаОбщийСумма),
														?(Объект.ПериодЛимитаОбщийСумма.Пустая(),"всё время акции",НРег(Элементы.ПериодЛимитаОбщийСумма.ТекстРедактирования)))
				);
			КонецЕсли;	
		КонецЕсли;
		
		Если Объект.ЕстьЛимитПерсональныйКоличество Тогда
			Если Объект.ЛимитПерсональныйКоличество = 0 Тогда 
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан персональный лимит количества.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитПерсональныйКоличество.Заголовок,
														Объект.ЛимитПерсональныйКоличество,
														Элементы.ТекстРазЛПК.Заголовок,
														?(Объект.ПериодЛимитаПерсональныйКоличество.Пустая(),"",Объект.КоличествоПериодовЛимитаПерсональныйКоличество),
														?(Объект.ПериодЛимитаПерсональныйКоличество.Пустая(),"всё время акции",НРег(Элементы.ПериодЛимитаПерсональныйКоличество.ТекстРедактирования)))
				);
			КонецЕсли;	
		КонецЕсли;
		
		Если Объект.ЕстьЛимитПерсональныйСумма Тогда
			Если Объект.ЛимитПерсональныйСумма = 0 Тогда 
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан персональный лимит суммы.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитПерсональныйСумма.Заголовок,
														Объект.ЛимитПерсональныйСумма,
														Элементы.ТекстРубЛПС.Заголовок,
														?(Объект.ПериодЛимитаПерсональныйСумма.Пустая(),"",Объект.КоличествоПериодовЛимитаПерсональныйСумма),
														?(Объект.ПериодЛимитаПерсональныйСумма.Пустая(),"всё время акции",НРег(Элементы.ПериодЛимитаПерсональныйСумма.ТекстРедактирования)))
				);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементыСтиляКонфигурации = Неопределено Тогда
		ЭлементыСтиляКонфигурации = СтандартныеПодсистемыКлиент.ЭлементыСтиля();
	КонецЕсли;
	
	кс = ОписаниеГруппы.Количество();
	Для ш=1 по кс Цикл
		ОписаниеГруппы[ш-1] = СтроковыеФункцииКлиентСервер.СформироватьФорматированнуюСтроку(ОписаниеГруппы[ш-1]+?(ш=кс,"",Символы.ПС), ЭлементыСтиляКонфигурации,Неопределено,Неопределено,Неопределено,Неопределено,Неопределено);
	КонецЦикла;	
	Возврат Новый ФорматированнаяСтрока(ОписаниеГруппы);
КонецФункции

&НаСервере
Процедура ЗаполнениеЗависимыхДанныхНаСервере()
	
	Элементы.ДействиеАкцииПоПродуктам.СписокВыбора.Очистить();
	Элементы.ДействиеАкцииПоЗаказам.СписокВыбора.Очистить();
	
	МассивТекущихДействий = Объект.ДействияАкцииПоЗаказам.Выгрузить().ВыгрузитьКолонку("ДействиеАкции");
	МассивТекущихДействий.Добавить(Объект.ДействиеАкцииПоПродуктам);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивТекущихДействий, Перечисления.ДействияВАкциях.ПустаяСсылка());
	НеприемлемыеДействия = ПолучитьИсключаемыеДействия(МассивТекущихДействий);
	
	Если Объект.ТипАкции = Перечисления.ТипыАкций.Баллы Тогда
		
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам, Перечисления.ДействияВАкциях.НачислитьБаллы, НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам, Перечисления.ДействияВАкциях.РазрешитьСкидкуБаллами, НеприемлемыеДействия);
 
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.НачислитьБаллы, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.РазрешитьСкидкуБаллами, НеприемлемыеДействия);
 		
	ИначеЕсли Объект.ТипАкции = Перечисления.ТипыАкций.Скидки Тогда
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам, Перечисления.ДействияВАкциях.ВыдатьСкидку, НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам, Перечисления.ДействияВАкциях.ОкруглениеЦены, НеприемлемыеДействия);

 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьСкидку, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.КаскаднаяСкидка, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ОкруглениеЦены, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьСкидкуЗаНабор, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьСкидкуНаПродуктЗаСуммуПокупокВСегменте, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьСкидкуНаПродуктыЗаПродукты, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьПромокод, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьПромокодЗаКаждыйПродукт, НеприемлемыеДействия);
 		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.СкидкаНаДоставку, НеприемлемыеДействия);

	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВСписокВыбораДействие(ЭлементВладелецСписка, ДобавляемоеДействие, НеприемлемыеДействия)
	Если НеприемлемыеДействия.Найти(ДобавляемоеДействие)  = Неопределено ТОгда
		ЭлементВладелецСписка.СписокВыбора.Добавить(ДобавляемоеДействие);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьИсключаемыеДействия(МассивТекущихДействий)

	Результат = Новый Массив;

	Если Не МассивТекущихДействий.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзаимоисключающиеДействияАкций.ИсключитьДействие КАК ИсключитьДействие
		|ИЗ
		|	РегистрСведений.ВзаимоисключающиеДействияАкций КАК ВзаимоисключающиеДействияАкций
		|ГДЕ
		|	ВзаимоисключающиеДействияАкций.ТипАкции = &ТипАкции
		|	И ВзаимоисключающиеДействияАкций.Действие В (&Действие)";

		Запрос.УстановитьПараметр("Действие", МассивТекущихДействий);
		Запрос.УстановитьПараметр("ТипАкции", Объект.ТипАкции);

		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИсключитьДействие");

	КонецЕсли;

	Возврат Результат;

КонецФункции	
	
&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
	//Элементы.ЧасовойПояс.Видимость = не Объект.НачалоПослеЗапуска или не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	УправлениеФормойКонтрагенты(Неопределено);
	УправлениеФормойДоступность(Неопределено);
	УправлениеФормойМеста(Неопределено);
	УстановитьСтраницуПараметров("ПоПродуктам");
	УправлениеФормойПродукты(Неопределено);
	УстановитьСтраницуПараметров("ПоЗаказам");
	УправлениеФормойЗаказы(Неопределено);
	УправлениеФормойЛимиты(Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойКонтрагенты(Элемент)
	//контрагенты
	Элементы.СегментКлиентов.Видимость = не(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") или Объект.ВидОтбораПоКлиентам.Пустая());
	УправлениеГруппами("СверткаКонтрагенты");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойДоступность(Элемент)
	//промокоды доступности
	Элементы.ГруппаОграничитьПоПромокодам.Видимость = Объект.ОграничитьПоПромокодам;
	
	Если Объект.ОграничитьПоПромокодам Тогда
		Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать до";
			Элементы.ДекорацияПромокоды2.Заголовок = "промо"+Склонение("код",Объект.КоличествоПромокодовВЗаказе,"Родительный");
			Элементы.ДекорацияПромокоды2.Видимость = Истина;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать несколько промокодов";
			Элементы.ДекорацияПромокоды2.Видимость = Ложь;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;		
	//время доступности
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
	
	УправлениеГруппами("СверткаДоступность");
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойМеста(Элемент)
	Элементы.ГруппаКаналыОтбор.Видимость = Объект.ОграничитьПоКаналам;
	Элементы.ГруппаЗоныОтбор.Видимость = Объект.ОграничитьПоЗонам;
	УправлениеГруппами("СверткаМеста");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойПродукты(Элемент)	
	Элементы.ГруппаПродуктыПродуктыОтбор.Видимость = Объект.ОграничитьПоПродуктам;
	Элементы.СписокОтбораТоваровПоПродуктам.Видимость = (Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.ВСписке"));
	Элементы.СегментНоменклатурыПоПродуктам.Видимость = (Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.ВСегменте")
															или Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.НеВСегменте"));
	Элементы.ГруппаПродуктыЗаказыОтбор.Видимость = Объект.ОграничитьЗаказыПоПродуктам;
	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойЗаказы(Элемент)	
	Элементы.ГруппаЗаказыОтбор.Видимость = Объект.ОграничитьПоЗаказам;
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойЛимиты(Элемент)	
	
	Элементы.ГруппаЛимитОбщийКоличествоПараметры.Видимость = Объект.ЕстьЛимитОбщийКоличество;
	Элементы.ГруппаЛимитОбщийСуммаПараметры.Видимость = Объект.ЕстьЛимитОбщийСумма;
	Элементы.ГруппаЛимитПерсональныйКоличествоПараметры.Видимость = Объект.ЕстьЛимитПерсональныйКоличество;
	Элементы.ГруппаЛимитПерсональныйСуммаПараметры.Видимость = Объект.ЕстьЛимитПерсональныйСумма;
	
	Элементы.ТекстРазЛОК.Заголовок = Склонение("раз", Объект.ЛимитОбщийКоличество , "Винительный" )+" за";
	Элементы.ТекстРубЛОС.Заголовок = Склонение("рубль", Объект.ЛимитОбщийСумма , "Винительный" )+" за";
	Элементы.ТекстРазЛПК.Заголовок = Склонение("раз", Объект.ЛимитПерсональныйКоличество , "Винительный" )+" за";
	Элементы.ТекстРубЛПС.Заголовок = Склонение("рубль", Объект.ЛимитПерсональныйСумма , "Винительный" )+" за";
	
	Элементы.КоличествоПериодовЛимитаОбщийКоличество.Видимость = не Объект.ПериодЛимитаОбщийКоличество.Пустая();
	Элементы.КоличествоПериодовЛимитаОбщийСумма.Видимость = не Объект.ПериодЛимитаОбщийСумма.Пустая();
	Элементы.КоличествоПериодовЛимитаПерсональныйКоличество.Видимость = не Объект.ПериодЛимитаПерсональныйКоличество.Пустая();
	Элементы.КоличествоПериодовЛимитаПерсональныйСумма.Видимость = не Объект.ПериодЛимитаПерсональныйСумма.Пустая();
	
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаОбщийКоличество", Объект.КоличествоПериодовЛимитаОбщийКоличество);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаОбщийСумма", Объект.КоличествоПериодовЛимитаОбщийСумма);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаПерсональныйКоличество", Объект.КоличествоПериодовЛимитаПерсональныйКоличество);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаПерсональныйСумма", Объект.КоличествоПериодовЛимитаПерсональныйСумма);
	
	УправлениеГруппами("СверткаЛимиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеАкцииПоПродуктамПриИзменении(Элемент)
	
	ЗаполнениеЗависимыхДанныхНаСервере();
	
	УстановитьСтраницуПараметров("ПоПродуктам");
	
	УправлениеГруппами("СверткаПродукты");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеАкцииПоЗаказамПриИзменении(Элемент)
	
	ЗаполнениеЗависимыхДанныхНаСервере();
	
	УстановитьСтраницуПараметров("ПоЗаказам");
	
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуПараметров(СуффиксСтраницы)
	ТекущееДействие = Неопределено;
	Если СуффиксСтраницы = "ПоПродуктам" Тогда
		ТекущееДействие = Объект.ДействиеАкцииПоПродуктам;
	ИначеЕсли 	 СуффиксСтраницы = "ПоЗаказам" Тогда
		ТД_ДействияПоЗаказам = Элементы.ДействияАкцииПоЗаказам.ТекущиеДанные;
		Если не ТД_ДействияПоЗаказам = Неопределено Тогда
			ТекущееДействие = ТД_ДействияПоЗаказам.ДействиеАкции;
		КонецЕсли;	
	КонецЕсли;	 
	
	Если не ЗначениеЗаполнено(ТекущееДействие) Тогда
		Элементы["ПараметрыДействия"+СуффиксСтраницы].ТекущаяСтраница = Элементы["Пустая"+СуффиксСтраницы];
	Иначе	
		Элементы["ПараметрыДействия"+СуффиксСтраницы].ТекущаяСтраница = Элементы[ИмяЗначенияПеречисления(ТекущееДействие)+СуффиксСтраницы];
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьРазвернутьВсе(Команда)
	Свертка = (Команда.Имя = "СвернутьВсе");
	Для Каждого ГруппаСвертка Из ПодчиненныеЭлементы Цикл
		Если не (ТипЗнч(ГруппаСвертка) = Тип("ГруппаФормы") и СтрНачинаетсяС(ГруппаСвертка.Имя, "ГруппаСвертка"))   Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДекорацияСвертки Из ГруппаСвертка.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(ДекорацияСвертки) = Тип("ДекорацияФормы") И СтрНачинаетсяС(ДекорацияСвертки.Имя, "Свертка") Тогда
				СвернутьРазвернутьЕслиОтличается(ДекорацияСвертки.Имя, Свертка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура СвернутьРазвернутьЕслиОтличается(ИмяЭлементаЗаголовкаГруппы, Свертка)
	Группа = Элементы[СтрЗаменить(ИмяЭлементаЗаголовкаГруппы,"Свертка","Группа")];
	Элемент = Элементы[ИмяЭлементаЗаголовкаГРуппы];
	ЗаголовокБезЗнака = Сред(Элемент.Заголовок,2);
	
	ИзменятьСвернутость = (Группа.Видимость = Свертка);
	Если ИзменятьСвернутость Тогда
		Группа.Видимость = не Группа.Видимость;
		Если Группа.Видимость Тогда
			Знак = "▼";
		Иначе
			Знак = "►";
		КонецЕсли;	
		Элемент.Заголовок = Знак + ЗаголовокБезЗнака;
	КонецЕсли;	
КонецПроцедуры	
#КонецОбласти
	

#Область ПодключаемыеОбработчикиПериода
&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
	УправлениеГруппами("СверткаДоступность");
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	

	УправлениеГруппами("СверткаДоступность");
	
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемая_Время(Элемент)
	
	УправлениеГруппами("СверткаДоступность");
	
КонецПроцедуры
#КонецОбласти	

#Область Прочие
&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
		СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
		мс = СтрРазделить(СтрокаСклонения," ");
		Возврат мс[1];
КонецФункции

&НаКлиенте
Процедура 	ОбработатьСклонениеСпискаКлиент(ИмяЭлемента, ЧисловоеЗначение, Падеж = "Винительный")
	тмпСписок = Элементы[ИмяЭлемента].СписокВыбора.Скопировать();
	ОбработатьСклонениеСписка(тмпСписок, ЧисловоеЗначение, Падеж);
	Для каждого ЭлементСклонения из тмпСписок Цикл
		ЭлементСписка = Элементы[ИмяЭлемента].СписокВыбора.НайтиПоЗначению(ЭлементСклонения.Значение);
		мс = СтрРазделить(ЭлементСклонения.Представление," ");
		ЭлементСписка.Представление = мс[1];
		ЭлементСписка.Картинка = ЭлементСклонения.Картинка;
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	ОбработатьСклонениеСписка(Список, ЧисловоеЗначение, Падеж)
	СлужебныйПКМП.СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение, Падеж);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления)
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления);
КонецФункции
#КонецОбласти

ЭлементыСтиляКонфигурации = Неопределено;