
&НаКлиенте
Процедура ТипАкцииПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	

	ВидимостьПериодаВыполнения();
	Элементы.ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	ПолучитьСтатус();
	
	Если не Параметры.Ключ.Пустая() Тогда
		Элементы.ТипАкции.ТолькоПросмотр = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	


&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
	Элементы.ЧасовойПояс.Видимость = не Объект.НачалоПослеЗапуска или не Объект.ОстановкаВручную;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	
