#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказовПоПродуктам", Компоновщик_ЗаказыПоПродуктам);
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказов", Компоновщик_ПоЗаказам);
	
	
	СлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект,,,Ложь);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	

	ВидимостьПериодаВыполнения();
	Элементы.ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	ПолучитьСтатус();
	
	Если не Параметры.Ключ.Пустая() Тогда
		Элементы.ТипАкции.ТолькоПросмотр = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказовПоПродуктам", "Компоновщик_ЗаказыПоПродуктам",
		Отказ);
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказов", "Компоновщик_ПоЗаказам",
		Отказ);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
	Элементы.ЧасовойПояс.Видимость = не Объект.НачалоПослеЗапуска или не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПромокодовВЗаказеПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоПромокодамПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьНесколькоПромокодовВЗаказеПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораПоКлиентамПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
	Для каждого ДекорацияСвертки из ЭтотОбъект.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ДекорацияСвертки) = Тип("ДекорацияФормы") и СтрНачинаетсяС(ДекорацияСвертки.Имя,"Свертка") Тогда
			СверткаНажатие(ДекорацияСвертки);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТипАкцииПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоВремениПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	//контрагенты
	Элементы.СегментКлиентов.Видимость = не(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно"));
	
	//промокоды доступности
	Элементы.ГруппаОграничитьПоПромокодам.Видимость = Объект.ОграничитьПоПромокодам;
	
	Если Объект.ОграничитьПоПромокодам Тогда
		Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать до";
			Элементы.ДекорацияПромокоды2.Заголовок = "промо"+Склонение("код",Объект.КоличествоПромокодовВЗаказе,"Родительный");
			Элементы.ДекорацияПромокоды2.Видимость = Истина;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать несколько промокодов";
			Элементы.ДекорацияПромокоды2.Видимость = Ложь;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;		
	//время доступности
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
	
	//
КонецПроцедуры

&НаКлиенте
Процедура СверткаНажатие(Элемент)
	
	ИДГруппы =  СтрЗаменить(Элемент.Имя,"Свертка","");
	Группа = Элементы[СтрЗаменить(Элемент.Имя,"Свертка","Группа")];
	СделатьСвернутой = Группа.Видимость;
	Если СделатьСвернутой Тогда
		ЕстьОшибки = Ложь;
		ЗаголовокСвернутойГруппы = ПолучитьЗаголовокСвернутойГруппы(ИДГруппы, ЕстьОшибки);
		Элемент.Заголовок = "►"+СтрШаблон(" %1 : %2", ИДГруппы, ЗаголовокСвернутойГруппы);
		Если  ЕстьОшибки Тогда
			Элемент.ЦветТекста = WEBЦвета.Красный;
		Иначе
			Элемент.ЦветТекста = Новый Цвет(51,153,102);
		КонецЕсли;	
	Иначе
		Элемент.ЦветТекста = Новый Цвет(51,153,102);
		Элемент.Заголовок = "▼"+ИДГруппы;
	КонецЕсли;		
	
	Группа.Видимость = не СделатьСвернутой;
КонецПроцедуры


&НаКлиенте
Функция ПолучитьЗаголовокСвернутойГруппы(ИДГруппы, ЕстьОшибки)
	
	ЕстьОшибки = Ложь;
	ЗаголовокСвернутойГруппы = "";
	Если ИДГруппы  = "Контрагенты" Тогда
		Если Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") Тогда
			ЗаголовокСвернутойГруппы = "Для всех клиентов";
		Иначе
			Если Объект.СегментКлиентов.Пустая() Тогда
				ЕстьОшибки = Истина;
				ЗаголовокСвернутойГруппы = "Не указан сегмент клиентов";
			Иначе
				ЗаголовокСвернутойГруппы  = СтрШаблон("Для клиентов %1 из сегмента ""%2""",
							?(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.Нет"),"не",""),Объект.СегментКлиентов);	
			КонецЕсли;	
		КонецЕсли;		
		
	КонецЕсли;
	Возврат ЗаголовокСвернутойГруппы;	
КонецФункции
#КонецОбласти	

#Область ПодключаемыеОбработчикиПериода
&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти	



&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
		СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
		мс = СтрРазделить(СтрокаСклонения," ");
		Возврат мс[1];
КонецФункции
