&НаКлиенте
Перем ЭлементыСтиляКонфигурации, СокращенияФормы;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.ТипАкции.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не задан тип акции.", , , , Отказ);
		Возврат;
	КонецЕсли;

	СлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект, , , Ложь);

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 По СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели" + Сред(Объект.ДниНедели, ПозДеньНедели, 1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72, 215, 44);
		КонецЦикла;
	КонецЕсли;

	ИнициализацияДанныхФормы();

	ВидимостьПериодаВыполнения();
	Элементы.ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект,
		"НастройкиЗаказовПоПродуктам", "Компоновщик_ЗаказыПоПродуктам", Отказ);
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказов",
		"Компоновщик_ПоЗаказам", Отказ);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(Не ЗначениеЗаполнено(тмпСтатус), Перечисления.СтатусыСценариев.Черновик, тмпСтатус);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТоварыОтбор.Очистить();
	Для Каждого ЭлементСписка Из СписокОтбораТоваровПоПродуктам Цикл
		НоваяСтрока = Объект.ТоварыОтбор.Добавить();
		НоваяСтрока.Номенклатура = ЭлементСписка.Значение;
		НоваяСтрока.КлючСостава = Истина;
	КонецЦикла;
	Для Каждого ЭлементСписка Из СписокОтбораТоваровПоЗаказам Цикл
		НоваяСтрока = Объект.ТоварыОтбор.Добавить();
		НоваяСтрока.Номенклатура = ЭлементСписка.Значение;
		НоваяСтрока.КлючСостава = Ложь;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область Инициализация
&НаСервере
Процедура ИнициализацияДанныхФормы()
	
	ЗаполнениеЗависимыхДанныхНаСервере();

	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказовПоПродуктам",
		Компоновщик_ЗаказыПоПродуктам);
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказов",
		Компоновщик_ПоЗаказам);

	ПолучитьСтатус();

	СписокОтбораТоваровПоПродуктам.ЗагрузитьЗначения(Объект.ТоварыОтбор.Выгрузить(Новый Структура("КлючСостава",
		Истина)).ВыгрузитьКолонку("Номенклатура"));
	СписокОтбораТоваровПоЗаказам.ЗагрузитьЗначения(Объект.ТоварыОтбор.Выгрузить(Новый Структура("КлючСостава",
		Ложь)).ВыгрузитьКолонку("Номенклатура"));

	ЗаполнитьБазуСписковВыбора();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБазуСписковВыбора()
	//списки с значениями хранения
	БазаСписковВыбора = Новый Структура;
	
	//Параметры действия по продуктам
	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(),"");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "балл");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент от стоимости товаров");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_НБП", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.Перед,"Перед");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.Сразу,"Сразу");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.После,"После");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.Датой,"ДатаИВремя");
//	БазаСписковВыбора.Вставить("ВидПериодаДоступности_НБП",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ПериодыДействий.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ПериодыДействий.Год,"Год");
//	Список.Добавить(Перечисления.ПериодыДействий.Месяц,"Месяц");
//	Список.Добавить(Перечисления.ПериодыДействий.Неделя,"Неделя");
	Список.Добавить(Перечисления.ПериодыДействий.День, "день");
	Список.Добавить(Перечисления.ПериодыДействий.Час, "час");
	Список.Добавить(Перечисления.ПериодыДействий.Минута, "минута");
	БазаСписковВыбора.Вставить("ПериодДоступности_НБП", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.Бессрочно,"Бессрочно");
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.ВТечение,"В течение");
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.ДоДаты,"До даты");
//	БазаСписковВыбора.Вставить("ВидСрокаДействия_НБП",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ПериодыДействий.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ПериодыДействий.Год,"Год");
	Список.Добавить(Перечисления.ПериодыДействий.Месяц, "месяц");
//	Список.Добавить(Перечисления.ПериодыДействий.Неделя,"Неделя");
	Список.Добавить(Перечисления.ПериодыДействий.День, "день");
//	Список.Добавить(Перечисления.ПериодыДействий.Час,"Час");
//	Список.Добавить(Перечисления.ПериодыДействий.Минута,"Минута");
	БазаСписковВыбора.Вставить("ПериодСрокаДействия_НБП", Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество,"Количество");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент от стоимости товаров");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_РСБП", Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(), "");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "рубль");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_ВСП", Список);
	
	//Параметры действия по заказам
	Список = Новый СписокЗначений;
////	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(),"");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "балл");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент от стоимости товаров");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_НБЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке,"В списке");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте,"В сегменте");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте,"Не в сегменте");
//	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_НБЗ",Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.Перед,"Перед");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.Сразу,"Сразу");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.После,"После");
//	Список.Добавить(Перечисления.ПередСразуПослеДатой.Датой,"ДатаИВремя");
//	БазаСписковВыбора.Вставить("ВидПериодаДоступности_НБЗ",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ПериодыДействий.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ПериодыДействий.Год,"Год");
//	Список.Добавить(Перечисления.ПериодыДействий.Месяц,"Месяц");
//	Список.Добавить(Перечисления.ПериодыДействий.Неделя,"Неделя");
	Список.Добавить(Перечисления.ПериодыДействий.День, "день");
	Список.Добавить(Перечисления.ПериодыДействий.Час, "час");
	Список.Добавить(Перечисления.ПериодыДействий.Минута, "минута");
	БазаСписковВыбора.Вставить("ПериодДоступности_НБЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.Бессрочно,"Бессрочно");
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.ВТечение,"В течение");
//	Список.Добавить(Перечисления.ВидыСроковНачисленияБаллов.ДоДаты,"До даты");
//	БазаСписковВыбора.Вставить("ВидСрокаДействия_НБЗ",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ПериодыДействий.ПустаяСсылка(),"");
	Список.Добавить(Перечисления.ПериодыДействий.Месяц, "месяц");
//	Список.Добавить(Перечисления.ПериодыДействий.Неделя,"Неделя");
	Список.Добавить(Перечисления.ПериодыДействий.День, "день");
//	Список.Добавить(Перечисления.ПериодыДействий.Час,"Час");
//	Список.Добавить(Перечисления.ПериодыДействий.Минута,"Минута");
	БазаСписковВыбора.Вставить("ПериодСрокаДействия_НБЗ", Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(), "");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество,"Количество");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент от стоимости заказа");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_РСБЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке,"В списке");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте,"В сегменте");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте,"Не в сегменте");
//	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_РСБЗ",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(), "");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "рубль");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_ВСЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке,"В списке");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте,"В сегменте");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте,"Не в сегменте");
//	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_ВСЗ",Список);

	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(), "любой продукт");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке, "товар из списка");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте, "товар в сегменте");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте, "товар не в сегменте");
	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_КСЗ", Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(),"");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "рубль");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_КСЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ДискретностьЗаказа.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ДискретностьЗаказа.Заказ,"Заказ");
//	Список.Добавить(Перечисления.ДискретностьЗаказа.Товар,"Товар");
//	Список.Добавить(Перечисления.ДискретностьЗаказа.Линия,"Линия");
//	Список.Добавить(Перечисления.ДискретностьЗаказа.Единица,"Единица в линии");
//	БазаСписковВыбора.Вставить("ДискретностьОкругленияВЗаказе_ОЦЗ",Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке,"В списке");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте,"В сегменте");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте,"Не в сегменте");
//	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_ОЦЗ",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(), "");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "рубль");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_ВСНЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке,"В списке");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте,"В сегменте");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте,"Не в сегменте");
//	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_ВСПСПСЗ",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(), "");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "рубль");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_ВСПСПСЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке,"В списке");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте,"В сегменте");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте,"Не в сегменте");
//	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктамЦелиСкидки_ВСПСПСЗ",Список);

	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(), "продукт");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке, "продукт из списка");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте, "продукт в сегменте");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте, "продукт не в сегменте");
	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_ВСППЗ", Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(), "");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "рубль");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано,"Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_ВСППЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидыСпискаЦелиСкидки.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВидыСпискаЦелиСкидки.Следующие,"Следующие");
//	Список.Добавить(Перечисления.ВидыСпискаЦелиСкидки.ИзНабора,"Из набора");
//	Список.Добавить(Перечисления.ВидыСпискаЦелиСкидки.ВесьНабор,"Весь набор");
//	БазаСписковВыбора.Вставить("ВидСпискаЦелиСкидки_ВСППЗ",Список);

	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(), "продукт");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке, "продукт из списка");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте, "продукт в сегменте");
	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте, "продукт не в сегменте");
	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктамЦелиСкидки_ВСППЗ", Список);
//	
//	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ПустаяСсылка(),"");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСписке,"В списке");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.ВСегменте,"В сегменте");
//	Список.Добавить(Перечисления.ВариантыОграниченияПоПродуктам.НеВСегменте,"Не в сегменте");
//	БазаСписковВыбора.Вставить("ВариантОграниченияПоПродуктам_ВПКПЗ",Список);

	Список = Новый СписокЗначений;
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.ПустаяСсылка(), "");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Количество, "рубль");
	Список.Добавить(Перечисления.ВидИзмененияКоличества.Процент, "процент");
//	Список.Добавить(Перечисления.ВидИзмененияКоличества.Фиксировано, "Фиксировано");
	БазаСписковВыбора.Вставить("ИзменениеКоличестваВ_СДЗ", Список);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СверткаНажатие(Элемент)
	УправлениеГруппами(Элемент.Имя, Истина);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеГруппами(ИмяЭлементаЗаголовкаГруппы, ИзменятьСвернутость = Ложь)
	ИДГруппы = СтрЗаменить(ИмяЭлементаЗаголовкаГруппы, "Свертка", "");
	Группа = Элементы[СтрЗаменить(ИмяЭлементаЗаголовкаГруппы, "Свертка", "Группа")];
	ЭлементОписание = Элементы["Описание" + ИмяЭлементаЗаголовкаГруппы];
	Элемент = Элементы[ИмяЭлементаЗаголовкаГРуппы];
	ЗаголовокБезЗнака = Сред(Элемент.Заголовок, 2);

	Свернута = Группа.Видимость;
	Если ИзменятьСвернутость Тогда
		Свернута = Не Свернута;
		Группа.Видимость = Свернута;
	КонецЕсли;

	ЕстьОшибки = Ложь;
	ЭлементОписание.Заголовок = ПолучитьОписаниеГруппы(ИДГруппы, ЕстьОшибки);

	Если Свернута Тогда
		Знак = "▼";
	Иначе
		Знак = "►";
	КонецЕсли;

	Элемент.Заголовок = Знак + ЗаголовокБезЗнака;
	Если ЕстьОшибки Тогда
		Элемент.ЦветТекста = WEBЦвета.Красный;
		ЭлементОписание.ЦветТекста = WEBЦвета.Красный;
	Иначе
		ЦветНормы = Новый Цвет(51, 153, 102);
		Элемент.ЦветТекста = ЦветНормы;
		ЭлементОписание.ЦветТекста = ЦветНормы;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеГруппы(ИДГруппы, ЕстьОшибки)

	ЕстьОшибки = Ложь;
	ОписаниеГруппы = Новый Массив;
	Если ИДГруппы = "Контрагенты" Тогда
		Если Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") Тогда
			ОписаниеГруппы.Добавить("Для всех клиентов.");
		ИначеЕсли Не Объект.ВидОтбораПоКлиентам.Пустая() Тогда
			Если Объект.СегментКлиентов.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан сегмент клиентов. ");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Для клиентов %1 из сегмента <b>""%2""</b>. ", ?(
					Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.Нет"), "не", ""),
					Объект.СегментКлиентов));
			КонецЕсли;
		Иначе
			ЕстьОшибки = Истина;
			ОписаниеГруппы.Добавить("Не указан вид отбора по клиентам.");
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Доступность" Тогда
		Если Не Объект.ОграничитьПоПромокодам И Не Объект.ОграничитьПоВремени Тогда
			ОписаниеГруппы.Добавить("Доступно всегда.");
		КонецЕсли;
		Если Объект.ОграничитьПоПромокодам Тогда
			Если Объект.НаборПромокодов.Пустая() Тогда
				ОписаниеГруппы.Добавить("Не указан набор промокодов.");
				ЕстьОшибки = Истина;
			Иначе
				ДополнениеПромокодовПоКоличеству = "";
				Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
					ДополнениеПромокодовПоКоличеству = СтрШаблон("(не более <b>%1 %2</b> из набора в одном заказе)",
						Объект.КоличествоПромокодовВЗаказе, Элементы.ДекорацияПромокоды2.Заголовок);
				КонецЕсли;
				ОписаниеГруппы.Добавить(СтрШаблон("При доступности промокода из набора <b>""%1""</b> %2. ",
					Объект.НаборПромокодов, ДополнениеПромокодовПоКоличеству));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ОграничитьПоВремени Тогда
			Если ПустаяСтрока(Объект.ДниНедели) Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указаны дни недели доступности.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Доступна в дни недели <b>%1</b> ",
					ОбщегоНазначенияПКМПКлиентСервер.НаименованияДнейНедели(Объект.ДниНедели)));
			КонецЕсли;
			Если Не Объект.НеОграничиватьВремяСрабатывания Тогда
				ИнтервалНекорректен = "";
				Если Объект.ВремяС >= Объект.ВремяПо Тогда
					ЕстьОшибки = Истина;
					ИнтервалНекорректен = " - некорректно указан интервал времени";
				КонецЕсли;
				ОписаниеГруппы.Добавить(СтрШаблон("(с <b>%1</b> по <b>%2</b> %3) ", Формат(Объект.ВремяС,
					"ДФ=ЧЧ:мм; ДП=00:00;"), Формат(Объект.ВремяПо, "ДФ=ЧЧ:мм; ДП=00:00;"), ИнтервалНекорректен));
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Места" Тогда
		ФильтрКаналов  = "во всех каналах";
		ФильтрЗон  = "во всех зонах";
		Если Объект.ОграничитьПоКаналам Тогда
			Если Не ДеревоКаналов.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоКаналов, Новый Структура("Отметка",
					Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны каналы>";
				Иначе
					ФильтрКаналов =  "в каналах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных,
						20, , "ЗначениеОтбора");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Объект.ОграничитьПоЗонам Тогда
			Если Не ДеревоЗон.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоЗон, Новый Структура("Отметка", Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны зоны>";
				Иначе
					ФильтрКаналов =  "в зонах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных,
						20, , "ЗначениеОтбора");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ОписаниеГруппы.Добавить(СтрШаблон("Промоакция действует <b>%1</b> и <b>%2</b>", ФильтрКаналов, ФильтрЗон));
	ИначеЕсли ИДГруппы = "Продукты" Тогда
		Если Не Объект.ОграничитьПоПродуктам И Не Объект.ОграничитьЗаказыПоПродуктам Тогда
			ОписаниеГруппы.Добавить("Не указаны условия по продуктам.");
		Иначе
			Если Объект.ДействиеАкцииПоПродуктам.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указано действие акции при установленных отборах.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Выполнить действие: <b>%1</b>", Объект.ДействиеАкцииПоПродуктам));
			КонецЕсли;
		КонецЕсли;
		Если Объект.ОграничитьПоПродуктам Тогда
			Если Объект.ВариантОграниченияПоПродуктам.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан вариант ограничения по продуктам.");
			ИначеЕсли Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение(
				"Перечисление.ВариантыОграниченияПоПродуктам.ВСписке") Тогда
				Если СписокОтбораТоваровПоПродуктам.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ОписаниеГруппы.Добавить("Список продуктов не заполнен.");
				Иначе
					ОписаниеГруппы.Добавить("Промоакция действует на товары: <b>"
						+ ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(СписокОтбораТоваровПоПродуктам, 100) + "<b>");
				КонецЕсли;
			Иначе
				Если Объект.СегментНоменклатурыПоПродуктам.Пустая() Тогда
					ЕстьОшибки = Истина;
					ОписаниеГруппы.Добавить("Сегмент продуктов не указан.");
				Иначе
					ОписаниеГруппы.Добавить("Промоакция действует на товары сегмента: <b>"
						+ Объект.СегментНоменклатурыПоПродуктам + "</b>");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Объект.ОграничитьЗаказыПоПродуктам Тогда
			Если Компоновщик_ЗаказыПоПродуктам.Настройки.Отбор.Элементы.Количество() = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан отбор по заказам.");
			Иначе
				ОписаниеГруппы.Добавить("Отбор по заказам: "
					+ КомпоновкаИРасписание_ПКМПКлиентСервер.ТекстовоеПредставлениеОтбораКомпоновки(
					Компоновщик_ЗаказыПоПродуктам.Настройки));
			КонецЕсли;
		КонецЕсли;
		//ОписаниеГруппы.Добавить(ПолучитьОписаниеДействийПоПродуктам(ЕстьОшибки));
	ИначеЕсли ИДГруппы = "Заказы" Тогда
		Если Объект.ОграничитьПоЗаказам Тогда
			Если Компоновщик_ПоЗаказам.Настройки.Отбор.Элементы.Количество() = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан отбор по заказам.");
			Иначе
				ОписаниеГруппы.Добавить("Отбор по заказам: "
					+ КомпоновкаИРасписание_ПКМПКлиентСервер.ТекстовоеПредставлениеОтбораКомпоновки(
					Компоновщик_ПоЗаказам.Настройки));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ДействияАкцииПоЗаказам.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ОписаниеГруппы.Добавить("Не указаны действия акции по заказу.");
		Иначе
			ОписаниеГруппы.Добавить(СтрШаблон("Выполнить действия: <b>%1</b>",
				ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(Объект.ДействияАкцииПоЗаказам, 100, ,
				"ДействиеАкции")));
		КонецЕсли;		
		//ОписаниеГруппы.Добавить(ПолучитьОписаниеДействийПоЗаказам(ЕстьОшибки));
	ИначеЕсли ИДГруппы = "Лимиты" Тогда
		Если Объект.ЕстьЛимитОбщийКоличество Тогда
			Если Объект.ЛимитОбщийКоличество = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан лимит общего количества.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитОбщийКоличество.Заголовок,
					Объект.ЛимитОбщийКоличество, Элементы.ТекстРазЛОК.Заголовок, ?(
					Объект.ПериодЛимитаОбщийКоличество.Пустая(), "", Объект.КоличествоПериодовЛимитаОбщийКоличество), ?(
					Объект.ПериодЛимитаОбщийКоличество.Пустая(), "всё время акции", НРег(
					Элементы.ПериодЛимитаОбщийКоличество.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ЕстьЛимитОбщийСумма Тогда
			Если Объект.ЛимитОбщийСумма = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан лимит общей суммы.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитОбщийСумма.Заголовок,
					Объект.ЛимитОбщийСумма, Элементы.ТекстРубЛОС.Заголовок, ?(Объект.ПериодЛимитаОбщийСумма.Пустая(),
					"", Объект.КоличествоПериодовЛимитаОбщийСумма), ?(Объект.ПериодЛимитаОбщийСумма.Пустая(),
					"всё время акции", НРег(Элементы.ПериодЛимитаОбщийСумма.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ЕстьЛимитПерсональныйКоличество Тогда
			Если Объект.ЛимитПерсональныйКоличество = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан персональный лимит количества.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>",
					Элементы.ЕстьЛимитПерсональныйКоличество.Заголовок, Объект.ЛимитПерсональныйКоличество,
					Элементы.ТекстРазЛПК.Заголовок, ?(Объект.ПериодЛимитаПерсональныйКоличество.Пустая(), "",
					Объект.КоличествоПериодовЛимитаПерсональныйКоличество), ?(
					Объект.ПериодЛимитаПерсональныйКоличество.Пустая(), "всё время акции", НРег(
					Элементы.ПериодЛимитаПерсональныйКоличество.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ЕстьЛимитПерсональныйСумма Тогда
			Если Объект.ЛимитПерсональныйСумма = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан персональный лимит суммы.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитПерсональныйСумма.Заголовок,
					Объект.ЛимитПерсональныйСумма, Элементы.ТекстРубЛПС.Заголовок, ?(
					Объект.ПериодЛимитаПерсональныйСумма.Пустая(), "", Объект.КоличествоПериодовЛимитаПерсональныйСумма),
					?(Объект.ПериодЛимитаПерсональныйСумма.Пустая(), "всё время акции", НРег(
					Элементы.ПериодЛимитаПерсональныйСумма.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ЭлементыСтиляКонфигурации = Неопределено Тогда
		ЭлементыСтиляКонфигурации = СтандартныеПодсистемыКлиент.ЭлементыСтиля();
	КонецЕсли;

	кс = ОписаниеГруппы.Количество();
	Для ш = 1 По кс Цикл
		ОписаниеГруппы[ш - 1] = СтроковыеФункцииКлиентСервер.СформироватьФорматированнуюСтроку(ОписаниеГруппы[ш - 1]
			+ ?(ш = кс, "", Символы.ПС), ЭлементыСтиляКонфигурации, Неопределено, Неопределено, Неопределено,
			Неопределено, Неопределено);
	КонецЦикла;
	Возврат Новый ФорматированнаяСтрока(ОписаниеГруппы);
КонецФункции

&НаСервере
Процедура ЗаполнениеЗависимыхДанныхНаСервере()

	Элементы.ДействиеАкцииПоПродуктам.СписокВыбора.Очистить();
	Элементы.ДействиеАкцииПоЗаказам.СписокВыбора.Очистить();

	Если Не Объект.ДействиеАкцииПоПродуктам.Пустая() Тогда
		МассивТекущихДействий = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.ДействиеАкцииПоПродуктам);
	Иначе
		МассивТекущихДействий = Объект.ДействияАкцииПоЗаказам.Выгрузить().ВыгрузитьКолонку("ДействиеАкции");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивТекущихДействий,
		Перечисления.ДействияВАкциях.ПустаяСсылка());
	НеприемлемыеДействия = ПолучитьИсключаемыеДействия(МассивТекущихДействий);

	Если Объект.ТипАкции = Перечисления.ТипыАкций.Баллы Тогда
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам, Перечисления.ДействияВАкциях.НачислитьБаллы,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам,
			Перечисления.ДействияВАкциях.РазрешитьСкидкуБаллами, НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.НачислитьБаллы,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам,
			Перечисления.ДействияВАкциях.РазрешитьСкидкуБаллами, НеприемлемыеДействия);
	ИначеЕсли Объект.ТипАкции = Перечисления.ТипыАкций.Скидки Тогда
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам, Перечисления.ДействияВАкциях.ВыдатьСкидку,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоПродуктам, Перечисления.ДействияВАкциях.ОкруглениеЦены,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьСкидку,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.КаскаднаяСкидка,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ОкруглениеЦены,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам,
			Перечисления.ДействияВАкциях.ВыдатьСкидкуЗаНабор, НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам,
			Перечисления.ДействияВАкциях.ВыдатьСкидкуНаПродуктЗаСуммуПокупокВСегменте, НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам,
			Перечисления.ДействияВАкциях.ВыдатьСкидкуНаПродуктыЗаПродукты, НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.ВыдатьПромокод,
			НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам,
			Перечисления.ДействияВАкциях.ВыдатьПромокодЗаКаждыйПродукт, НеприемлемыеДействия);
		ДобавитьВСписокВыбораДействие(Элементы.ДействиеАкцииПоЗаказам, Перечисления.ДействияВАкциях.СкидкаНаДоставку,
			НеприемлемыеДействия);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьВСписокВыбораДействие(ЭлементВладелецСписка, ДобавляемоеДействие, НеприемлемыеДействия)
	Если НеприемлемыеДействия.Найти(ДобавляемоеДействие) = Неопределено Тогда
		ЭлементВладелецСписка.СписокВыбора.Добавить(ДобавляемоеДействие);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИсключаемыеДействия(МассивТекущихДействий)

	Результат = Новый Массив;

	Если Не МассивТекущихДействий.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзаимоисключающиеДействияАкций.ИсключитьДействие КАК ИсключитьДействие
		|ИЗ
		|	РегистрСведений.ВзаимоисключающиеДействияАкций КАК ВзаимоисключающиеДействияАкций
		|ГДЕ
		|	ВзаимоисключающиеДействияАкций.ТипАкции = &ТипАкции
		|	И ВзаимоисключающиеДействияАкций.Действие В (&Действие)";

		Запрос.УстановитьПараметр("Действие", МассивТекущихДействий);
		Запрос.УстановитьПараметр("ТипАкции", Объект.ТипАкции);

		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИсключитьДействие");

	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = Не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = Не Объект.ОстановкаВручную;
	//Элементы.ЧасовойПояс.Видимость = не Объект.НачалоПослеЗапуска или не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НоваяПрограмма = Объект.Ссылка.Пустая();

	УправлениеФормойКонтрагенты(Неопределено);
	УправлениеФормойДоступность(Неопределено);
	УправлениеФормойМеста(Неопределено);
	УстановитьСтраницуПараметров("ПоПродуктам", НоваяПрограмма);
	УправлениеФормойПродукты(Неопределено);
	УстановитьСтраницуПараметров("ПоЗаказам", НоваяПрограмма);
	УправлениеФормойЗаказы(Неопределено);
	УправлениеФормойЛимиты(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойКонтрагенты(Элемент)
	//контрагенты
	Элементы.СегментКлиентов.Видимость = Не (Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение(
		"Перечисление.ЕстьНетНеВажно.НеВажно") Или Объект.ВидОтбораПоКлиентам.Пустая());
	УправлениеГруппами("СверткаКонтрагенты");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойДоступность(Элемент)
	//промокоды доступности
	Элементы.ГруппаОграничитьПоПромокодам.Видимость = Объект.ОграничитьПоПромокодам;

	Если Объект.ОграничитьПоПромокодам Тогда
		Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать до";
			Элементы.ДекорацияПромокоды2.Заголовок = "промо" + Склонение("код", Объект.КоличествоПромокодовВЗаказе,
				"Родительный");
			Элементы.ДекорацияПромокоды2.Видимость = Истина;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать несколько промокодов";
			Элементы.ДекорацияПромокоды2.Видимость = Ложь;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;		
	//время доступности
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);

	УправлениеГруппами("СверткаДоступность");

КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойМеста(Элемент)
	Элементы.ГруппаКаналыОтбор.Видимость = Объект.ОграничитьПоКаналам;
	Элементы.ГруппаЗоныОтбор.Видимость = Объект.ОграничитьПоЗонам;
	УправлениеГруппами("СверткаМеста");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойПродукты(Элемент)
	Элементы.ГруппаПродуктыПродуктыОтбор.Видимость = Объект.ОграничитьПоПродуктам;
	Элементы.СписокОтбораТоваровПоПродуктам.Видимость = (Объект.ВариантОграниченияПоПродуктам
		= ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.ВСписке"));
	Элементы.СегментНоменклатурыПоПродуктам.Видимость = (Объект.ВариантОграниченияПоПродуктам
		= ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.ВСегменте")
		Или Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение(
		"Перечисление.ВариантыОграниченияПоПродуктам.НеВСегменте"));
	Элементы.ГруппаПродуктыЗаказыОтбор.Видимость = Объект.ОграничитьЗаказыПоПродуктам;
	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойЗаказы(Элемент)
	Элементы.ГруппаЗаказыОтбор.Видимость = Объект.ОграничитьПоЗаказам;
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойЛимиты(Элемент)

	Элементы.ГруппаЛимитОбщийКоличествоПараметры.Видимость = Объект.ЕстьЛимитОбщийКоличество;
	Элементы.ГруппаЛимитОбщийСуммаПараметры.Видимость = Объект.ЕстьЛимитОбщийСумма;
	Элементы.ГруппаЛимитПерсональныйКоличествоПараметры.Видимость = Объект.ЕстьЛимитПерсональныйКоличество;
	Элементы.ГруппаЛимитПерсональныйСуммаПараметры.Видимость = Объект.ЕстьЛимитПерсональныйСумма;

	Элементы.ТекстРазЛОК.Заголовок = Склонение("раз", Объект.ЛимитОбщийКоличество, "Винительный") + " за";
	Элементы.ТекстРубЛОС.Заголовок = Склонение("рубль", Объект.ЛимитОбщийСумма, "Винительный") + " за";
	Элементы.ТекстРазЛПК.Заголовок = Склонение("раз", Объект.ЛимитПерсональныйКоличество, "Винительный") + " за";
	Элементы.ТекстРубЛПС.Заголовок = Склонение("рубль", Объект.ЛимитПерсональныйСумма, "Винительный") + " за";

	Элементы.КоличествоПериодовЛимитаОбщийКоличество.Видимость = Не Объект.ПериодЛимитаОбщийКоличество.Пустая();
	Элементы.КоличествоПериодовЛимитаОбщийСумма.Видимость = Не Объект.ПериодЛимитаОбщийСумма.Пустая();
	Элементы.КоличествоПериодовЛимитаПерсональныйКоличество.Видимость = Не Объект.ПериодЛимитаПерсональныйКоличество.Пустая();
	Элементы.КоличествоПериодовЛимитаПерсональныйСумма.Видимость = Не Объект.ПериодЛимитаПерсональныйСумма.Пустая();

	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаОбщийКоличество", Объект.КоличествоПериодовЛимитаОбщийКоличество);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаОбщийСумма", Объект.КоличествоПериодовЛимитаОбщийСумма);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаПерсональныйКоличество",
		Объект.КоличествоПериодовЛимитаПерсональныйКоличество);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаПерсональныйСумма", Объект.КоличествоПериодовЛимитаПерсональныйСумма);

	УправлениеГруппами("СверткаЛимиты");

КонецПроцедуры

&НаКлиенте
Процедура ДействиеАкцииПоПродуктамПриИзменении(Элемент)

	ЗаполнениеЗависимыхДанныхНаСервере();

	УстановитьСтраницуПараметров("ПоПродуктам", Истина);

	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры

&НаКлиенте
Процедура ДействиеАкцииПоЗаказамПриИзменении(Элемент)

	ЗаполнениеЗависимыхДанныхНаСервере();

	УстановитьСтраницуПараметров("ПоЗаказам", Истина);

	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ДействияАкцииПоЗаказамПриАктивизацииСтроки(Элемент)
	УстановитьСтраницуПараметров("ПоЗаказам", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуПараметров(СуффиксСтраницы, Инициализировать)
	ТекущееДействие = Неопределено;
	Если СуффиксСтраницы = "ПоПродуктам" Тогда
		ТекущееДействие = Объект.ДействиеАкцииПоПродуктам;
	ИначеЕсли СуффиксСтраницы = "ПоЗаказам" Тогда
		ТД_ДействияПоЗаказам = Элементы.ДействияАкцииПоЗаказам.ТекущиеДанные;
		Если Не ТД_ДействияПоЗаказам = Неопределено Тогда
			ТекущееДействие = ТД_ДействияПоЗаказам.ДействиеАкции;
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущееДействие) Тогда
		Элементы["ПараметрыДействия" + СуффиксСтраницы].ТекущаяСтраница = Элементы["Пустая" + СуффиксСтраницы];
		Элементы["ПараметрыДействия" + СуффиксСтраницы].Видимость = Ложь;
	Иначе
		ИмяСтраницы = ИмяЗначенияПеречисления(ТекущееДействие) + СуффиксСтраницы;
		Элементы["ПараметрыДействия" + СуффиксСтраницы].ТекущаяСтраница = Элементы[ИмяСтраницы];
		Элементы["ПараметрыДействия" + СуффиксСтраницы].Видимость = Истина;
		Если Инициализировать Тогда
			Если ИмяСтраницы = "НачислитьБаллыПоПродуктам" Тогда
				Объект.ИзменениеКоличестваВ = ПредопределенноеЗначение("Перечисление.ВидИзмененияКоличества.Процент");
			ИначеЕсли ИмяСтраницы = "РазрешитьСкидкуБалламиПоПродуктам" Тогда
				Объект.ИзменениеКоличестваВ = ПредопределенноеЗначение("Перечисление.ВидИзмененияКоличества.Процент");
			ИначеЕсли ИмяСтраницы = "ВыдатьСкидкуПоПродуктам" Тогда
				Объект.ИзменениеКоличестваВ = ПредопределенноеЗначение("Перечисление.ВидИзмененияКоличества.Процент");
			КонецЕсли;
			Выполнить (ИмяСтраницы + "_Параметры(Неопределено)");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиПараметровДействий
&НаКлиенте
Процедура ОбработатьВидПериодаДоступности(Преффикс)
	Сразу = Объект.ВидПериодаДоступности = ПредопределенноеЗначение("Перечисление.ПередСразуПослеДатой.Сразу");
	Через = Объект.ВидПериодаДоступности = ПредопределенноеЗначение("Перечисление.ПередСразуПослеДатой.После");
	Датой = Объект.ВидПериодаДоступности = ПредопределенноеЗначение("Перечисление.ПередСразуПослеДатой.Датой");
	
	Элементы["КоличествоПериодовДоступности_"+Преффикс].Видимость = Через;
	Элементы["ПериодДоступности_"+Преффикс].Видимость = Через;
	Элементы["ДатаДоступности_"+Преффикс].Видимость = Датой;
	Элементы["ДоступноПоСтатусу_"+Преффикс].Видимость = Сразу или Через;
	Элементы["СтатусДоступности_"+Преффикс].Видимость = Объект.ДоступноПоСтатусу и (Сразу или Через);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСрокДействия(Преффикс)
	НаПериод = Объект.ВидСрокаДействия = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ВТечение");
	ДоДаты = Объект.ВидСрокаДействия = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ДоДаты");
	Элементы["КоличествоПериодовСрокаДействия_"+Преффикс].Видимость = НаПериод;
	Элементы["ПериодСрокаДействия_"+Преффикс].Видимость = НаПериод;
	Элементы["ДатаОкончанияСрокаДействия_"+Преффикс].Видимость = ДоДаты;
КонецПроцедуры


///////////////////////////////////////
&НаКлиенте
Процедура НачислитьБаллыПоПродуктам_Параметры(Элемент)
	ОбработатьСклонениеСпискаКлиент("ИзменениеКоличестваВ_НБП", Объект.Количество, "Винительный", Истина);
	ОбработатьСклонениеСпискаКлиент("ПериодДоступности_НБП", Объект.КоличествоПериодовДоступности, "Винительный", Истина);
	ОбработатьСклонениеСпискаКлиент("ПериодСрокаДействия_НБП", Объект.КоличествоПериодовСрокаДействия, "Винительный", Истина);
	Элементы.НБП_СрокДействия.Видимость = Объект.ЕстьСрокДействия;
	Элементы.НБП_ОграничениеНаКоличество.Видимость = Объект.ЕстьОграничениеНаКоличество;
	
	ОбработатьВидПериодаДоступности("НБП");
	ОбработатьСрокДействия("НБП");
	
	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьСкидкуБалламиПоПродуктам_Параметры(Элемент)
	ОбработатьСклонениеСпискаКлиент("ИзменениеКоличестваВ_РСБП", Объект.Количество, "Винительный", Истина);
	Элементы.РСБП_МинимальнаяСтоимость.Видимость = Объект.ЕстьМинимальнаяСтоимость;
	
	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьСкидкуПоПродуктам_Параметры(Элемент)
	ОбработатьСклонениеСпискаКлиент("ИзменениеКоличестваВ_ВСП", Объект.Количество, "Винительный", Истина);
	Элементы.ВСП_ОграничениеНаКоличество.Видимость = Объект.ЕстьОграничениеНаКоличество;
	
	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры

&НаКлиенте
Процедура ОкруглениеЦеныПоПродуктам_Параметры(Элемент)
	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры

&НаКлиенте
Процедура НачислитьБаллыПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьСкидкуБалламиПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьСкидкуПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура КаскаднаяСкидкаПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ОкруглениеЦеныПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьСкидкуЗаНаборПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьСкидкуНаПродуктЗаСуммуПокупокВСегментеПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьСкидкуНаПродуктыЗаПродуктыПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьПромокодПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьПромокодЗаКаждыйПродуктПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура СкидкаНаДоставкуПоЗаказам_Параметры(Элемент)
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьРазвернутьВсе(Команда)
	Свертка = (Команда.Имя = "СвернутьВсе");
	Для Каждого ГруппаСвертка Из ПодчиненныеЭлементы Цикл
		Если Не (ТипЗнч(ГруппаСвертка) = Тип("ГруппаФормы") И СтрНачинаетсяС(ГруппаСвертка.Имя, "ГруппаСвертка")) Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДекорацияСвертки Из ГруппаСвертка.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(ДекорацияСвертки) = Тип("ДекорацияФормы") И СтрНачинаетсяС(ДекорацияСвертки.Имя, "Свертка") Тогда
				СвернутьРазвернутьЕслиОтличается(ДекорацияСвертки.Имя, Свертка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура СвернутьРазвернутьЕслиОтличается(ИмяЭлементаЗаголовкаГруппы, Свертка)
	Группа = Элементы[СтрЗаменить(ИмяЭлементаЗаголовкаГруппы, "Свертка", "Группа")];
	Элемент = Элементы[ИмяЭлементаЗаголовкаГРуппы];
	ЗаголовокБезЗнака = Сред(Элемент.Заголовок, 2);

	ИзменятьСвернутость = (Группа.Видимость = Свертка);
	Если ИзменятьСвернутость Тогда
		Группа.Видимость = Не Группа.Видимость;
		Если Группа.Видимость Тогда
			Знак = "▼";
		Иначе
			Знак = "►";
		КонецЕсли;
		Элемент.Заголовок = Знак + ЗаголовокБезЗнака;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ПодключаемыеОбработчикиПериода
&НаКлиенте
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)

	Элементы.ГруппаВремя.Видимость = Не Объект.НеОграничиватьВремяСрабатывания;

	УправлениеГруппами("СверткаДоступность");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемая_ВыбратьДеньНедели(Команда)

	АктивнаяКнопка = ТекущийЭлемент;
	Если Не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;

	АктивнаяКнопка.Пометка = Не АктивнаяКнопка.Пометка;

	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка, Новый Цвет(72, 215, 44), Новый Цвет);

	Объект.ДниНедели = "";
	Для ДеньНедели = 1 По 7 Цикл
		Если Элементы["ДеньНедели" + ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;
	КонецЦикла;

	УправлениеГруппами("СверткаДоступность");

КонецПроцедуры

&НаКлиенте
Процедура Подключаемая_Время(Элемент)

	УправлениеГруппами("СверткаДоступность");

КонецПроцедуры
#КонецОбласти

#Область Прочие
&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
	СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение, , , "ПД=" + Падеж)[0];
	мс = СтрРазделить(СтрокаСклонения, " ");
	Возврат мс[1];
КонецФункции

&НаКлиенте
Процедура ОбработатьСклонениеСпискаКлиент(ИмяЭлемента, ЧисловоеЗначение, Падеж = "Винительный", УчитыватьИсходноеПредставление = Ложь)
	ОбозначениеПустого = "";
	Если БазаСписковВыбора.Свойство(ИмяЭлемента) Тогда
		тмпСписок = БазаСписковВыбора[ИмяЭлемента].Скопировать();
		Для Каждого ЭлементБазы Из тмпСписок Цикл
			Если ЭлементБазы.Значение.Пустая() Тогда
				ОбозначениеПустого = ЭлементБазы.Представление;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		тмпСписок = Элементы[ИмяЭлемента].СписокВыбора.Скопировать();
	КонецЕсли;
	ОбработатьСклонениеСписка(тмпСписок, ЧисловоеЗначение, Падеж, УчитыватьИсходноеПредставление);
	Для Каждого ЭлементСклонения Из тмпСписок Цикл
		ЭлементСписка = Элементы[ИмяЭлемента].СписокВыбора.НайтиПоЗначению(ЭлементСклонения.Значение);
		мс = СтрРазделить(ЭлементСклонения.Представление, " ");
		мс.Удалить(0);
		ЭлементСписка.Представление = СтрСоединить(мс, " ");
		ЭлементСписка.Картинка = ЭлементСклонения.Картинка;
	КонецЦикла;

	Если Не ПустаяСтрока(ОбозначениеПустого) И ТипЗнч(Элементы[ИмяЭлемента]) = Тип("ПолеФормы")
		И Элементы[ИмяЭлемента].Вид = ВидПоляФормы.ПолеВвода Тогда

		Элементы[ИмяЭлемента].ПодсказкаВвода = Склонение(ЧисловоеЗначение, ОбозначениеПустого, Падеж);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьСклонениеСписка(Список, ЧисловоеЗначение, Падеж, УчитыватьИсходноеПредставление = Ложь)
	СлужебныйПКМП.СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение, Падеж, УчитыватьИсходноеПредставление);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления)
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления);
КонецФункции
#КонецОбласти

	ЭлементыСтиляКонфигурации = Неопределено;
	
//	СокращенияФормы = Новый Структура;
//	СокращенияФормы.Вставить("НачислитьБаллыПоПродуктам","НБП");
//	СокращенияФормы.Вставить("РазрешитьСкидкуБалламиПоПродуктам","РСБП");
//	СокращенияФормы.Вставить("ВыдатьСкидкуПоПродуктам","ВСП");
//	СокращенияФормы.Вставить("ОкруглениеЦеныПоПродуктам","ОЦП");
//	СокращенияФормы.Вставить("НачислитьБаллыПоЗаказам","НБЗ");
//	СокращенияФормы.Вставить("РазрешитьСкидкуБалламиПоЗаказам","РСБЗ");
//	СокращенияФормы.Вставить("ВыдатьСкидкуПоЗаказам","ВСЗ");
//	СокращенияФормы.Вставить("КаскаднаяСкидкаПоЗаказам","КСЗ");
//	СокращенияФормы.Вставить("ОкруглениеЦеныПоЗаказам","ОЦЗ");
//	СокращенияФормы.Вставить("ВыдатьСкидкуЗаНаборПоЗаказам","ВСНЗ");
//	СокращенияФормы.Вставить("ВыдатьСкидкуНаПродуктЗаСуммуПокупокВСегментеПоЗаказам","ВСПСПСЗ");
//	СокращенияФормы.Вставить("ВыдатьСкидкуНаПродуктыЗаПродуктыПоЗаказам","ВСППЗ");
//	СокращенияФормы.Вставить("ВыдатьПромокодПоЗаказам","ВПЗ");
//	СокращенияФормы.Вставить("ВыдатьПромокодЗаКаждыйПродуктПоЗаказам","ВПКПЗ");
//	СокращенияФормы.Вставить("СкидкаНаДоставкуПоЗаказам","СДЗ");
