#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект,,,Ложь);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	

	
	Если не Параметры.Ключ.Пустая() Тогда
		Элементы.ТипАкции.ТолькоПросмотр = Истина;		
	КонецЕсли;
	
	Инициализация();
КонецПроцедуры

&НаСервере
Процедура Инициализация()
	
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказовПоПродуктам", Компоновщик_ЗаказыПоПродуктам);
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказов", Компоновщик_ПоЗаказам);
	
	ТипАкцииПриИзмененииНаСервере();
	ВидимостьПериодаВыполнения();
	Элементы.ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	ПолучитьСтатус();
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказовПоПродуктам", "Компоновщик_ЗаказыПоПродуктам",
		Отказ);
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказов", "Компоновщик_ПоЗаказам",
		Отказ);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СверткаНажатие(Элемент)
	
	ИДГруппы =  СтрЗаменить(Элемент.Имя,"Свертка","");
	Группа = Элементы[СтрЗаменить(Элемент.Имя,"Свертка","Группа")];
	СделатьСвернутой = Группа.Видимость;
	Если СделатьСвернутой Тогда
		ЕстьОшибки = Ложь;
		ЗаголовокСвернутойГруппы = ПолучитьЗаголовокСвернутойГруппы(ИДГруппы, ЕстьОшибки);
		Элемент.Заголовок = "►"+СтрШаблон(" %1 : %2", ИДГруппы, ЗаголовокСвернутойГруппы);
		Если  ЕстьОшибки Тогда
			Элемент.ЦветТекста = WEBЦвета.Красный;
		Иначе
			Элемент.ЦветТекста = Новый Цвет(51,153,102);
		КонецЕсли;	
	Иначе
		Элемент.ЦветТекста = Новый Цвет(51,153,102);
		Элемент.Заголовок = "▼"+ИДГруппы;
	КонецЕсли;		
	
	Группа.Видимость = не СделатьСвернутой;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗаголовокСвернутойГруппы(ИДГруппы, ЕстьОшибки)

	ЕстьОшибки = Ложь;
	ЗаголовокСвернутойГруппы = "";
	Если ИДГруппы = "Контрагенты" Тогда
		Если Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") Тогда
			ЗаголовокСвернутойГруппы = "Для всех клиентов. ";
		Иначе
			Если Объект.СегментКлиентов.Пустая() Тогда
				ЕстьОшибки = Истина;
				ЗаголовокСвернутойГруппы = "Не указан сегмент клиентов. ";
			Иначе
				ЗаголовокСвернутойГруппы  = СтрШаблон("Для клиентов %1 из сегмента ""%2"". ", ?(
					Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.Нет"), "не", ""),
					Объект.СегментКлиентов);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Доступность" Тогда
		Если не Объект.ОграничитьПоПромокодам и не Объект.ОграничитьПоВремени Тогда
			ЗаголовокСвернутойГруппы = "Доступно всегда. ";
		КонецЕсли;	
		Если Объект.ОграничитьПоПромокодам Тогда
			Если Объект.НаборПромокодов.Пустая() Тогда
				ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + "Не указан набор промокодов. ";
				ЕстьОшибки = Истина;
			Иначе
				ДополнениеПромокодовПоКоличеству = "";
				Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
					ДополнениеПромокодовПоКоличеству = СтрШаблон("(не более %1 %2 из набора в одном заказе)", Объект.КоличествоПромокодовВЗаказе,	Элементы.ДекорацияПромокоды2.Заголовок);
				КонецЕсли;
				ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + СтрШаблон("При доступности промокода из набора ""%1"" %2. ", Объект.НаборПромокодов, ДополнениеПромокодовПоКоличеству);
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ОграничитьПоВремени Тогда
			Если ПустаяСтрока(Объект.ДниНедели) Тогда
				ЕстьОшибки = Истина;
				ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + "Не указаны дни недели доступности. ";
			Иначе
				ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + СтрШаблон("Доступна в дни недели %1 ", ОбщегоНазначенияПКМПКлиентСервер.НаименованияДнейНедели(Объект.ДниНедели));
			КонецЕсли;	
			Если не Объект.НеОграничиватьВремяСрабатывания Тогда
				ИнтервалНекорректен = "";
				Если Объект.ВремяС >= Объект.ВремяПо Тогда
					ЕстьОшибки = Истина;
					ИнтервалНекорректен = " - некорректно указан интервал времени";
				КонецЕсли;	 
				ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + СтрШаблон("(с %1 по %2 %3) ", Формат(Объект.ВремяС,"ДФ=ЧЧ:мм; ДП=00:00;"), Формат(Объект.ВремяПо,"ДФ=ЧЧ:мм; ДП=00:00;"), ИнтервалНекорректен);
			КонецЕсли;		
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Места" Тогда
		ФильтрКаналов  = "во всех каналах";
		ФильтрЗон  = "во всех зонах";
		Если Объект.ОграничитьПоКаналам Тогда
			Если не ДеревоЗонДоставки.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоЗонДоставки, Новый Структура("Отметка", Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					
				Иначе
				КонецЕсли;		
		ЗаголовокСвернутойГруппы = СтрШаблон("Промоакция действует %1 и %2".
	КонецЕсли;
	Возврат ЗаголовокСвернутойГруппы;
КонецФункции

&НаКлиенте
Процедура ТипАкцииПриИзменении(Элемент)
	ТипАкцииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипАкцииПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
	Элементы.ЧасовойПояс.Видимость = не Объект.НачалоПослеЗапуска или не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПромокодовВЗаказеПриИзменении(Элемент)
	УправлениеФормойДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоПромокодамПриИзменении(Элемент)
	УправлениеФормойДоступность();
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьНесколькоПромокодовВЗаказеПриИзменении(Элемент)
	УправлениеФормойДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораПоКлиентамПриИзменении(Элемент)
	УправлениеФормойКонтрагенты();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоВремениПриИзменении(Элемент)
	УправлениеФормойДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоКаналамПриИзменении(Элемент)
	УправлениеФормойМеста();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоЗонамПриИзменении(Элемент)
	УправлениеФормойМеста();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипАкцииПриИзменении(Неопределено);
	
	УправлениеФормойКонтрагенты();
	УправлениеФормойДоступность();
	УправлениеФормойМеста();
	
	Для каждого ДекорацияСвертки из ЭтотОбъект.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ДекорацияСвертки) = Тип("ДекорацияФормы") и СтрНачинаетсяС(ДекорацияСвертки.Имя,"Свертка") Тогда
			СверткаНажатие(ДекорацияСвертки);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойКонтрагенты()
	//контрагенты
	Элементы.СегментКлиентов.Видимость = не(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно"));
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойДоступность()
	//промокоды доступности
	Элементы.ГруппаОграничитьПоПромокодам.Видимость = Объект.ОграничитьПоПромокодам;
	
	Если Объект.ОграничитьПоПромокодам Тогда
		Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать до";
			Элементы.ДекорацияПромокоды2.Заголовок = "промо"+Склонение("код",Объект.КоличествоПромокодовВЗаказе,"Родительный");
			Элементы.ДекорацияПромокоды2.Видимость = Истина;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать несколько промокодов";
			Элементы.ДекорацияПромокоды2.Видимость = Ложь;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;		
	//время доступности
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойМеста()
	Элементы.ГруппаКаналыОтбор.Видимость = Объект.ОграничитьПоКаналам;
	Элементы.ГруппаЗаказыОтбор.Видимость = Объект.ОграничитьПоЗонам;
КонецПроцедуры
	
#КонецОбласти	

#Область ПодключаемыеОбработчикиПериода
&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти	



&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
		СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
		мс = СтрРазделить(СтрокаСклонения," ");
		Возврат мс[1];
КонецФункции
