
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект,,,Ложь);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	

	
	Если не Параметры.Ключ.Пустая() Тогда
		Элементы.ТипАкции.ТолькоПросмотр = Истина;		
	КонецЕсли;
	
	Инициализация();
КонецПроцедуры

&НаСервере
Процедура Инициализация()
	
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказовПоПродуктам", Компоновщик_ЗаказыПоПродуктам);
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказов", Компоновщик_ПоЗаказам);
	
	ТипАкцииПриИзмененииНаСервере();
	ВидимостьПериодаВыполнения();
	Элементы.ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	ПолучитьСтатус();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказовПоПродуктам", "Компоновщик_ЗаказыПоПродуктам",
		Отказ);
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказов", "Компоновщик_ПоЗаказам",
		Отказ);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СверткаНажатие(Элемент)
	УправлениеГруппами(Элемент.Имя, Истина);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеГруппами(ИмяЭлементаЗаголовкаГруппы, ИзменятьСвернутость = Ложь)
	ИДГруппы = СтрЗаменить(ИмяЭлементаЗаголовкаГруппы,"Свертка","");
	Группа = Элементы[СтрЗаменить(ИмяЭлементаЗаголовкаГруппы,"Свертка","Группа")];
	ЭлементОписание = Элементы["Описание"+ИмяЭлементаЗаголовкаГруппы];
	Элемент = Элементы[ИмяЭлементаЗаголовкаГРуппы];
	ЗаголовокБезЗнака = Сред(Элемент.Заголовок,2);
	
	Свернута = Группа.Видимость;
	Если ИзменятьСвернутость Тогда
		Свернута = не Свернута;
		Группа.Видимость = Свернута;
	КонецЕсли;	
	
	ЕстьОшибки = Ложь;
	ЭлементОписание.Заголовок = ПолучитьОписаниеГруппы(ИДГруппы, ЕстьОшибки);
	
	Если Свернута Тогда
		Знак = "▼";
	Иначе
		Знак = "►";
	КонецЕсли;		
	
	Элемент.Заголовок = Знак + ЗаголовокБезЗнака;
	Если  ЕстьОшибки Тогда
		Элемент.ЦветТекста = WEBЦвета.Красный;
		ЭлементОписание.ЦветТекста = WEBЦвета.Красный;
	Иначе
		ЦветНормы = Новый Цвет(51,153,102);
		Элемент.ЦветТекста = ЦветНормы;
		ЭлементОписание.ЦветТекста = ЦветНормы;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеГруппы(ИДГруппы, ЕстьОшибки)

	ЕстьОшибки = Ложь;
	ОписаниеГруппы = "";
	Если ИДГруппы = "Контрагенты" Тогда
		Если Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") Тогда
			ОписаниеГруппы = "Для всех клиентов. ";
		ИначеЕсли не Объект.ВидОтбораПоКлиентам.Пустая() Тогда
			Если Объект.СегментКлиентов.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы = "Не указан сегмент клиентов. ";
			Иначе
				ОписаниеГруппы  = СтрШаблон("Для клиентов %1 из сегмента ""%2"". ", ?(
					Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.Нет"), "не", ""),
					Объект.СегментКлиентов);
			КонецЕсли;
		Иначе	
			ЕстьОшибки = Истина;
			ОписаниеГруппы = "Не указан вид отбора по клиентам. ";
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Доступность" Тогда
		Если не Объект.ОграничитьПоПромокодам и не Объект.ОграничитьПоВремени Тогда
			ОписаниеГруппы = "Доступно всегда. ";
		КонецЕсли;	
		Если Объект.ОграничитьПоПромокодам Тогда
			Если Объект.НаборПромокодов.Пустая() Тогда
				ОписаниеГруппы = ОписаниеГруппы + "Не указан набор промокодов. ";
				ЕстьОшибки = Истина;
			Иначе
				ДополнениеПромокодовПоКоличеству = "";
				Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
					ДополнениеПромокодовПоКоличеству = СтрШаблон("(не более %1 %2 из набора в одном заказе)", Объект.КоличествоПромокодовВЗаказе,	Элементы.ДекорацияПромокоды2.Заголовок);
				КонецЕсли;
				ОписаниеГруппы = ОписаниеГруппы + СтрШаблон("При доступности промокода из набора ""%1"" %2. ", Объект.НаборПромокодов, ДополнениеПромокодовПоКоличеству);
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ОграничитьПоВремени Тогда
			Если ПустаяСтрока(Объект.ДниНедели) Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы = ОписаниеГруппы + "Не указаны дни недели доступности. ";
			Иначе
				ОписаниеГруппы = ОписаниеГруппы + СтрШаблон("Доступна в дни недели %1 ", ОбщегоНазначенияПКМПКлиентСервер.НаименованияДнейНедели(Объект.ДниНедели));
			КонецЕсли;	
			Если не Объект.НеОграничиватьВремяСрабатывания Тогда
				ИнтервалНекорректен = "";
				Если Объект.ВремяС >= Объект.ВремяПо Тогда
					ЕстьОшибки = Истина;
					ИнтервалНекорректен = " - некорректно указан интервал времени";
				КонецЕсли;	 
				ОписаниеГруппы = ОписаниеГруппы + СтрШаблон("(с %1 по %2 %3) ", Формат(Объект.ВремяС,"ДФ=ЧЧ:мм; ДП=00:00;"), Формат(Объект.ВремяПо,"ДФ=ЧЧ:мм; ДП=00:00;"), ИнтервалНекорректен);
			КонецЕсли;		
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Места" Тогда
		ФильтрКаналов  = "во всех каналах";
		ФильтрЗон  = "во всех зонах";
		Если Объект.ОграничитьПоКаналам Тогда
			Если не ДеревоКаналов.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоКаналов, Новый Структура("Отметка", Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны каналы>";
				Иначе
					ФильтрКаналов =  "в каналах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных, 20, , "ЗначениеОтбора");
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;		
		Если Объект.ОграничитьПоЗонам Тогда
			Если не ДеревоЗон.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоЗон, Новый Структура("Отметка", Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны зоны>";
				Иначе
					ФильтрКаналов =  "в зонах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных, 20, , "ЗначениеОтбора");
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;		
		ОписаниеГруппы = СтрШаблон("Промоакция действует %1 и %2",ФильтрКаналов,ФильтрЗон);
	ИначеЕсли ИДГруппы = "Продукты" Тогда
		Если не Объект.ОграничитьПоПродуктам и не Объект.ОграничитьЗаказыПоПродуктам Тогда
			ОписаниеГруппы = "Не указаны условия по продуктам. ";
		КонецЕсли;	
		Если Объект.ОграничитьПоПродуктам Тогда
		КонецЕсли;	
		Если Объект.ОграничитьПоПродуктам Тогда
		КонецЕсли;	
		
	ИначеЕсли ИДГруппы = "Заказы" Тогда
	ИначеЕсли ИДГруппы = "Лимиты" Тогда
	КонецЕсли;
	Возврат ОписаниеГруппы;
КонецФункции

&НаКлиенте
Процедура ТипАкцииПриИзменении(Элемент)
	ТипАкцииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипАкцииПриИзмененииНаСервере()
	
	Элементы.ДействиеАкцииПоПродуктам.СписокВыбора.Очистить();
	Если Объект.ТипАкции = Перечисления.ТипыАкций.Баллы Тогда
		Элементы.ДействиеАкцииПоПродуктам.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.НачислениеБаллов);
		Элементы.ДействиеАкцииПоПродуктам.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.РазрешитьСкидкуБаллами);
	ИначеЕсли Объект.ТипАкции = Перечисления.ТипыАкций.Скидки Тогда
		Элементы.ДействиеАкцииПоПродуктам.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ВыдатьСкидку);
		Элементы.ДействиеАкцииПоПродуктам.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ОкруглениеЦены);
	КонецЕсли;
	
	Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Очистить();
	Если Объект.ТипАкции = Перечисления.ТипыАкций.Баллы Тогда
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.НачислениеБаллов);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.РазрешитьСкидкуБаллами);
	ИначеЕсли Объект.ТипАкции = Перечисления.ТипыАкций.Скидки Тогда
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ВыдатьСкидку);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.КаскаднаяСкидка);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ОкруглениеЦены);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ВыдатьСкидкуЗаНабор);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ВыдатьСкидкуНаПродуктЗаСуммуПокупокВСегменте);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ВыдатьСкидкуНаПродуктыЗаПродукты);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ВыдатьПромокод);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.ВыдатьПромокодЗаКаждыйПродукт);
		Элементы.ДействияАкцииПоЗаказамДействиеАкции.СписокВыбора.Добавить(Перечисления.ДействияВАкциях.СкидкаНаДоставку);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
	//Элементы.ЧасовойПояс.Видимость = не Объект.НачалоПослеЗапуска или не Объект.ОстановкаВручную;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипАкцииПриИзменении(Неопределено);
	
	УправлениеФормойКонтрагенты(Неопределено);
	УправлениеФормойДоступность(Неопределено);
	УправлениеФормойМеста(Неопределено);
	УправлениеФормойПродукты(Неопределено);
	УправлениеФормойЗаказы(Неопределено);
	УправлениеФормойЛимиты(Неопределено);
		
	Для Каждого ГруппаСвертка Из ЭтотОбъект.ПодчиненныеЭлементы Цикл
		Если не (ТипЗнч(ГруппаСвертка) = Тип("ГруппаФормы") и СтрНачинаетсяС(ГруппаСвертка.Имя, "ГруппаСвертка"))   Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДекорацияСвертки Из ГруппаСвертка.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(ДекорацияСвертки) = Тип("ДекорацияФормы") И СтрНачинаетсяС(ДекорацияСвертки.Имя, "Свертка") Тогда
				УправлениеГруппами(ДекорацияСвертки.Имя, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойКонтрагенты(Элемент)
	//контрагенты
	Элементы.СегментКлиентов.Видимость = не(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") или Объект.ВидОтбораПоКлиентам.Пустая());
	УправлениеГруппами("СверткаКонтрагенты");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойДоступность(Элемент)
	//промокоды доступности
	Элементы.ГруппаОграничитьПоПромокодам.Видимость = Объект.ОграничитьПоПромокодам;
	
	Если Объект.ОграничитьПоПромокодам Тогда
		Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать до";
			Элементы.ДекорацияПромокоды2.Заголовок = "промо"+Склонение("код",Объект.КоличествоПромокодовВЗаказе,"Родительный");
			Элементы.ДекорацияПромокоды2.Видимость = Истина;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать несколько промокодов";
			Элементы.ДекорацияПромокоды2.Видимость = Ложь;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;		
	//время доступности
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
	
	УправлениеГруппами("СверткаДоступность");
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойМеста(Элемент)
	Элементы.ГруппаКаналыОтбор.Видимость = Объект.ОграничитьПоКаналам;
	Элементы.ГруппаЗоныОтбор.Видимость = Объект.ОграничитьПоЗонам;
	УправлениеГруппами("СверткаМеста");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойПродукты(Элемент)	
	Элементы.ГруппаПродуктыПродуктыОтбор.Видимость = Объект.ОграничитьПоПродуктам;
	Элементы.СписокОтбораТоваров.Видимость = (Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.ВСписке"));
	Элементы.СегментНоменклатурыПоПродуктам.Видимость = (Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.ВСегменте")
															или Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение("Перечисление.ВариантыОграниченияПоПродуктам.НеВСегменте"));
	Элементы.ГруппаПродуктыЗаказыОтбор.Видимость = Объект.ОграничитьЗаказыПоПродуктам;
	УправлениеГруппами("СверткаПродукты");
КонецПроцедуры


&НаКлиенте
Процедура УправлениеФормойЗаказы(Элемент)	
	Элементы.ГруппаЗаказыОтбор.Видимость = Объект.ОграничитьПоЗаказам;
	УправлениеГруппами("СверткаЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойЛимиты(Элемент)	
	
	Элементы.ГруппаЛимитОбщийКоличествоПараметры.Видимость = Объект.ЕстьЛимитОбщийКоличество;
	Элементы.ГруппаЛимитОбщийСуммаПараметры.Видимость = Объект.ЕстьЛимитОбщийСумма;
	Элементы.ГруппаЛимитПерсональныйКоличествоПараметры.Видимость = Объект.ЕстьЛимитПерсональныйКоличество;
	Элементы.ГруппаЛимитПерсональныйСуммаПараметры.Видимость = Объект.ЕстьЛимитПерсональныйСумма;
	
	Элементы.ТекстРазЛОК.Заголовок = Склонение("раз", Объект.ЛимитОбщийКоличество , "Винительный" )+" за";
	Элементы.ТекстРубЛОС.Заголовок = Склонение("рубль", Объект.ЛимитОбщийСумма , "Винительный" )+" за";
	Элементы.ТекстРазЛПК.Заголовок = Склонение("раз", Объект.ЛимитПерсональныйКоличество , "Винительный" )+" за";
	Элементы.ТекстРубЛПС.Заголовок = Склонение("рубль", Объект.ЛимитПерсональныйСумма , "Винительный" )+" за";
	
	Элементы.КоличествоПериодовЛимитаОбщийКоличество.Видимость = не Объект.ПериодЛимитаОбщийКоличество.Пустая();
	Элементы.КоличествоПериодовЛимитаОбщийСумма.Видимость = не Объект.ПериодЛимитаОбщийСумма.Пустая();
	Элементы.КоличествоПериодовЛимитаПерсональныйКоличество.Видимость = не Объект.ПериодЛимитаПерсональныйКоличество.Пустая();
	Элементы.КоличествоПериодовЛимитаПерсональныйСумма.Видимость = не Объект.ПериодЛимитаПерсональныйСумма.Пустая();
	
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаОбщийКоличество", Объект.КоличествоПериодовЛимитаОбщийКоличество);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаОбщийСумма", Объект.КоличествоПериодовЛимитаОбщийСумма);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаПерсональныйКоличество", Объект.КоличествоПериодовЛимитаПерсональныйКоличество);
	ОбработатьСклонениеСпискаКлиент("ПериодЛимитаПерсональныйСумма", Объект.КоличествоПериодовЛимитаПерсональныйСумма);
	
	УправлениеГруппами("СверткаЛимиты");
	
КонецПроцедуры


#КонецОбласти	

#Область ПодключаемыеОбработчикиПериода
&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
	УправлениеГруппами("СверткаДоступность");
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	

	УправлениеГруппами("СверткаДоступность");
	
КонецПроцедуры
#КонецОбласти	

#Область Прочие
&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
		СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
		мс = СтрРазделить(СтрокаСклонения," ");
		Возврат мс[1];
КонецФункции

&НаКлиенте
Процедура 	ОбработатьСклонениеСпискаКлиент(ИмяЭлемента, ЧисловоеЗначение, Падеж = "Винительный")
	тмпСписок = Элементы[ИмяЭлемента].СписокВыбора.Скопировать();
	ОбработатьСклонениеСписка(тмпСписок, ЧисловоеЗначение, Падеж);
	Для каждого ЭлементСклонения из тмпСписок Цикл
		ЭлементСписка = Элементы[ИмяЭлемента].СписокВыбора.НайтиПоЗначению(ЭлементСклонения.Значение);
		мс = СтрРазделить(ЭлементСклонения.Представление," ");
		ЭлементСписка.Представление = мс[1];
		ЭлементСписка.Картинка = ЭлементСклонения.Картинка;
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	ОбработатьСклонениеСписка(Список, ЧисловоеЗначение, Падеж)
	СлужебныйПКМП.СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение, Падеж);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления)
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления);
КонецФункции
#КонецОбласти

