// Получает адреса СКД и настроек согласно переданным данным.
//
// Параметры:
//  ОбъектСсылка            - Произвольный - объект с СКД, настройками и расписанием.
//  ИмяШаблонаСКД            - Строка - имя шаблона СКД
//  АдресСКД                 - Строка - адрес хранилища, в котором находится СКД.
//  АдресНастроекСКД         - Строка - адрес хранилища, в котором находятся настройки СКД.
//  УникальныйИдентификатор   - УникальныйИдентификатор - идентификатор формы, из которой выполняется вызов процедуры.
//  РеквизитСхемаКомпоновкиДанных - Строка - имя реквизита объекта, в котором хранится СКД.
//  РеквизитХранилищеНастроекКомпоновкиДанных - Строка - имя реквизита объекта, в котором хранится настройка СКД.
//
//
// Возвращаемое значение:
//   Структура   -  состоит из следующих полей
//       СхемаКомпоновкиДанных     - Строка - адрес шаблона СКД.
//       НастройкиКомпоновкиДанных - Строка - адрес настроек СКД.
//
Функция ПолучитьАдресаСхемыКомпоновкиДанныхВоВременномХранилище(ОбъектСсылка, ИмяШаблонаСКД, АдресНастроекСКД,
	УникальныйИдентификатор, 	РеквизитХранилищеНастроекКомпоновкиДанных = "ХранилищеНастроекКомпоновкиДанных") Экспорт
	
	Адреса = Новый Структура("СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных");
	
	// Схема
	СхемаИНастройки = КомпоновкаИРасписание_ПКМП.ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(ОбъектСсылка, ИмяШаблонаСКД, РеквизитХранилищеНастроекКомпоновкиДанных);
	СхемаКомпоновкиДанных = СхемаИНастройки.СхемаКомпоновкиДанных;
	Адреса.СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,УникальныйИдентификатор);

	// Настройки
	Если НЕ ПустаяСтрока(АдресНастроекСКД) Тогда
		Адреса.НастройкиКомпоновкиДанных = АдресНастроекСКД;
	КонецЕсли;
	
	Возврат Адреса;
	
КонецФункции

// Готовит структуру данных СКД и настроек, исходя из шаблона и данных объекта.
//
// Параметры:
//  ОбъектСсылка           - Произвольный - объект с СКД, настройками и расписанием..
//  ИмяШаблонаСКД            - Строка - имя шаблона СКД
//  АдресСКД                 - Строка - адрес хранилища, в котором находится СКД.
//  АдресНастроекСКД         - Строка - адрес хранилища, в котором находятся настройки СКД.
//  УникальныйИдентификатор - УникальныйИдентификатор - идентификатор формы, из которой выполняется вызов процедуры.
//
// Возвращаемое значение:
//   Структура   -  состоит из следующих полей
//       ИмяШаблонаСКД           - Строка - имя шаблона СКД
//       ПредставлениеШаблонаСКД - Строка - пользовательское представление шаблона СКД.
//       АдресСКД                - Строка - адрес хранилища, в котором находится СКД.
//       АдресНастроекСКД        - Строка - адрес хранилища, в котором находятся настройки СКД.
//
Функция ПрименитьИзмененияКСхемеКомпоновкиДанных(ОбъектСсылка, ИмяШаблонаСКД, АдресСКД, АдресНастроекСКД, УникальныйИдентификатор, 	РеквизитХранилищеНастроекКомпоновкиДанных = "ХранилищеНастроекКомпоновкиДанных") Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ИмяШаблонаСКД", ИмяШаблонаСКД);
	ВозвращаемоеЗначение.Вставить("АдресСКД", "");
	ВозвращаемоеЗначение.Вставить("АдресНастроекСКД","");
	
		
	СхемаИНастройки = КомпоновкаИРасписание_ПКМП.ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(ОбъектСсылка, ИмяШаблонаСКД, РеквизитХранилищеНастроекКомпоновкиДанных);
	// Если схема компоновки данных из макета <> полученной из редактора схеме компоновки данных.
	Если ОбщегоНазначенияПКМПКлиентСервер.ПолучитьXML(СхемаИНастройки.СхемаКомпоновкиДанных) <> ОбщегоНазначенияПКМПКлиентСервер.ПолучитьXML(ПолучитьИзВременногоХранилища(АдресСКД)) Тогда
		
		ВозвращаемоеЗначение.ИмяШаблонаСКД  = "";
		ВозвращаемоеЗначение.АдресСКД = АдресСКД;
		
	Иначе
		
		ВозвращаемоеЗначение.ПредставлениеШаблонаСКД = СхемаИНастройки.Описание;
		
	КонецЕсли;
	
	// Полученные настройки могут быть равны настройкам по умолчанию схемы.
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаИНастройки.СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаИНастройки.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить();
	Если ОбщегоНазначенияПКМПКлиентСервер.ПолучитьXML(КомпоновщикНастроек.ПолучитьНастройки()) <> ОбщегоНазначенияПКМПКлиентСервер.ПолучитьXML(ПолучитьИзВременногоХранилища(АдресНастроекСКД)) Тогда
		ВозвращаемоеЗначение.АдресНастроекСКД = АдресНастроекСКД;
	КонецЕсли;
	
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

