Асинх Процедура СкопироватьСтрокуВБуферОбмена(ЗначениеДляВставки) Экспорт
	
	РезультатВставкиУспешен = Ложь;
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() и ЗначениеЗаполнено(ЗначениеДляВставки) Тогда
		ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Текст;
		Если Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматДанных) Тогда
		            ЭлементБуфераОбмена = Новый ЭлементБуфераОбмена(ФорматДанных, ЗначениеДляВставки);
		            РезультатВставкиУспешен = Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(ЭлементБуфераОбмена);
		КонецЕсли;
	КонецЕсли;
	
	Если 	РезультатВставкиУспешен Тогда
		ПоказатьОповещениеПользователя("Cкопировано в буфер обмена", , ЗначениеДляВставки);	
	Иначе
		ПоказатьОповещениеПользователя("Не скопировано в буфер обмена", , ЗначениеДляВставки);
	КонецЕсли;	

	

КонецПроцедуры

