
&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	ПостроительЗапроса = Новый ПостроительЗапроса;	
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Справочники.ВидыДействийКлиента.ПолучитьМакет("ВидыПоУмолчанию").Область());  
	ПостроительЗапроса.Выполнить();   
	ТЗРезультат = ПостроительЗапроса.Результат.Выгрузить(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗРезультат", ТЗРезультат);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗРезультат.КодДействия КАК КодДействия,
	|	ТЗРезультат.КодДействияMindBox КАК КодДействияMindBox,
	|	ТЗРезультат.Наименование КАК Наименование,
	|	ТЗРезультат.ОписаниеВидаОперации КАК ОписаниеВидаОперации,
	|	ТЗРезультат.ДополнительныеКодыMindBox КАК ДополнительныеКодыMindBox
	|ПОМЕСТИТЬ ВТ_ВидыПоУмолчанию
	|ИЗ
	|	&ТЗРезультат КАК ТЗРезультат
	|
	|ГДЕ НЕ СОКРЛП(ТЗРезультат.КодДействия) = """"
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидыПоУмолчанию.*
	|ИЗ
	|	ВТ_ВидыПоУмолчанию КАК ВТ_ВидыПоУмолчанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДействийКлиента КАК ВидыДействийКлиента
	|		ПО ВТ_ВидыПоУмолчанию.КодДействия = ВидыДействийКлиента.КодДействия
	|ГДЕ
	|	ВидыДействийКлиента.Ссылка ЕСТЬ NULL
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Лев(Выборка.КодДействия,2) = "//" Тогда Продолжить; КонецЕсли;
		Попытка
			ЭлементОбъект = ПредопределенноеЗначение("Справочник.ВидыДействийКлиента." + Выборка.КодДействия).ПолучитьОбъект();
		Исключение
			ЭлементОбъект = Справочники.ВидыДействийКлиента.СоздатьЭлемент();
		КонецПопытки;	
		ЭлементОбъект.КодДействия = Выборка.КодДействия;
		ЭлементОбъект.Наименование = Выборка.Наименование;
		ЭлементОбъект.ОписаниеВидаОперации = Выборка.ОписаниеВидаОперации;
		ЭлементОбъект.ДополнительныеКодыMindBox = Выборка.ДополнительныеКодыMindBox;
		ЭлементОбъект.КодДействияMindBox = Выборка.КодДействияMindBox;
		ЭлементОбъект.Системный = Истина;
		ЭлементОбъект.Записать();
	КонецЦикла;
	
	Элементы.Список.Обновить();


КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры
