
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИзменениеЗаголовковКнопокУправленияГС(Элементы.КП_ГрафическаяСхема);
	
	ВидимостьПериодаВыполнения();
	
	ПолучитьСтатус();
	
	ИнициализироватьСоответствиеГСиТочки();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СхемаПроцесса = Новый ХранилищеЗначения(ГС);
	
	ТекущийОбъект.Точки.Очистить();
	
	Если ТекущийОбъект.РежимРедактирования = Перечисления.РежимыРедактирования.Создание Тогда
		//структура дерева не проверялась, перенесем точки без структуры
		Для каждого СтрокаГСиТочки из ГСиТочки Цикл
			Если не СтрокаГСиТочки.Удален Тогда 
				СтрокаТочки =	ТекущийОбъект.Точки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТочки, СтрокаГСиТочки);
				СтрокаТочки.ВидТочки = ГрафическаяСхемаКлиентСерверПКМП.ВидТочкиПоТипуЭлемента(ГС.ЭлементыГрафическойСхемы.Найти(СтрокаТочки.ИмяТочки));
			КонецЕсли;
		КонецЦикла;
		
	Иначе	
		
		СоответствиеГСиТочек = Новый Соответствие();
		Для каждого СтрокаГСиТочки из ГСиТочки Цикл
			Если не СтрокаГСиТочки.Удален Тогда 
				СоответствиеГСиТочек.Вставить(СтрокаГСиТочки.ИмяТочки, СтрокаГСиТочки.Точка);
			КонецЕсли;
		КонецЦикла;
		
		ДеревоГС = ГрафическаяСхемаПКМП.СформироватьДеревоТочекПоСхеме(ГС, СоответствиеГСиТочек);
		Для каждого ТочкаСтарта из ДеревоГС.Строки Цикл
			СформироватьТабличнуюЧастьТочкиПоДеревуТочек(ТочкаСтарта, ТекущийОбъект);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьТабличнуюЧастьТочкиПоДеревуТочек(УзелТочки, ТекущийОбъект)
	СтрокаТочки =	ТекущийОбъект.Точки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТочки, УзелТочки);
	Если не УзелТочки.Родитель = Неопределено Тогда
		СтрокаТочки.ИмяТочкиРодителя = УзелТочки.Родитель.ИмяТочки;
	КонецЕсли; 
	Для каждого СтрокаУзла из УзелТочки.Строки Цикл
		СформироватьТабличнуюЧастьТочкиПоДеревуТочек(СтрокаУзла, ТекущийОбъект);
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ГС = ТекущийОбъект.СхемаПроцесса.Получить();
	
	Если ГС <> Неопределено Тогда
		Элементы.ГС.Доступность = Истина;
	Иначе
		Элементы.ГС.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РежимРедактированияПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьТочкиСценария" и не Источник.Пустая() и ЗначениеЗаполнено(Параметр) Тогда
		СтрокаГСиТочки = ГСиТочки.НайтиСтроки(Новый Структура("ИДСвязиПриСоздании",	Параметр))[0];
		СтрокаГСиТочки.Точка = Источник;
		ГС.ЭлементыГрафическойСхемы.Найти(СтрокаГСиТочки.ИмяТочки).Картинка = БиблиотекаКартинок.МеткаЗеленая; 
	КонецЕсли	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаСервере
Процедура ЗапуститьНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область УправлениеФормой

&НаКлиенте
Процедура ЭлементыГСПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.СодержаниеГС.ТекущиеДанные;
	Если ТД = НЕопределено Тогда Возврат; КонецЕсли;
	ТекущийЭлемент = Элементы.ГС;
	ЭлементГС = ГС.ЭлементыГрафическойСхемы.Найти(ТД.ИмяТочки);
	Если не ЭлементГС = Неопределено Тогда
		Элементы.ГС.ТекущийЭлемент = ЭлементГС;
	КонецЕсли;	
	
КонецПроцедуры


// Рекурсивно обходит элементы формы и переопределяет заголовки кнопок управления группами шагов сценария.
//
// Параметры:
//   ЭлементОбработки - ГруппаФормы - элемент формы, дочерние элементы которого обрабатываются рекурсивно
//                   - КнопкаФормы - кнопка формы, заголовок которой переопределяется по её имени
&НаСервере
Процедура ИзменениеЗаголовковКнопокУправленияГС(ЭлементОбработки)
	Если ТипЗнч(ЭлементОбработки) = Тип("ГруппаФормы") Тогда
		Для Каждого ПодчиненныйЭлемент Из ЭлементОбработки.ПодчиненныеЭлементы Цикл
				ИзменениеЗаголовковКнопокУправленияГС(ПодчиненныйЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементОбработки) = Тип("КнопкаФормы") Тогда
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементСтарт" Тогда ЭлементОбработки.Заголовок = "Условие запуска" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементДействие" Тогда ЭлементОбработки.Заголовок = "Группа шагов" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементРазделение" Тогда ЭлементОбработки.Заголовок = "Разделение" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементОбработка" Тогда ЭлементОбработки.Заголовок = "Ожидание" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементУсловие" Тогда ЭлементОбработки.Заголовок = "Условие" КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияПриИзменении(Элемент)
	ЕстьОшибки = Ложь;
	Если Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Создание") Тогда
		Элементы.ГС.Доступность = Истина;
		Элементы.ГС.ТолькоПросмотр = Ложь;
		Элементы.ГС.Редактирование = Истина;
	ИначеЕсли Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Настройка") Тогда
		ЕстьОшибки = не ПроверитьКорректностьГрафическойСхемы() ;
		Если не ЕстьОшибки Тогда
			Элементы.ГС.Доступность = Истина;
			Элементы.ГС.ТолькоПросмотр = Истина;
			Элементы.ГС.Редактирование = Ложь;
		КонецЕсли;
	ИначеЕсли Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Готовность") Тогда
		ЕстьОшибки = не ПроверитьКорректностьГрафическойСхемы() ;
		//проверка наличия связанных элементов справочников Точек
		Если не ЕстьОшибки Тогда
			Ошибки = Неопределено;
			Для Каждого ЭлементГС Из ГС.ЭлементыГрафическойСхемы Цикл
				ВидТочки =  ГрафическаяСхемаКлиентСерверПКМП.ВидТочкиПоТипуЭлемента(ЭлементГС);
				Если ВидТочки.Пустая() Тогда Продолжить; КонецЕсли;
				мсСоответствияПоИмени = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки,Удален", ЭлементГС.Имя,Ложь));
				Если мсСоответствияПоИмени.Количество() = 0 Или Не ЗначениеЗаполнено(мсСоответствияПоИмени[0].Точка) Тогда
					ПутьКПолю = ПолучитьПутьВСодержании(ЭлементГС);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПутьКПолю, СтрШаблон(
						"У точки сценария ""%1"" отсутствуют настройки.", ЭлементГС.Наименование));
				ИначеЕсли 	ВидТочки = ПредопределенноеЗначение("Перечисление.ВидыТочекСценария.Разделение") Тогда
					ТочкиПотомковРазделения = ПолучитьТочкиПотомковРазделения(ЭлементГС);
					Если не КорректныйСоставТочкиРазделенияПоПотомкам(мсСоответствияПоИмени[0].Точка, ТочкиПотомковРазделения.Точки) Тогда
						ПутьКПолю = ПолучитьПутьВСодержании(ЭлементГС);
						ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПутьКПолю, СтрШаблон(
							"У точки сценария ""%1"" некорректный набор разделения.", ЭлементГС.Наименование));
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, ЕстьОшибки);
			
			Если Не ЕстьОшибки Тогда
				Элементы.ГС.Доступность = Ложь;
				Элементы.ГС.Редактирование = Ложь;
			КонецЕсли;	
		КонецЕсли;
		
		//проверка верных точек на выходе точки разделения (в списке точек перехода точки разделения могут появиться неактуальные точки)
	КонецЕсли;	
	
	
	Если ЕстьОшибки Тогда
		Объект.РежимРедактирования = ТекущийРежимРедактирования;
	Иначе
		ТекущийРежимРедактирования = Объект.РежимРедактирования;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КорректныйСоставТочкиРазделенияПоПотомкам(ТочкаРазделения, ТочкиПотомкиПоГС)
	Направления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаРазделения, "НаправлениеРазделения").ВыгрузитьКолонку("Направление");
	
	СписокТЧ = Новый СписокЗначений;
	СписокПотомки = Новый СписокЗначений;
	
	СписокТЧ.ЗагрузитьЗначения(Направления);
	СписокТЧ.СортироватьПоЗначению();
	СписокПотомки.ЗагрузитьЗначения(ТочкиПотомкиПоГС);
	СписокПотомки.СортироватьПоЗначению();
	Возврат ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(СписокТЧ, СписокПотомки);
КонецФункции

&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	

#КонецОбласти
	
#Область ОбработкаГрафическойСхемы
&НаКлиенте
Асинх Процедура ГСВыбор(Элемент)
	
	Если Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Создание") Тогда
		ПоказатьПредупреждение(, "Настройка проводиться только в режиме ""Настройка точек сценария""" );	
		Возврат;
	КонецЕсли;	
	
	ТекущийЭлементГС = Элементы.ГС.ТекущийЭлемент;
	
	ВидТочки =  ГрафическаяСхемаКлиентСерверПКМП.ВидТочкиПоТипуЭлемента(ТекущийЭлементГС);
	Если ВидТочки.Пустая() Тогда Возврат; КонецЕсли;
	
	СтрокаГСиТочки = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки,Удален",	ТекущийЭлементГС.Имя, Ложь))[0];
	
	ПараметрыОткрытия = Новый Структура;
	Если ВидТочки = ПредопределенноеЗначение("Перечисление.ВидыТочекСценария.Разделение") Тогда
		ТочкиПотомковРазделения = ПолучитьТочкиПотомковРазделения(ТекущийЭлементГС);
		Если ТочкиПотомковРазделения.ЕстьОшибки тогда
			Возврат;
		Иначе
			ПараметрыОткрытия.Вставить("Точки", ТочкиПотомковРазделения.Точки);	
		КонецЕсли;	
	КонецЕсли;	
	Если ЗначениеЗаполнено(СтрокаГСиТочки.Точка) Тогда
		ПараметрыОткрытия.Вставить("Ключ", СтрокаГСиТочки.Точка);
		ОткрытьФорму(СтрШаблон("Справочник.ТочкиСценария%1.Форма.ФормаЭлемента", ИмяЗначенияПеречисления(ВидТочки)),
			ПараметрыОткрытия, ЭтотОбъект, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если Объект.Ссылка.Пустая() Тогда
			ОтветСохранить = Ждать ВопросАсинх("Перед настройкой точек сценария его необходимо записать.
			|Записать сценарий?",РежимДиалогаВопрос.ДаНет);
			Если ОтветСохранить = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
			Если Не Записать() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		СтрокаГСиТочки.ИДСвязиПриСоздании = Новый УникальныйИдентификатор;
		ПараметрыОткрытия.Вставить("ИДСвязиПриСоздании", СтрокаГСиТочки.ИДСвязиПриСоздании);
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Владелец", Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("Наименование", ТекущийЭлементГС.Наименование);
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму(СтрШаблон("Справочник.ТочкиСценария%1.Форма.ФормаЭлемента", ИмяЗначенияПеречисления(ВидТочки)),
			ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещенияОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТочкиПотомковРазделения(ЭлементГС)
	
	Результат = Новый Структура("ЕстьОшибки,Точки",Ложь,Новый Массив);
	МассивПотомков = ГрафическаяСхемаКлиентСерверПКМП.ПостроитьКартуПотомков(ГС).Получить(ЭлементГС.Имя);
	Ошибки = Неопределено;
	Для каждого Потомок из МассивПотомков Цикл
		СтрокиГСиТочки = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки,Удален",Потомок.Имя,Ложь));
		Если СтрокиГСиТочки.Количество() = 0 или не ЗначениеЗаполнено(СтрокиГСиТочки[0].Точка) Тогда
			ПутьКПолю = ПолучитьПутьВСодержании(Потомок);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПутьКПолю, СтрШаблон(
				"У точки ""%1"" после разделения ""%2"" необходимо ввести настройки перед редактированием разделения.", Потомок.Наименование, ЭлементГС.Наименование));
		Иначе
			Результат.Точки.Добавить(СтрокиГСиТочки[0].Точка);		
		КонецЕсли;	
	КонецЦИкла;	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Результат.ЕстьОшибки);
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Функция ПолучитьПутьВСодержании(ЭлементГС)
	ЭлементыГСпоИмени = СодержаниеГС.НайтиСтроки(Новый Структура("ИмяТочки", ЭлементГС.Имя));
	Если Не ЭлементыГСпоИмени.Количество() = 0 Тогда
		ПутьКПолю = СтрШаблон("СодержаниеГС[%1].ИмяТочки", СтрЗаменить(ЭлементыГСпоИмени[0].Номер, Символы.НПП,
			""));
	Иначе
		ПутьКПолю ="ГС";
	КонецЕсли;
	Возврат ПутьКПолю;
КонецФункции

&НаКлиенте
//отслеживание соответствия элементов ГС таблице ГСиТочки
//может быть: добавление, удаление, критичное изменение имени элемента ГС через интерактивные свойства (типа инициативный пользователь)
Процедура ГСПриИзменении(Элемент)
	ТекущийЭлементГС = Элементы.ГС.ТекущийЭлемент;
	ЗначащийЭлемент = Не ГрафическаяСхемаКлиентСерверПКМП.ВидТочкиПоТипуЭлемента(ТекущийЭлементГС).Пустая();
	Если ГС.ЭлементыГрафическойСхемы.Количество() = СодержаниеГС.Количество() Тогда //изменили свойства элемента
		СтароеСодержаниеТекущегоЭлемента = СодержаниеГС.НайтиСтроки(Новый Структура("ИмяТочки", ТекущийЭлементГС.Имя));
		Если СтароеСодержаниеТекущегоЭлемента.Количество() = 0 Тогда
			Для Каждого ЭлементСодержанияГС Из СодержаниеГС Цикл
				Если ГС.ЭлементыГрафическойСхемы.Найти(ЭлементСодержанияГС.ИмяТочки) = Неопределено Тогда

					Если ЗначащийЭлемент Тогда
						ГСиТочкиКУдалению = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки",
							ЭлементСодержанияГС.ИмяТочки));
						Для Каждого ЭлементГСиТочки Из ГСиТочкиКУдалению Цикл
							ЭлементГСиТочки.ИмяТочки = ТекущийЭлементГС.Имя;
						КонецЦикла;
					КонецЕсли;
					ЭлементСодержанияГС.ИмяТочки = ТекущийЭлементГС.Имя;
					ЭлементСодержанияГС.ОписаниеТочки = ТекущийЭлементГС.Наименование;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Не СтароеСодержаниеТекущегоЭлемента[0].ОписаниеТочки = ТекущийЭлементГС.Наименование Тогда
			СтароеСодержаниеТекущегоЭлемента[0].ОписаниеТочки = ТекущийЭлементГС.Наименование;
		КонецЕсли;
	Иначе
		Если ГС.ЭлементыГрафическойСхемы.Количество() < СодержаниеГС.Количество() Тогда //удалили элемент
			Для Каждого ЭлементСодержанияГС Из СодержаниеГС Цикл
				Если ГС.ЭлементыГрафическойСхемы.Найти(ЭлементСодержанияГС.ИмяТочки) = Неопределено Тогда
					ГСиТочкиКУдалению = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки",	ЭлементСодержанияГС.ИмяТочки));
					Для Каждого ЭлементГСиТочки Из ГСиТочкиКУдалению Цикл
						ЭлементГСиТочки.Удален = Истина;
					КонецЦикла;
					СодержаниеГС.Удалить(ЭлементСодержанияГС);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе //добавили
			Если ЗначащийЭлемент Тогда
				ЭлементГСиТочки = ГСиТочки.Добавить();
				ЭлементГСиТочки.ИмяТочки = ТекущийЭлементГС.Имя;
				ЭлементГСиТочки.Удален = Ложь;
				ТекущийЭлементГС.Картинка = БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ГрафическаяСхемаКлиентСерверПКМП.ОбновитьСписокСодержанияГС(ГС, СодержаниеГС);

КонецПроцедуры

&НаСервере 
Процедура ИнициализироватьСоответствиеГСиТочки()
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СценарииТочки.ИмяТочки КАК ИмяТочки,
		|	СценарииТочки.Точка КАК Точка,
		|	ИСТИНА КАК Удален
		|ИЗ
		|	Справочник.Сценарии.Точки КАК СценарииТочки
		|ГДЕ
		|	СценарииТочки.Ссылка = &Ссылка
		|	И СценарииТочки.ВидТочки В (&ЗначащиеВиды)";

		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("ЗначащиеВиды", ГрафическаяСхемаКлиентСерверПКМП.ЗначащиеВидыТочек());
		
		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяТочка = ГСиТочки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяТочка, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЕсли;
	
	Если не ГС.ЭлементыГрафическойСхемы.Количество() = 0 Тогда
		Для каждого ЭлементГС из ГС.ЭлементыГрафическойСхемы Цикл
			Если ГрафическаяСхемаКлиентСерверПКМП.ВидТочкиПоТипуЭлемента(ЭлементГС).Пустая() Тогда Продолжить; КонецЕСЛИ;
			ЭлементГС.Картинка = БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
			мсСоответствияПоИмени = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки", ЭлементГС.Имя));
			Если мсСоответствияПоИмени.Количество() = 0 Тогда
				НоваяТочка = ГСиТочки.Добавить();
				НоваяТочка.ИмяТочки = ЭлементГС.Имя;
				НоваяТочка.Удален = Ложь;
			Иначе
				Если ЗначениеЗаполнено(мсСоответствияПоИмени[0].Точка) Тогда
					ЭлементГС.Картинка = БиблиотекаКартинок.МеткаЗеленая;
				КонецЕсли;		
				мсСоответствияПоИмени[0].Удален = Ложь;
			КонецЕсли;	 
		КонецЦикла;	
	КонецЕсли;	
	
	ГрафическаяСхемаКлиентСерверПКМП.ОбновитьСписокСодержанияГС(ГС, СодержаниеГС);
	
КонецПроцедуры	



&НаКлиенте
Функция ПроверитьКорректностьГрафическойСхемы()
	РезультатПроверки = ГрафическаяСхемаКлиентСерверПКМП.ПроверитьКорректностьГрафическойСхемы(ГС);
	Если не РезультатПроверки.Успех Тогда
		Объект.РежимРедактирования = ТекущийРежимРедактирования;
		Ошибки = Неопределено;
		Для каждого Ошибка из РезультатПроверки.Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ГС", Ошибка);
		КонецЦикла;	
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат Ложь;
	КонецЕсли;	
	Возврат Истина;
КонецФункции	

#КонецОбласти

&НаСервереБезКонтекста
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления)
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления);
КонецФункции
