
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИзменениеЗаголовковКнопокУправленияГС(Элементы.КП_ГрафическаяСхема);
	
	ВидимостьПериодаВыполнения();
	
	ПолучитьСтатус();
	
	ИнициализироватьСоответствиеГСиТочки();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СхемаПроцесса = Новый ХранилищеЗначения(ГС);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ГС = ТекущийОбъект.СхемаПроцесса.Получить();
	
	Если ГС <> Неопределено Тогда
		Элементы.ГС.Доступность = Истина;
	Иначе
		Элементы.ГС.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РежимРедактированияПриИзменении(Неопределено);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаСервере
Процедура ЗапуститьНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область УправлениеФормой

&НаКлиенте
Процедура ЭлементыГСПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.СодержаниеГС.ТекущиеДанные;
	ТекущийЭлемент = Элементы.ГС;
	ЭлементГС = ГС.ЭлементыГрафическойСхемы.Найти(ТД.ИмяТочки);
	Если не ЭлементГС = Неопределено Тогда
		Элементы.ГС.ТекущийЭлемент = ЭлементГС;
	КонецЕсли;	
	
КонецПроцедуры


// Рекурсивно обходит элементы формы и переопределяет заголовки кнопок управления группами шагов сценария.
//
// Параметры:
//   ЭлементОбработки - ГруппаФормы - элемент формы, дочерние элементы которого обрабатываются рекурсивно
//                   - КнопкаФормы - кнопка формы, заголовок которой переопределяется по её имени
&НаСервере
Процедура ИзменениеЗаголовковКнопокУправленияГС(ЭлементОбработки)
	Если ТипЗнч(ЭлементОбработки) = Тип("ГруппаФормы") Тогда
		Для Каждого ПодчиненныйЭлемент Из ЭлементОбработки.ПодчиненныеЭлементы Цикл
				ИзменениеЗаголовковКнопокУправленияГС(ПодчиненныйЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементОбработки) = Тип("КнопкаФормы") Тогда
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементСтарт" Тогда ЭлементОбработки.Заголовок = "Условие запуска" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементДействие" Тогда ЭлементОбработки.Заголовок = "Группа шагов" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементРазделение" Тогда ЭлементОбработки.Заголовок = "Разделение" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементОбработка" Тогда ЭлементОбработки.Заголовок = "Ожидание" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементУсловие" Тогда ЭлементОбработки.Заголовок = "Условие" КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияПриИзменении(Элемент)
	
	Если Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Создание") Тогда
		Элементы.ГС.Доступность = Истина;
		Элементы.ГС.ТолькоПросмотр = Ложь;
		Элементы.ГС.Редактирование = Истина;
	ИначеЕсли Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Настройка") Тогда
		Если ПроверитьКорректностьГрафическойСхемы() Тогда
			Элементы.ГС.Доступность = Истина;
			Элементы.ГС.ТолькоПросмотр = Истина;
			Элементы.ГС.Редактирование = Ложь;
		Иначе
			Объект.РежимРедактирования = ТекущийРежимРедактирования;
			Возврат;
		КонецЕсли;
	ИначеЕсли Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Готовность") Тогда
		Если ПроверитьКорректностьГрафическойСхемы() Тогда

			Ошибки = Неопределено;
			Для Каждого ЭлементГС Из ГС.ЭлементыГрафическойСхемы Цикл
				Если ГрафическаяСхемаКлиентСерверПКМП.ВидТочкиПоТипуЭлемента(ЭлементГС, Истина) = 0 Тогда
					Продолжить;
				КонецЕсли;
				мсСоответствияПоИмени = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки", ЭлементГС.Имя));
				Если мсСоответствияПоИмени.Количество() = 0 Или Не ЗначениеЗаполнено(мсСоответствияПоИмени[0].Точка) Тогда

					ЭлементыГСпоИмени = СодержаниеГС.НайтиСтроки(Новый Структура("ИмяТочки", ЭлементГС.Имя));
					Если Не ЭлементыГСпоИмени.Количество() = 0 Тогда
						ПутьКПолю = СтрШаблон("СодержаниеГС[%1].ИмяТочки", СтрЗаменить(ЭлементыГСпоИмени[0].Номер, Символы.НПП,
							""));
					Иначе
						ПутьКПолю ="ГС";
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПутьКПолю, СтрШаблон(
						"У точки сценария ""%1"" отсутствуют настройки.", ЭлементГС.Наименование));
				КонецЕсли;
			КонецЦикла;

			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);

			Если Ошибки = Неопределено Тогда
				Элементы.ГС.Доступность = Ложь;
				Элементы.ГС.Редактирование = Ложь;
			Иначе
				Объект.РежимРедактирования = ТекущийРежимРедактирования;
				Возврат;
			КонецЕсли;
		Иначе
			Объект.РежимРедактирования = ТекущийРежимРедактирования;
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ТекущийРежимРедактирования = Объект.РежимРедактирования;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	

#КонецОбласти
	
#Область ОбработкаГрафическойСхемы
&НаКлиенте
Процедура ГСВыбор(Элемент)
	
	Если Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Создание") Тогда
		ПоказатьПредупреждение(, "Настройка проводиться только в режиме ""Настройка точек сценария""" );	
		Возврат;
	КонецЕсли;	
	
	ТекущийЭлементГС = Элементы.ГС.ТекущийЭлемент;
	
	ЭлементГСиТочки = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки,Удален",	ТекущийЭлементГС.Имя, Ложь));
	
//	Если ЗначениеЗаполнено(ЭлементГСиТочки[0].Точка) Тогда
//		Оповещение = Новый ОписаниеОповещения("ОбработкаНастройкиТочки", ЭтотОбъект, );
//		ОткрытьЗначение
	
КонецПроцедуры

&НаКлиенте
//отслеживание соответствия элементов ГС таблице ГСиТочки
//может быть: добавление, удаление, критичное изменение имени элемента ГС через интерактивные свойства (типа инициативный пользователь)
Процедура ГСПриИзменении(Элемент)
	ТекущийЭлементГС = Элементы.ГС.ТекущийЭлемент;
	ЗначащийЭлемент = Не ГрафическаяСхемаКлиентСерверПКМП.ВидТочкиПоТипуЭлемента(ТекущийЭлементГС).Пустая();
	Если ГС.ЭлементыГрафическойСхемы.Количество() = СодержаниеГС.Количество() Тогда //изменили свойства элемента
		СтароеСодержаниеТекущегоЭлемента = СодержаниеГС.НайтиСтроки(Новый Структура("ИмяТочки", ТекущийЭлементГС.Имя));
		Если СтароеСодержаниеТекущегоЭлемента.Количество() = 0 Тогда
			Для Каждого ЭлементСодержанияГС Из СодержаниеГС Цикл
				Если ГС.ЭлементыГрафическойСхемы.Найти(ЭлементСодержанияГС.ИмяТочки) = Неопределено Тогда

					Если ЗначащийЭлемент Тогда
						ГСиТочкиКУдалению = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки",
							ЭлементСодержанияГС.ИмяТочки));
						Для Каждого ЭлементГСиТочки Из ГСиТочкиКУдалению Цикл
							ЭлементГСиТочки.ИмяТочки = ТекущийЭлементГС.Имя;
						КонецЦикла;
					КонецЕсли;
					ЭлементСодержанияГС.ИмяТочки = ТекущийЭлементГС.Имя;
					ЭлементСодержанияГС.ОписаниеТочки = ТекущийЭлементГС.Наименование;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Не СтароеСодержаниеТекущегоЭлемента[0].ОписаниеТочки = ТекущийЭлементГС.Наименование Тогда
			СтароеСодержаниеТекущегоЭлемента[0].ОписаниеТочки = ТекущийЭлементГС.Наименование;
		КонецЕсли;
	Иначе
		Если ГС.ЭлементыГрафическойСхемы.Количество() < СодержаниеГС.Количество() Тогда //удалили элемент
			Для Каждого ЭлементСодержанияГС Из СодержаниеГС Цикл
				Если ГС.ЭлементыГрафическойСхемы.Найти(ЭлементСодержанияГС.ИмяТочки) = Неопределено Тогда
					Если ЗначащийЭлемент Тогда
						ГСиТочкиКУдалению = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки",	ЭлементСодержанияГС.ИмяТочки));
						Для Каждого ЭлементГСиТочки Из ГСиТочкиКУдалению Цикл
							ЭлементГСиТочки.Удален = Истина;
						КонецЦикла;
					КонецЕсли;
					СодержаниеГС.Удалить(ЭлементСодержанияГС);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе //добавили
			Если ЗначащийЭлемент Тогда
				ЭлементГСиТочки = ГСиТочки.Добавить();
				ЭлементГСиТочки.ИмяТочки = ТекущийЭлементГС.Имя;
				ЭлементГСиТочки.Удален = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ГрафическаяСхемаКлиентСерверПКМП.ОбновитьДанныеГС(ГС, СодержаниеГС);

КонецПроцедуры

&НаСервере 
Процедура ИнициализироватьСоответствиеГСиТочки()
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СценарииТочки.ИмяТочки КАК ИмяТочки,
		|	СценарииТочки.Точка КАК Точка,
		|	Истина КАК Удален
		|ИЗ
		|	Справочник.Сценарии.Точки КАК СценарииТочки
		|ГДЕ
		|	СценарииТочки.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяТочка = ГСиТочки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяТочка, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЕсли;
	
	Если не ГС.ЭлементыГрафическойСхемы.Количество() = 0 Тогда
		Для каждого ЭлементГС из ГС.ЭлементыГрафическойСхемы Цикл
			мсСоответствияПоИмени = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки", ЭлементГС.Имя));
			Если мсСоответствияПоИмени.Количество() = 0 Тогда
				НоваяТочка = ГСиТочки.Добавить();
				НоваяТочка.ИмяТочки = ЭлементГС.Имя;
				НоваяТочка.Удален = Ложь;
			Иначе	мсСоответствияПоИмени[0].Удален = Ложь;
			КонецЕсли;	 
		КонецЦикла;	
	КонецЕсли;	
	
	ГрафическаяСхемаКлиентСерверПКМП.ОбновитьДанныеГС(ГС, СодержаниеГС);
	
КонецПроцедуры	



&НаКлиенте
Функция ПроверитьКорректностьГрафическойСхемы()
	РезультатПроверки = ГрафическаяСхемаКлиентСерверПКМП.ПроверитьКорректностьГрафическойСхемы(ГС);
	Если не РезультатПроверки.Успех Тогда
		Объект.РежимРедактирования = ТекущийРежимРедактирования;
		Ошибки = Неопределено;
		Для каждого Ошибка из РезультатПроверки.Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ГС", Ошибка);
		КонецЦикла;	
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат Ложь;
	КонецЕсли;	
	Возврат Истина;
КонецФункции	

#КонецОбласти


