
&НаКлиенте
Процедура ГСВыбор(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ГСПриАктивизации(Элемент)
	Для каждого ЭлементГС из ГС.ЭлементыГрафическойСхемы Цикл
		Сообщить(ЭлементГС.Имя);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ГСПриИзменении(Элемент)
	
	Для каждого ЭлементГС из ГС.ЭлементыГрафическойСхемы Цикл
		Сообщить(ЭлементГС.Имя);
	КонецЦикла;	



КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СхемаПроцесса = Новый ХранилищеЗначения(ГС);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ГС = ТекущийОбъект.СхемаПроцесса.Получить();
	
	Если ГС <> Неопределено Тогда
		Элементы.ГС.Доступность = Истина;
	Иначе
		Элементы.ГС.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры



