
&НаКлиенте
Перем АктивныйЭлементГС;
&НаСервере
Перем ГСиТочки;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИзменениеЗаголовковКнопокУправленияГС(Элементы.КП_ГрафическаяСхема);
	
	ВидимостьПериодаВыполнения();
	
	ПолучитьСтатус();
	
	ИнициализироватьСоответствиеГСиТочки();
КонецПроцедуры

&НаСервере 
Процедура ИнициализироватьСоответствиеГСиТочки()
	
	ГСиТочки = Новый ТаблицаЗначений;
	ГСиТочки.Колонки.Добавить("ИмяТочки",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ГСиТочки.Колонки.Добавить("ЭлементТочки",Новый ОписаниеТипов);
	ГСиТочки.Колонки.Добавить("Точка",	Метаданные.ОпределяемыеТипы.ТочкиСценария.Тип);
	ГСиТочки.Колонки.Добавить("Удален",Новый ОписаниеТипов("Булево"));

	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СценарииТочки.ИмяТочки КАК ИмяТочки,
		|	СценарииТочки.Точка КАК Точка,
		|	ЛОЖЬ КАК Удален
		|ИЗ
		|	Справочник.Сценарии.Точки КАК СценарииТочки
		|ГДЕ
		|	СценарииТочки.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяТочка = ГСиТочки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяТочка, ВыборкаДетальныеЗаписи);
			НоваяТочка.ЭлементТочки = ГС.ЭлементыГрафическойСхемы.Найти(НоваяТочка.ИмяТочки);
		КонецЦикла;
	КонецЕсли;
	
	Если не ГС.ЭлементыГрафическойСхемы.Количество() = 0 Тогда
		Для каждого ЭлементГС из ГС.ЭлементыГрафическойСхемы Цикл
			мсСоответствияПоИмени = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки", ЭлементГС.Имя));
			Если мсСоответствияПоИмени.Количество() = 0 Тогда
				НоваяТочка = ГСиТочки.Добавить();
				НоваяТочка.ИмяТочки = ЭлементГС.Имя;
				НоваяТочка.ЭлементТочки = ЭлементГС;
			КонецЕсли;	 
		КонецЦИкла;	
	КонецЕсли;	
	
	АдресГСиТочки = ПоместитьВоВременноеХранилище(ГСиТочки, УникальныйИдентификатор);
	
КонецПроцедуры	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СхемаПроцесса = Новый ХранилищеЗначения(ГС);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ГС = ТекущийОбъект.СхемаПроцесса.Получить();
	
	Если ГС <> Неопределено Тогда
		Элементы.ГС.Доступность = Истина;
	Иначе
		Элементы.ГС.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РежимРедактированияПриИзменении(Неопределено);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаСервере
Процедура ЗапуститьНаСервере()
	
КонецПроцедуры



&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область УправлениеФормой

// Рекурсивно обходит элементы формы и переопределяет заголовки кнопок управления группами шагов сценария.
//
// Параметры:
//   ЭлементОбработки - ГруппаФормы - элемент формы, дочерние элементы которого обрабатываются рекурсивно
//                   - КнопкаФормы - кнопка формы, заголовок которой переопределяется по её имени
&НаСервере
Процедура ИзменениеЗаголовковКнопокУправленияГС(ЭлементОбработки)
	Если ТипЗнч(ЭлементОбработки) = Тип("ГруппаФормы") Тогда
		Для Каждого ПодчиненныйЭлемент Из ЭлементОбработки.ПодчиненныеЭлементы Цикл
				ИзменениеЗаголовковКнопокУправленияГС(ПодчиненныйЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементОбработки) = Тип("КнопкаФормы") Тогда
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементСтарт" Тогда ЭлементОбработки.Заголовок = "Условие запуска" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементДействие" Тогда ЭлементОбработки.Заголовок = "Группа шагов" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементРазделение" Тогда ЭлементОбработки.Заголовок = "Разделение" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементОбработка" Тогда ЭлементОбработки.Заголовок = "Ожидание" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементУсловие" Тогда ЭлементОбработки.Заголовок = "Условие" КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Асинх Функция ПроверитьИзменениеТекущейТочки()
	
КонецФункции	


&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьГрафическойСхемы()
	РезультатПроверки = ГрафическаяСхемаКлиентСерверПКМП.ПроверитьКорректностьГрафическойСхемы(ГС);
	Если не РезультатПроверки.Успех Тогда
		Объект.РежимРедактирования = ТекущийРежимРедактирования;
		Ошибки = Неопределено;
		Для каждого Ошибка из РезультатПроверки.Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ГС", Ошибка);
		КонецЦикла;	
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат Ложь;
	КонецЕсли;	
	Возврат Истина;
КонецФункции	

&НаКлиенте
Процедура РежимРедактированияПриИзменении(Элемент)
	
	Если Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Создание") Тогда
		Элементы.ГС.ТолькоПросмотр = Ложь;
		Элементы.ГС.Редактирование = Истина;
	ИначеЕсли Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Разработка") Тогда
		Если не ПроверитьКорректностьГрафическойСхемы() Тогда
			Возврат;
		КонецЕсли;	
		Элементы.ГС.ТолькоПросмотр = Истина;
		Элементы.ГС.Редактирование = Истина;
	ИначеЕсли Объект.РежимРедактирования = ПредопределенноеЗначение("Перечисление.РежимыРедактирования.Готовность") Тогда
		Если не ПроверитьКорректностьГрафическойСхемы() Тогда
			Возврат;
		КонецЕсли;	
		
		
//		АдресГСиТочки = ПоместитьВоВременноеХранилище(ГСиТочки, УникальныйИдентификатор);
//		
//		Ошибки = Неопределено;
//		Для каждого ЭлементГС из ГС.ЭлементыГрафическойСхемы Цикл
//			мсСоответствияПоИмени = ГСиТочки.НайтиСтроки(Новый Структура("ИмяТочки", ЭлементГС.Имя));
//			Если мсСоответствияПоИмени.Количество() = 0 или не ЗначениеЗаполнено(мсСоответствияПоИмени[0].Точка) Тогда
//				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ГС", СтрШаблон("У точки сценария ""%1"" отсутствуют настройки."));
//			КонецЕсли;	 
//		КонецЦИкла;
//		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
//		Если не Ошибки = Неопределено Тогда
//			Возврат;
//		КонецЕсли;
				
		
		Элементы.ГС.ТолькоПросмотр = Истина;
		Элементы.ГС.Редактирование = Ложь; 
	КонецЕсли;	
	
	ТекущийРежимРедактирования = Объект.РежимРедактирования;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	

#КонецОбласти
	
#Область ОбработкаГрафическойСхемы
&НаКлиенте
Процедура ГСВыбор(Элемент)
	ПоказатьПредупреждение(, "Выбор");	
КонецПроцедуры

&НаКлиенте
//отслеживание соответствия элементов ГС таблице ГСиТочки
//может быть: добавление, удаление, критичное изменение имени элемента ГС через интерактивные свойства (типа инициативный пользователь)
Процедура ГСПриИзменении(Элемент)
	ПоказатьПредупреждение(, "Измекнение");	
	Для каждого ЭлементГС из ГС Цикл
		//Элементы.ГС.
	КонецЦИкла;		
КонецПроцедуры
#КонецОбласти


