

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИзменениеЗаголовковКнопокУправленияГС(Элементы.КП_ГрафическаяСхема);
	
	ВидимостьПериодаВыполнения();
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеЗаголовковКнопокУправленияГС(ЭлементОбработки)
	
	Если ТипЗнч(ЭлементОбработки) = Тип("ГруппаФормы") Тогда
		Для Каждого ПодчиненныйЭлемент Из ЭлементОбработки.ПодчиненныеЭлементы Цикл
				ИзменениеЗаголовковКнопокУправленияГС(ПодчиненныйЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементОбработки) = Тип("КнопкаФормы") Тогда
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементСтарт" Тогда ЭлементОбработки.Заголовок = "Условие запуска" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементДействие" Тогда ЭлементОбработки.Заголовок = "Группа шагов" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементРазделение" Тогда ЭлементОбработки.Заголовок = "Разделение" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементОбработка" Тогда ЭлементОбработки.Заголовок = "Ожидание" КонецЕсли;
		Если ЭлементОбработки.Имя = "ГСВставитьЭлементУсловие" Тогда ЭлементОбработки.Заголовок = "Условие" КонецЕсли;
	КонецЕсли;	
	
				
КонецПроцедуры	


&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры
	
&НаКлиенте
Процедура ГСВыбор(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ГСПриАктивизации(Элемент)
		Сообщить(Элементы.ГС.ТекущийЭлемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ГСПриИзменении(Элемент)
	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СхемаПроцесса = Новый ХранилищеЗначения(ГС);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ГС = ТекущийОбъект.СхемаПроцесса.Получить();
	
	Если ГС <> Неопределено Тогда
		Элементы.ГС.Доступность = Истина;
	Иначе
		Элементы.ГС.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры



