
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	РазрешитьРедактированиеНаименование = Истина;
	РазрешитьРедактированиеГруппаДоступа                      = Истина;
	РазрешитьРедактированиеШтрихкод                        = Истина;
	РазрешитьРедактированиеАртикул                = Истина;
	РазрешитьРедактированиеПроизводитель                    = Истина;
	РазрешитьРедактированиеТоварнаяКатегория                    = Истина;
	РазрешитьРедактированиеURLКартинки                    = Истина;
	РазрешитьРедактированиеURLПродукта                    = Истина;
	РазрешитьРедактированиеСрокГодностиВДнях                    = Истина;
	РазрешитьРедактированиеЦенИСебестоимости                    = Истина;
	РазрешитьРедактированиеРодитель                    = Истина;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеНаименование Тогда
		Результат.Добавить("Наименование");
	КонецЕсли;
	
	Если РазрешитьРедактированиеГруппаДоступа Тогда
		Результат.Добавить("ГруппаДоступа");
	КонецЕсли;
	
	Если РазрешитьРедактированиеШтрихкод Тогда
		Результат.Добавить("Штрихкод");
	КонецЕсли;
	
	Если РазрешитьРедактированиеАртикул Тогда
		Результат.Добавить("Артикул");
	КонецЕсли;
	
	Если РазрешитьРедактированиеПроизводитель Тогда
		Результат.Добавить("Производитель");
	КонецЕсли;
	
	Если РазрешитьРедактированиеТоварнаяКатегория Тогда
		Результат.Добавить("ТоварнаяКатегория");
	КонецЕсли;
	
	Если РазрешитьРедактированиеURLКартинки Тогда
		Результат.Добавить("URLКартинки");
	КонецЕсли;
	
	Если РазрешитьРедактированиеURLПродукта Тогда
		Результат.Добавить("URLПродукта");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСрокГодностиВДнях Тогда
		Результат.Добавить("СрокГодностиВДнях");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЦенИСебестоимости Тогда
		Результат.Добавить("Цена");
		Результат.Добавить("ЦенаРеальная");
		Результат.Добавить("Себестоимость");
	КонецЕсли;
	
	
	Если РазрешитьРедактированиеРодитель Тогда
		Результат.Добавить("Родитель");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти
