
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()

	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Справочники.ЧасовыеПояса.ПолучитьМакет("ЧасовыеПоясаПоУмолчанию").Область());
	ПостроительЗапроса.Выполнить();
	ТЗРезультат = ПостроительЗапроса.Результат.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗРезультат.КодЧасовогоПояса КАК КодЧасовогоПояса,
	|	ТЗРезультат.НаименованиеЧасовогоПояса КАК НаименованиеЧасовогоПояса
	|ПОМЕСТИТЬ ВТ_ЧасовыеПоясаПоУмолчанию
	|ИЗ
	|	&ТЗРезультат КАК ТЗРезультат
	|ГДЕ
	|	НЕ СОКРЛП(ТЗРезультат.КодЧасовогоПояса) = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЧасовыеПоясаПоУмолчанию.КодЧасовогоПояса КАК КодЧасовогоПояса,
	|	ВТ_ЧасовыеПоясаПоУмолчанию.НаименованиеЧасовогоПояса КАК НаименованиеЧасовогоПояса
	|ИЗ
	|	ВТ_ЧасовыеПоясаПоУмолчанию КАК ВТ_ЧасовыеПоясаПоУмолчанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЧасовыеПояса КАК ЧасовыеПояса
	|		ПО ВТ_ЧасовыеПоясаПоУмолчанию.КодЧасовогоПояса = ЧасовыеПояса.Код
	|ГДЕ
	|	ЧасовыеПояса.Ссылка ЕСТЬ NULL";

	Запрос.УстановитьПараметр("ТЗРезультат", ТЗРезультат);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовыйЭлемент = Справочники.ЧасовыеПояса.СоздатьЭлемент();
		НовыйЭлемент.Код = Выборка.КодЧасовогоПояса;
		НовыйЭлемент.Наименование = Выборка.НаименованиеЧасовогоПояса;
		НовыйЭлемент.Записать();
	КонецЦикла;

	Элементы.Список.Обновить();

КонецПроцедуры
