
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Контрагенты
		Если Не ВидОтбораПоКлиентам.Пустая() Тогда
			Если СегментКлиентов.Пустая() Тогда
				ОписаниеГруппы.Добавить("Не указан сегмент клиентов. ");
			КонецЕсли;
		Иначе
			ОписаниеГруппы.Добавить("Не указан вид отбора по клиентам.");
		КонецЕсли;
	//Доступность" Тогда
		Если ОграничитьПоПромокодам Тогда
			Если НаборПромокодов.Пустая() Тогда
				ОписаниеГруппы.Добавить("Не указан набор промокодов.");
			КонецЕсли;
		КонецЕсли;

		Если ОграничитьПоВремени Тогда
			Если ПустаяСтрока(ДниНедели) Тогда
				ОписаниеГруппы.Добавить("Не указаны дни недели доступности.");
			КонецЕсли;
			Если Не НеОграничиватьВремяСрабатывания Тогда
				Если ВремяС >= ВремяПо Тогда
					ОписаниеГруппы.Добавить(СтрШаблон("(с <b>%1</b> по <b>%2</b>  - некорректно указан интервал времени) ", Формат(ВремяС,
						"ДФ=ЧЧ:мм; ДП=00:00;"), Формат(ВремяПо, "ДФ=ЧЧ:мм; ДП=00:00;")));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	//Места" Тогда
		ФильтрКаналов  = "во всех каналах";
		ФильтрЗон  = "во всех зонах";
		ЕстьОшибкиМест = Ложь;
		Если ОграничитьПоКаналам Тогда
			Если КаналыОтбор.Количество() = 0 Тогда
					ЕстьОшибкиМест = Истина;
					ФильтрКаналов = "<не указаны каналы>";
				КонецЕсли;
		КонецЕсли;
		Если ОграничитьПоЗонам Тогда
			Если ЗоныДоставкиОтбор.Количество() = 0 Тогда
					ЕстьОшибкиМест = Истина;
					ФильтрКаналов = "<не указаны зоны>";
			КонецЕсли;
		КонецЕсли;
		Если ЕстьОшибкиМест Тогда
			ОписаниеГруппы.Добавить(СтрШаблон("Некорректно указаны данные по местам применения <b>%1</b> и <b>%2</b>", ФильтрКаналов, ФильтрЗон));
		КонецЕсли;
	//Продукты" Тогда
		Если ОграничитьПоПродуктам или ОграничитьЗаказыПоПродуктам Тогда
			Если ДействиеАкцииПоПродуктам.Пустая() Тогда
				ОписаниеГруппы.Добавить("Не указано действие акции при установленных отборах.");
			КонецЕсли;
		КонецЕсли;
		Если ОграничитьПоПродуктам Тогда
			Если ВариантОграниченияПоПродуктам.Пустая() Тогда
				ОписаниеГруппы.Добавить("Не указан вариант ограничения по продуктам.");
			ИначеЕсли ВариантОграниченияПоПродуктам = ПредопределенноеЗначение(
				"Перечисление.ВариантыОграниченияПоПродуктам.ВСписке") Тогда
				Если СписокОтбораТоваровПоПродуктам.Количество() = 0 Тогда
					ОписаниеГруппы.Добавить("Список продуктов не заполнен.");
				КонецЕсли;
			Иначе
				Если СегментНоменклатурыПоПродуктам.Пустая() Тогда
					ОписаниеГруппы.Добавить("Сегмент продуктов не указан.");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Справочники.ПрограммыАкций.ПроверитьДействияАкцииПоПродуктам(ЭтотОбъект, Отказ);
	//Заказы" Тогда
		Если ДействияАкцииПоЗаказам.Количество() = 0 Тогда
			ОписаниеГруппы.Добавить("Не указаны действия акции по заказу.");
		Иначе	
			Справочники.ПрограммыАкций.ПроверитьДействияАкцииПоЗаказам(ЭтотОбъект, Отказ);
		КонецЕсли;	
	//Лимиты" Тогда
		Если ЕстьЛимитОбщийКоличество Тогда
			Если ЛимитОбщийКоличество = 0 Тогда
				ОписаниеГруппы.Добавить("Не указан лимит общего количества.");
			КонецЕсли;
		КонецЕсли;

		Если ЕстьЛимитОбщийСумма Тогда
			Если ЛимитОбщийСумма = 0 Тогда
				ОписаниеГруппы.Добавить("Не указан лимит общей суммы.");
			КонецЕсли;
		КонецЕсли;

		Если ЕстьЛимитПерсональныйКоличество Тогда
			Если ЛимитПерсональныйКоличество = 0 Тогда
				ОписаниеГруппы.Добавить("Не указан персональный лимит количества.");
			КонецЕсли;
		КонецЕсли;

		Если ЕстьЛимитПерсональныйСумма Тогда
			Если ЛимитПерсональныйСумма = 0 Тогда
				ОписаниеГруппы.Добавить("Не указан персональный лимит суммы.");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
