
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если не НачалоПослеЗапуска Тогда ПроверяемыеРеквизиты.Добавить("ДатаНачалаВыполнения");КонецЕсли;
	Если не ОстановкаВручную Тогда ПроверяемыеРеквизиты.Добавить("ДатаОстановки");КонецЕсли;
	
	
	//Контрагенты
		Если ВидОтбораПоКлиентам = Перечисления.ЕстьНетНеВажно.Есть или ВидОтбораПоКлиентам = Перечисления.ЕстьНетНеВажно.Нет Тогда
			Если СегментКлиентов.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан сегмент клиентов. ", , "Объект.СегментКлиентов", , Отказ);
			КонецЕсли;
		ИначеЕсли ВидОтбораПоКлиентам.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан вид отбора по клиентам.", , "Объект.ВидОтбораПоКлиентам", , Отказ);
		КонецЕсли;
	//Доступность
		Если ОграничитьПоПромокодам Тогда
			Если НаборПромокодов.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан набор промокодов.", , "Объект.НаборПромокодов", , Отказ);
			КонецЕсли;
		КонецЕсли;

		Если ОграничитьПоВремени Тогда
			Если ПустаяСтрока(ДниНедели) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны дни недели доступности.", , "Объект.ОграничитьПоВремени", , Отказ);
			КонецЕсли;
			Если Не НеОграничиватьВремяСрабатывания Тогда
				Если ВремяС >= ВремяПо Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("(с %1 по %2  - некорректно указан интервал времени) ", Формат(ВремяС,
					"ДФ=ЧЧ:мм; ДП=00:00;"), Формат(ВремяПо, "ДФ=ЧЧ:мм; ДП=00:00;")), , "Объект.ВремяС", , Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	//Места
		ФильтрКаналов  = "во всех каналах";
		ФильтрЗон  = "во всех зонах";
		ЕстьОшибкиМест = Ложь;
		Если ОграничитьПоКаналам Тогда
			Если КаналыОтбор.Количество() = 0 Тогда
					ЕстьОшибкиМест = Истина;
					ФильтрКаналов = "<не указаны каналы>";
					Поле = "Объект.ОграничитьПоКаналам";
				КонецЕсли;
		КонецЕсли;
		Если ОграничитьПоЗонам Тогда
			Если ЗоныДоставкиОтбор.Количество() = 0 Тогда
					ЕстьОшибкиМест = Истина;
					ФильтрКаналов = "<не указаны зоны>";
					Поле = "Объект.ОграничитьПоЗонам";
			КонецЕсли;
		КонецЕсли;
		Если ЕстьОшибкиМест Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Некорректно указаны данные по местам применения <b>%1</b> и <b>%2</b>", ФильтрКаналов, ФильтрЗон), ,Поле , , Отказ);
		КонецЕсли;
	//Продукты
		Если ОграничитьПоПродуктам или ОграничитьЗаказыПоПродуктам Тогда
			Если ДействиеАкцииПоПродуктам.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано действие акции при установленных отборах.", , "Объект.ДействиеАкцииПоПродуктам", , Отказ);
			КонецЕсли;
		КонецЕсли;
		Если ОграничитьПоПродуктам Тогда
			Если ВариантОграниченияПоПродуктам.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан вариант ограничения по продуктам.", , "Объект.ВариантОграниченияПоПродуктам", , Отказ);
			ИначеЕсли ВариантОграниченияПоПродуктам = ПредопределенноеЗначение(
				"Перечисление.ВариантыОграниченияПоПродуктам.ВСписке") Тогда
				Если не Справочники.ПрограммыАкций.СписокОтбораЗаполнен(ЭтотОбъект, "ПоПродуктам") Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Список продуктов не заполнен.", , "СписокОтбораТоваровПоПродуктам", , Отказ);
				КонецЕсли;
			Иначе
				Если СегментНоменклатурыПоПродуктам.Пустая() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сегмент продуктов не указан.", , "Объект.СегментНоменклатурыПоПродуктам", , Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Справочники.ПрограммыАкций.ПроверитьДействияАкцииПоПродуктам(ЭтотОбъект, Отказ);
	//Заказы 
		Если ДействияАкцииПоЗаказам.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны действия акции по заказу.", , "Объект.ДействияАкцииПоЗаказам", , Отказ);
		Иначе	
			Справочники.ПрограммыАкций.ПроверитьДействияАкцииПоЗаказам(ЭтотОбъект, Отказ);
		КонецЕсли;	
	//Лимиты
		Если ЕстьЛимитОбщийКоличество Тогда
			Если ЛимитОбщийКоличество = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан лимит общего количества.", , "Объект.ЛимитОбщийКоличество", , Отказ);
			КонецЕсли;
		КонецЕсли;

		Если ЕстьЛимитОбщийСумма Тогда
			Если ЛимитОбщийСумма = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан лимит общей суммы.", , "Объект.ЛимитОбщийСумма", , Отказ);
			КонецЕсли;
		КонецЕсли;

		Если ЕстьЛимитПерсональныйКоличество Тогда
			Если ЛимитПерсональныйКоличество = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан персональный лимит количества.", , "Объект.ЛимитПерсональныйКоличество", , Отказ);
			КонецЕсли;
		КонецЕсли;

		Если ЕстьЛимитПерсональныйСумма Тогда
			Если ЛимитПерсональныйСумма = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан персональный лимит суммы.", , "Объект.ЛимитПерсональныйСумма", , Отказ);
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры
