
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ЕстьОшибки = Ложь;
	ОписаниеГруппы = Новый Массив;
	Если ИДГруппы = "Контрагенты" Тогда
		Если Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") Тогда
			ОписаниеГруппы.Добавить("Для всех клиентов.");
		ИначеЕсли Не Объект.ВидОтбораПоКлиентам.Пустая() Тогда
			Если Объект.СегментКлиентов.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан сегмент клиентов. ");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Для клиентов %1 из сегмента <b>""%2""</b>. ", ?(
					Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.Нет"), "не", ""),
					Объект.СегментКлиентов));
			КонецЕсли;
		Иначе
			ЕстьОшибки = Истина;
			ОписаниеГруппы.Добавить("Не указан вид отбора по клиентам.");
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Доступность" Тогда
		Если Не Объект.ОграничитьПоПромокодам И Не Объект.ОграничитьПоВремени Тогда
			ОписаниеГруппы.Добавить("Доступно всегда.");
		КонецЕсли;
		Если Объект.ОграничитьПоПромокодам Тогда
			Если Объект.НаборПромокодов.Пустая() Тогда
				ОписаниеГруппы.Добавить("Не указан набор промокодов.");
				ЕстьОшибки = Истина;
			Иначе
				ДополнениеПромокодовПоКоличеству = "";
				Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
					ДополнениеПромокодовПоКоличеству = СтрШаблон("(не более <b>%1 %2</b> из набора в одном заказе)",
						Объект.КоличествоПромокодовВЗаказе, Элементы.ДекорацияПромокоды2.Заголовок);
				КонецЕсли;
				ОписаниеГруппы.Добавить(СтрШаблон("При доступности промокода из набора <b>""%1""</b> %2. ",
					Объект.НаборПромокодов, ДополнениеПромокодовПоКоличеству));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ОграничитьПоВремени Тогда
			Если ПустаяСтрока(Объект.ДниНедели) Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указаны дни недели доступности.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("Доступна в дни недели <b>%1</b> ",
					ОбщегоНазначенияПКМПКлиентСервер.НаименованияДнейНедели(Объект.ДниНедели)));
			КонецЕсли;
			Если Не Объект.НеОграничиватьВремяСрабатывания Тогда
				ИнтервалНекорректен = "";
				Если Объект.ВремяС >= Объект.ВремяПо Тогда
					ЕстьОшибки = Истина;
					ИнтервалНекорректен = " - некорректно указан интервал времени";
				КонецЕсли;
				ОписаниеГруппы.Добавить(СтрШаблон("(с <b>%1</b> по <b>%2</b> %3) ", Формат(Объект.ВремяС,
					"ДФ=ЧЧ:мм; ДП=00:00;"), Формат(Объект.ВремяПо, "ДФ=ЧЧ:мм; ДП=00:00;"), ИнтервалНекорректен));
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Места" Тогда
		ФильтрКаналов  = "во всех каналах";
		ФильтрЗон  = "во всех зонах";
		Если Объект.ОграничитьПоКаналам Тогда
			Если Не ДеревоКаналов.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоКаналов, Новый Структура("Отметка",
					Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны каналы>";
				Иначе
					ФильтрКаналов =  "в каналах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных,
						20, , "ЗначениеОтбора");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Объект.ОграничитьПоЗонам Тогда
			Если Не ДеревоЗон.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивОтмеченных =  ОтчетыКлиентСервер.НайтиСтрокиТаблицы(ДеревоЗон, Новый Структура("Отметка", Истина));
				Если МассивОтмеченных.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ФильтрКаналов = "<не указаны зоны>";
				Иначе
					ФильтрКаналов =  "в зонах " + ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(МассивОтмеченных,
						20, , "ЗначениеОтбора");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ОписаниеГруппы.Добавить(СтрШаблон("Промоакция действует <b>%1</b> и <b>%2</b>", ФильтрКаналов, ФильтрЗон));
	ИначеЕсли ИДГруппы = "Продукты" Тогда
		Если Не Объект.ОграничитьПоПродуктам И Не Объект.ОграничитьЗаказыПоПродуктам Тогда
			ОписаниеГруппы.Добавить("Для всех продуктов.");
		Иначе
			Если Объект.ДействиеАкцииПоПродуктам.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указано действие акции при установленных отборах.");
//			Иначе
//				ОписаниеГруппы.Добавить(СтрШаблон("Выполнить действие: <b>%1</b>", Объект.ДействиеАкцииПоПродуктам));
			КонецЕсли;
		КонецЕсли;
		Если Объект.ОграничитьПоПродуктам Тогда
			Если Объект.ВариантОграниченияПоПродуктам.Пустая() Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан вариант ограничения по продуктам.");
			ИначеЕсли Объект.ВариантОграниченияПоПродуктам = ПредопределенноеЗначение(
				"Перечисление.ВариантыОграниченияПоПродуктам.ВСписке") Тогда
				Если СписокОтбораТоваровПоПродуктам.Количество() = 0 Тогда
					ЕстьОшибки = Истина;
					ОписаниеГруппы.Добавить("Список продуктов не заполнен.");
				Иначе
					ОписаниеГруппы.Добавить("Промоакция действует на товары: <b>"
						+ ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(СписокОтбораТоваровПоПродуктам, 100) + "<b>");
				КонецЕсли;
			Иначе
				Если Объект.СегментНоменклатурыПоПродуктам.Пустая() Тогда
					ЕстьОшибки = Истина;
					ОписаниеГруппы.Добавить("Сегмент продуктов не указан.");
				Иначе
					ОписаниеГруппы.Добавить("Промоакция действует на товары сегмента: <b>"
						+ Объект.СегментНоменклатурыПоПродуктам + "</b>");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Объект.ОграничитьЗаказыПоПродуктам Тогда
			Если Компоновщик_ЗаказыПоПродуктам.Настройки.Отбор.Элементы.Количество() = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан отбор по заказам.");
			Иначе
				ОписаниеГруппы.Добавить("Отбор по заказам: "
					+ КомпоновкаИРасписание_ПКМПКлиентСервер.ТекстовоеПредставлениеОтбораКомпоновки(
					Компоновщик_ЗаказыПоПродуктам.Настройки));
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИДГруппы = "Заказы" Тогда
		Если Объект.ОграничитьПоЗаказам Тогда
			Если Компоновщик_ПоЗаказам.Настройки.Отбор.Элементы.Количество() = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан отбор по заказам.");
			Иначе
				ОписаниеГруппы.Добавить("Отбор по заказам: "
					+ КомпоновкаИРасписание_ПКМПКлиентСервер.ТекстовоеПредставлениеОтбораКомпоновки(
					Компоновщик_ПоЗаказам.Настройки));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ДействияАкцииПоЗаказам.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ОписаниеГруппы.Добавить("Не указаны действия акции по заказу.");
		Иначе
//			ОписаниеГруппы.Добавить(СтрШаблон("Выполнить действия: <b>%1</b>",
//				ОбщегоНазначенияПКМПКлиентСервер.СократитьСтроку(Объект.ДействияАкцииПоЗаказам, 100, ,
//				"ДействиеАкции")));
		КонецЕсли;	
	ИначеЕсли ИДГруппы = "Лимиты" Тогда
		Если Объект.ЕстьЛимитОбщийКоличество Тогда
			Если Объект.ЛимитОбщийКоличество = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан лимит общего количества.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитОбщийКоличество.Заголовок,
					Объект.ЛимитОбщийКоличество, Элементы.ТекстРазЛОК.Заголовок, ?(
					Объект.ПериодЛимитаОбщийКоличество.Пустая(), "", Объект.КоличествоПериодовЛимитаОбщийКоличество), ?(
					Объект.ПериодЛимитаОбщийКоличество.Пустая(), "всё время акции", НРег(
					Элементы.ПериодЛимитаОбщийКоличество.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ЕстьЛимитОбщийСумма Тогда
			Если Объект.ЛимитОбщийСумма = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан лимит общей суммы.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитОбщийСумма.Заголовок,
					Объект.ЛимитОбщийСумма, Элементы.ТекстРубЛОС.Заголовок, ?(Объект.ПериодЛимитаОбщийСумма.Пустая(),
					"", Объект.КоличествоПериодовЛимитаОбщийСумма), ?(Объект.ПериодЛимитаОбщийСумма.Пустая(),
					"всё время акции", НРег(Элементы.ПериодЛимитаОбщийСумма.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ЕстьЛимитПерсональныйКоличество Тогда
			Если Объект.ЛимитПерсональныйКоличество = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан персональный лимит количества.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>",
					Элементы.ЕстьЛимитПерсональныйКоличество.Заголовок, Объект.ЛимитПерсональныйКоличество,
					Элементы.ТекстРазЛПК.Заголовок, ?(Объект.ПериодЛимитаПерсональныйКоличество.Пустая(), "",
					Объект.КоличествоПериодовЛимитаПерсональныйКоличество), ?(
					Объект.ПериодЛимитаПерсональныйКоличество.Пустая(), "всё время акции", НРег(
					Элементы.ПериодЛимитаПерсональныйКоличество.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;

		Если Объект.ЕстьЛимитПерсональныйСумма Тогда
			Если Объект.ЛимитПерсональныйСумма = 0 Тогда
				ЕстьОшибки = Истина;
				ОписаниеГруппы.Добавить("Не указан персональный лимит суммы.");
			Иначе
				ОписаниеГруппы.Добавить(СтрШаблон("%1 <b>%2 %3 %4 %5</b>", Элементы.ЕстьЛимитПерсональныйСумма.Заголовок,
					Объект.ЛимитПерсональныйСумма, Элементы.ТекстРубЛПС.Заголовок, ?(
					Объект.ПериодЛимитаПерсональныйСумма.Пустая(), "", Объект.КоличествоПериодовЛимитаПерсональныйСумма),
					?(Объект.ПериодЛимитаПерсональныйСумма.Пустая(), "всё время акции", НРег(
					Элементы.ПериодЛимитаПерсональныйСумма.ТекстРедактирования))));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
