
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИДСвязиПриСоздании") Тогда
		ИДСвязиПриСоздании = Параметры.ИДСвязиПриСоздании;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьТочкиСценария",ИДСвязиПриСоздании,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеРазделенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
//	Если Объект.НаправлениеРазделения.Количество() = 2 Тогда
//			Сообщение = НОвый СообщениеПользователю;
//			Сообщение.Текст = НСтр("ru = 'Максимальное количество направлений - 2.'");
//			Сообщение.Сообщить();
//			Отказ = Истина;
//	КонецЕсли;
КонецПроцедуры
