#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Предопределенный и не ПустаяСтрока(ИмяПредопределенныхДанных) и не ИмяПредопределенныхДанных = КодДействия Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("Код действия """+КодДействия+""" отличается от имени предопределенного справочника  - "+ИмяПредопределенныхДанных);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыДействийКлиента");
	ЭлементБлокировки.УстановитьЗначение("КодДействия", КодДействия);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	
	Попытка
		Блокировка.Заблокировать();
	Исключение
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не удалось заблокировать справочник ""Виды действий клиента""'");
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВидыДействийКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыДействийКлиента КАК ВидыДействийКлиента
		|ГДЕ
		|	ВидыДействийКлиента.КодДействия = &КодДействия
		|	И ВидыДействийКлиента.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("КодДействия", КодДействия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон(
			"Элемент с кодом действия ""%1"" уже существует.", КодДействия);
		СообщениеПользователю.Поле = "КодДействия";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#КонецЕсли