#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормойНаКлиенте();
	ЛимитСрабатыванияНаКлиентеПриИзменении(Неопределено);
	ЧастотаЗапускаПриИзменении(Неопределено);

	//обработка списков формы
	ОбработкаИндикацииПодсказкиВвода("ДействияВСессии_КлиентПокинулСайтИлиПриложение","Любые или никаких");
	ОбработкаИндикацииПодсказкиВвода("ПоляИзменения_ИзменениеДанныхЗаказа","Любые");
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ПродуктВЗаказеДоставлен","Из любого сегмента");
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ПродуктВЗаказеОплачен","Из любого сегмента");
	ОбработкаИндикацииПодсказкиВвода("СегментыКлиентов_КлиентПопалВСегмент","В любой сегмент");
	ОбработкаИндикацииПодсказкиВвода("СегментыКлиентов_КлиентВышелИзСегмента","Из любого сегмента");
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ИзменилсяПродуктВСписке","В любом");
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ИзменилсяПросмотренныйПродукт","В любом");
	ОбработкаИндикацииПодсказкиВвода("ПричиныНедоставки_РассылкаНеДоставлена","Любая");
	
	НастройкиОтборПриИзменении(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СВД = Справочники.ВидыДействийКлиента;
	ЭДЗ = Элементы.ДействиеЗапуска;
	КартинкаПункта = БиблиотекаКартинок.ВажностьНеЗадана;
	
	//перечень действий
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Действия клиентов");
	ЭДЗ.СписокВыбора.Добавить(СВД.ДействиеВКампании, "Действие в кампании..." , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПокинулСайтИлиПриложение, "Клиент покинул сайт/приложение" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.УстановкаСпискаПродуктов, "Список продуктов изменился" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ЗапрошенКодАвторизацииВОперации, "Клиент запросил код авторизации" , , КартинкаПункта);
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Заказы");
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеСтатусаЗаказа, "Статус заказа изменен" , , КартинкаПункта);
	
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеДанныхЗаказа, "Данные заказа изменены" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.СозданиеЗаказа, "Новый заказ" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПродуктВЗаказеОплачен, "Продукт в заказе оплачен" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПродуктВЗаказеДоставлен,	"Продукт в заказе доставлен" , , КартинкаПункта);
	
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Сегменты");
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПопалВСегмент, "Клиент попал в сегмент" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентВышелИзСегмента, "Клиент вышел из сегмента" , , КартинкаПункта);
		
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Обновление профиля клиента");
	ЭДЗ.СписокВыбора.Добавить(СВД.СтатусПодпискиИзменен,	"Статус подписки изменен" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.СозданиеКлиента,	"Новый клиент" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПодтверждениеEmail,	"Подтверждение Email" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеEmail,	"Изменение Email" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПодтверждениеМобильногоТелефона,	"Подтверждение мобильного телефона" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеМобильногоТелефона,	"Изменение мобильного телефона" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.РедактированиеКлиента,	"Изменение данных клиента" , , КартинкаПункта);
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Изменение цены или наличия продукта");
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменилсяПродуктВСписке,	"Изменился продукт в списке" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменилсяПросмотренныйПродукт,	"Изменился просмотренный продукт" , , КартинкаПункта);
	
	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Программа лояльности");
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПрименилПромокод,	"Клиент применил промокод" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентуВыданПромокод,	"Клиенту выдан промокод" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеБалансаБалловПоДействию,	"Изменение баланса баллов по действию" , , КартинкаПункта);

	СлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Участие в рассылке");
	ЭДЗ.СписокВыбора.Добавить(СВД.ОтправкаРассылки	,	"Отправка рассылки" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.РассылкаНеОтправлялась,	"Рассылка подготовлена, но не отправлена" , , КартинкаПункта);
	ЭДЗ.СписокВыбора.Добавить(СВД.РассылкаНеДоставлена,	"Рассылка не доставлена" , , КартинкаПункта);
	
	Инициализация();
	
	ИмяПредопр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДействиеЗапуска, "ИмяПредопределенныхДанных");
	Если ИмяПредопр = Неопределено Тогда ИмяПредопр = ""; КонецЕсли;
	Элементы.СтраницыВариантовСобытий.ТекущаяСтраница = Элементы[ИмяПредопр + "_Страница"];
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект,ТекущийОбъект,,"КомпоновщикКлиентов",Отказ);
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если не ТекущийОбъект.ЗапускПоРасписанию и не ПустаяСтрока(РасписаниеСтрокой) Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания;
		РасписаниеСтрокой = "";
	КонецЕсли;	
		
КонецПроцедуры
#КонецОбласти

#Область Инициализация
&НаСервере
Процедура Инициализация()
	
	СВД = Справочники.ВидыДействийКлиента;
	
	//КлиентПокинулСайтИлиПриложение
	Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.СписокВыбора.Добавить(СВД.ДобавлениеПродуктаВСписок, "Добавление продукта в список");
	Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.СписокВыбора.Добавить(СВД.ПросмотрПродуктаВОперации, "Просмотр продукта в операции");
	Элементы.ДействияВСессии_КлиентПокинулСайтИлиПриложение.СписокВыбора.Добавить(СВД.ПросмотрКатегорииПродуктов, "Просмотр категории продуктов");
	Если ЗаказыВСессии_КлиентПокинулСайтИлиПриложение.Пустая() ТОгда
		ЗаказыВСессии_КлиентПокинулСайтИлиПриложение = Перечисления.ЕстьНетНеВажно.НеВажно;
	КонецЕсли;	

	//ИзменениеДанныхЗаказа
	Элементы.ПоляИзменения_ИзменениеДанныхЗаказа.СписокВыбора.Добавить("БазоваяСтоимость", "Базовая стоимость");
	Элементы.ПоляИзменения_ИзменениеДанныхЗаказа.СписокВыбора.Добавить("Город", "Город");
	Элементы.ПоляИзменения_ИзменениеДанныхЗаказа.СписокВыбора.Добавить("СпособДоставки", "Способ доставки");
	Элементы.ПоляИзменения_ИзменениеДанныхЗаказа.СписокВыбора.Добавить("СтатусЗаказа", "Статус заказа");
	Элементы.ПоляИзменения_ИзменениеДанныхЗаказа.СписокВыбора.Добавить("СтоимостьДоставки", "Стоиомость доставки");
	
	//ИзменилсяПродуктВСписке
	ЗаголовокЦен = "Цена продукта";
	ЗаголовокКоличестваИзменения = " ";
	Если Изменение_ИзменилсяПродуктВСписке  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктСнизилась") Тогда
		ЗаголовокЦен = "Цена до снижения";
		ЗаголовокКоличестваИзменения = "Снижение минимум на";
	ИначеЕсли Изменение_ИзменилсяПродуктВСписке  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктВыросла")  Тогда
		ЗаголовокЦен = "Цена до повышения";
		ЗаголовокКоличестваИзменения = "Повышение минимум на";
	КонецЕсли;	
	Элементы.ЦенаВДиапазоне_ИзменилсяПродуктВСписке.Заголовок = ЗаголовокЦен;
	Элементы.ЦенаИзмениласьНаИБолее_ИзменилсяПродуктВСписке.Заголовок = ЗаголовокКоличестваИзменения;
	Элементы.ГруппаИзменениеЦеныИзменилсяПродуктВСписке.Видимость = не ПустаяСтрока(ЗаголовокКоличестваИзменения);
	Элементы.ГруппаДиапазонЦенИзменилсяПродуктВСписке.Видимость = ЦенаВДиапазоне_ИзменилсяПродуктВСписке;
	
	//ИзменилсяПросмотренныйПродукт
	ЗаголовокКоличестваИзменения = " ";
	Если Изменение_ИзменилсяПросмотренныйПродукт  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктСнизилась") Тогда
		ЗаголовокКоличестваИзменения = "Снижение минимум на";
	ИначеЕсли Изменение_ИзменилсяПросмотренныйПродукт  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктВыросла")  Тогда
		ЗаголовокКоличестваИзменения = "Повышение минимум на";
	КонецЕсли;	
	Элементы.ЦенаИзмениласьНаИБолее_ИзменилсяПросмотренныйПродукт.Заголовок = ЗаголовокКоличестваИзменения;
	Элементы.ГруппаИзменениеЦеныИзменилсяПросмотренныйПродукт.Видимость = не ПустаяСтрока(ЗаголовокКоличестваИзменения);
	
	//фильтр по контрагенту и расписание
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоПартнерам",,КомпоновщикКлиентов);
	КомпоновкаИРасписание_ПКМП.ПолучитьРасписаниеРегламентногоЗадания(ЭтотОбъект, , , , РасписаниеСтрокой);
КонецПроцедуры

#КонецОбласти	

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ИндикацияПодсказокВводаВСписках
&НаКлиенте
Процедура ОбработкаИндикацииПодсказкиВвода(ИмяЭлемента, ПодсказкаВвода)
	Если не ЭтотОбъект[ИмяЭлемента].Количество() = 0 Тогда
		Элементы[ИмяЭлемента].ПодсказкаВвода = "";
	Иначе
		Элементы[ИмяЭлемента].ПодсказкаВвода = ПодсказкаВвода;
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура ДействияВСессии_КлиентПокинулСайтИлиПриложениеПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("ДействияВСессии_КлиентПокинулСайтИлиПриложение","Любые или никаких");
КонецПроцедуры

&НаКлиенте
Процедура ПоляИзменения_ИзменениеДанныхЗаказаПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("ПоляИзменения_ИзменениеДанныхЗаказа","Любые");
КонецПроцедуры

&НаКлиенте
Процедура СегментыНоменклатуры_ПродуктВЗаказеДоставленПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ПродуктВЗаказеДоставлен","Из любого сегмента");
КонецПроцедуры

&НаКлиенте
Процедура СегментыНоменклатуры_ПродуктВЗаказеОплаченПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ПродуктВЗаказеОплачен","Из любого сегмента");
КонецПроцедуры

&НаКлиенте
Процедура СегментыКлиентов_КлиентПопалВСегментПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("СегментыКлиентов_КлиентПопалВСегмент","В любой сегмент");
КонецПроцедуры

&НаКлиенте
Процедура СегментыКлиентов_КлиентВышелИзСегментаПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("СегментыКлиентов_КлиентВышелИзСегмента","Из любого сегмента");
КонецПроцедуры

&НаКлиенте
Процедура СегментыНоменклатуры_ИзменилсяПродуктВСпискеПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ИзменилсяПродуктВСписке","В любом");
КонецПроцедуры

&НаКлиенте
Процедура СегментыНоменклатуры_ИзменилсяПросмотренныйПродуктПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("СегментыНоменклатуры_ИзменилсяПросмотренныйПродукт","В любом");
КонецПроцедуры

&НаКлиенте
Процедура ПричиныНедоставки_РассылкаНеДоставленаПриИзменении(Элемент)
	ОбработкаИндикацииПодсказкиВвода("ПричиныНедоставки_РассылкаНеДоставлена","Любая");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СобытиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ЗначениеЗаполнено(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ЛимитСрабатыванияНаКлиентеПриИзменении(Элемент)
	УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаЗапускаПриИзменении(Элемент)
	УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПоРасписаниюПриИзменении(Элемент)
	УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЕстьЛимитСрабатыванияНаКлиентеПриИзменении(Элемент)
	 УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВидЧастотыЗапускаСценарияНаКлиентеПриИзменении(Элемент)
	 УправлениеФормойНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеЗапускаПриИзменении(Элемент)
	 УправлениеФормойНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура Изменение_ИзменилсяПродуктВСпискеПриИзменении(Элемент)
	ЗаголовокЦен = "Цена продукта";
	ЗаголовокКоличестваИзменения = " ";
	Если Изменение_ИзменилсяПродуктВСписке  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктСнизилась") Тогда
		ЗаголовокЦен = "Цена до снижения";
		ЗаголовокКоличестваИзменения = "Снижение минимум на";
	ИначеЕсли Изменение_ИзменилсяПродуктВСписке  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктВыросла")  Тогда
		ЗаголовокЦен = "Цена до повышения";
		ЗаголовокКоличестваИзменения = "Повышение минимум на";
	КонецЕсли;	
	Элементы.ЦенаВДиапазоне_ИзменилсяПродуктВСписке.Заголовок = ЗаголовокЦен;
	Элементы.ЦенаИзмениласьНаИБолее_ИзменилсяПродуктВСписке.Заголовок = ЗаголовокКоличестваИзменения;
	Элементы.ГруппаИзменениеЦеныИзменилсяПродуктВСписке.Видимость = не ПустаяСтрока(ЗаголовокКоличестваИзменения);
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВДиапазоне_ИзменилсяПродуктВСпискеПриИзменении(Элемент)
	Элементы.ГруппаДиапазонЦенИзменилсяПродуктВСписке.Видимость = ЦенаВДиапазоне_ИзменилсяПродуктВСписке;
КонецПроцедуры


&НаКлиенте
Процедура Изменение_ИзменилсяПросмотренныйПродуктПриИзменении(Элемент)
	ЗаголовокКоличестваИзменения = " ";
	Если Изменение_ИзменилсяПросмотренныйПродукт  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктСнизилась") Тогда
		ЗаголовокКоличестваИзменения = "Снижение минимум на";
	ИначеЕсли Изменение_ИзменилсяПросмотренныйПродукт  = ПредопределенноеЗначение("Перечисление.ИзмененияСостоянияПродукта.ЦенаНаПродуктВыросла")  Тогда
		ЗаголовокКоличестваИзменения = "Повышение минимум на";
	КонецЕсли;	
	Элементы.ЦенаИзмениласьНаИБолее_ИзменилсяПросмотренныйПродукт.Заголовок = ЗаголовокКоличестваИзменения;
	Элементы.ГруппаИзменениеЦеныИзменилсяПросмотренныйПродукт.Видимость = не ПустаяСтрока(ЗаголовокКоличестваИзменения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура НастроитьРасписание(Команда)
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ДиалогРасписания.Показать(Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", ЭтотОбъект, Новый Структура("ДиалогРасписания", ДиалогРасписания)));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(Расписание1, ДополнительныеПараметры) Экспорт
	
	ДиалогРасписания = ДополнительныеПараметры.ДиалогРасписания;
	
	Если Расписание1 <> Неопределено Тогда
		
		Модифицированность = Истина;
		Расписание         = ДиалогРасписания.Расписание;
		РасписаниеСтрокой  = Строка(Расписание);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтборПриИзменении(Элемент)
	Если КомпоновщикКлиентов.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		ОписаниеФильтраКлиентов = "Отбор клиентов не установлен";
	Иначе
		ОписаниеФильтраКлиентов = "Отбор клиентов установлен";
	КонецЕсли;

	Элементы.ОписаниеФильтраКлиентов.Заголовок = ОписаниеФильтраКлиентов;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УправлениеФормойНаКлиенте()
	
	//смена вида запуска 
	Если Объект.ЗапускПоРасписанию Тогда
		Элементы.СтраницыРасписания.ТекущаяСтраница = Элементы.СтраницаПоРасписанию;
	Иначе	
		Элементы.СтраницыРасписания.ТекущаяСтраница = Элементы.СтраницаПоСобытию;
	КонецЕсли;
	
	//смена события
	Если Объект.ДействиеЗапуска.Пустая() Тогда
		Элементы.СтраницыВариантовСобытий.ТекущаяСтраница = Элементы["_Страница"];
	Иначе
		Элементы.СтраницыВариантовСобытий.ТекущаяСтраница = Элементы[ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(
			Объект.ДействиеЗапуска, "ИмяПредопределенныхДанных") + "_Страница"];
	КонецЕсли;
	
	ЗапускРазВПериод = (Объект.ВидЧастотыЗапускаСценарияНаКлиенте = ПредопределенноеЗначение("Перечисление.ЧастотаЗапускаСценарияНаКлиенте.ОдинРазЗаПериод"));
	ОдинРаз = (Объект.ВидЧастотыЗапускаСценарияНаКлиенте = ПредопределенноеЗначение("Перечисление.ЧастотаЗапускаСценарияНаКлиенте.ОдинРаз"));
	
	Элементы.ГруппаПериодЗапуска.Видимость = ЗапускРазВПериод;
	Элементы.ГруппаЛимитСрабатыванияНаКлиенте.Видимость = не ОдинРаз;
	
	Элементы.ЛимитСрабатыванияНаКлиенте.Видимость = Объект.ЕстьЛимитСрабатыванияНаКлиенте;

	Элементы.ЛимитСрабатыванияНаКлиенте.Заголовок = Склонение("раз",Объект.ЛимитСрабатыванияНаКлиенте,"Винительный");
	Элементы.ЧастотаЗапуска.Заголовок = Склонение("раз",Объект.ЧастотаЗапуска,"Винительный");
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
		СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
		мс = СтрРазделить(СтрокаСклонения," ");
		Возврат мс[1];
КонецФункции

#КонецОбласти
