
&НаКлиенте
Процедура СобытиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ЗначениеЗаполнено(ВыбранноеЗначение)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Событие = "<не выбрано>";
	
	СВД = Справочники.ВидыДействийКлиента;
	ЭДЗ = Элементы.ДействиеЗапуска;
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Действия клиентов");
	ЭДЗ.СписокВыбора.Добавить(СВД.ДействиеВКампании, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПокинулСайтИлиПриложение, "Клиент покинул сайт/приложение" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.УстановкаСпискаПродуктов, "Список продуктов изменился" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ЗапрошенКодАвторизацииВОперации, "Клиент запросил код авторизации" , , БиблиотекаКартинок.Пустая);
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Заказы");
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеСтатусаЗаказа, "Статус заказа изменен" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеДанныхЗаказа, "Данные заказа изменены" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.СозданиеЗаказа, "Новый заказ" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПродуктВЗаказеОплачен, "Продукт в заказе оплачен" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПродуктВЗаказеДоставлен,	"Продукт в заказе доставлен" , , БиблиотекаКартинок.Пустая);
	
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Сегменты");
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПопалВСегмент, "Клиент попал в сегмент" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентВышелИзСегмента, "Клиент вышел из сегмента" , , БиблиотекаКартинок.Пустая);
		
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Обновление профиля клиента");
	ЭДЗ.СписокВыбора.Добавить(СВД.СтатусПодпискиИзменен,	"Статус подписки изменен" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.СозданиеКлиента,	"Новый клиент" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПодтверждениеEmail,	"Подтверждение Email" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеEmail,	"Изменение Email" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ПодтверждениеМобильногоТелефона,	"Подтверждение мобильного телефона" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеМобильногоТелефона,	"Изменение мобильного телефона" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.РедактированиеКлиента,	"Изменение данных клиента" , , БиблиотекаКартинок.Пустая);
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Изменение цены или наличия продукта");
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменилсяПродуктВСписке,	"Изменился продукт в списке" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменилсяПросмотренныйПродукт,	"Изменился просмотренный продукт" , , БиблиотекаКартинок.Пустая);
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Программа лояльности");
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентПрименилПромокод,	"Клиент применил промокод" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.КлиентуВыданПромокод,	"Клиенту выдан промокод" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.ИзменениеБалансаБалловПоДействию,	"Изменение баланса баллов по действию" , , БиблиотекаКартинок.Пустая);

	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭДЗ.СписокВыбора,"Участие в рассылке");
	ЭДЗ.СписокВыбора.Добавить(СВД.ОтправкаРассылки	,	"Отправка рассылки" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.РассылкаНеОтправлялась,	"Рассылка подготовлена, но не отправлена" , , БиблиотекаКартинок.Пустая);
	ЭДЗ.СписокВыбора.Добавить(СВД.РассылкаНеДоставлена,	"Рассылка не доставлена" , , БиблиотекаКартинок.Пустая);
КонецПроцедуры
