
&НаКлиенте
Процедура СобытиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = не ПустаяСтрока(ВыбранноеЗначение)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Событие = "<не выбрано>";
	
	Элементы.Событие.СписокВыбора.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока("Действия клиентов",Новый Шрифт(, 12, Истина, Истина)), , БиблиотекаКартинок.Группировка);
	Элементы.Событие.СписокВыбора.Добавить("ДействиеВМероприятии", "Действие в мероприятии..." , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("КлиентПокинулСайтИлиПриложение", "Клиент покинул сайт/приложение" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("УстановкаСпискаПродуктов,", "Список продуктов изменился" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ЗапрошенКодАвторизацииВОперации", "Клиент запросил код авторизации" , , БиблиотекаКартинок.Пустая);
	
	Элементы.Событие.СписокВыбора.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока("Заказы",Новый Шрифт(, 12, Истина, Истина)), , БиблиотекаКартинок.Группировка);
	Элементы.Событие.СписокВыбора.Добавить("ИзменениеСтатусаЗаказа,", "Статус заказа изменен" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ИзменениеДанныхЗаказа,", "Данные заказа изменены" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("СозданиеЗаказа,", "Новый заказ" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ПродуктВЗаказеОплачен", "Продукт в заказе оплачен" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ПродуктВЗаказеДоставлен",	"Продукт в заказе доставлен" , , БиблиотекаКартинок.Пустая);
	
	Элементы.Событие.СписокВыбора.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока("Обновление профиля клиента",Новый Шрифт(, 12, Истина, Истина)), , БиблиотекаКартинок.Группировка);
	Элементы.Событие.СписокВыбора.Добавить("СтатусПодпискиИзменен",	"Статус подписки изменен" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("СозданиеКлиента",	"Новый клиент" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ПодтверждениеEmail",	"Подтверждение Email" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ИзменениеEmail",	"Изменение Email" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ПодтверждениеМобильногоТелефона",	"Подтверждение мобильного телефона" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ИзменениеМобильногоТелефона",	"Изменение мобильного телефона" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("РедактированиеКлиента",	"Изменение данных клиента" , , БиблиотекаКартинок.Пустая);
	
	Элементы.Событие.СписокВыбора.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока("Изменение цены или наличия продукта",Новый Шрифт(, 12, Истина, Истина)), , БиблиотекаКартинок.Группировка);
	Элементы.Событие.СписокВыбора.Добавить("ИзменилсяПродуктВСписке",	"Изменился продукт в списке" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ИзменилсяПросмотренныйПродукт",	"Изменился просмотренный продукт" , , БиблиотекаКартинок.Пустая);
	
	Элементы.Событие.СписокВыбора.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока("Программа лояльности",Новый Шрифт(, 12, Истина, Истина)), , БиблиотекаКартинок.Группировка);
	Элементы.Событие.СписокВыбора.Добавить("КлиентПрименилПромокод",	"Клиент применил промокод" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("КлиентуВыданПромокод",	"Клиенту выдан промокод" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("ИзменениеБалансаБалловПоДействию",	"Изменение баланса баллов по действию" , , БиблиотекаКартинок.Пустая);

	Элементы.Событие.СписокВыбора.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока("Участие в рассылке",Новый Шрифт(, 12, Истина, Истина)), , БиблиотекаКартинок.Группировка);
	Элементы.Событие.СписокВыбора.Добавить("ОтправкаРассылки	",	"Отправка рассылки" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("РассылкаНеОтправлялась",	"Рассылка подготовлена, но не отправлена" , , БиблиотекаКартинок.Пустая);
	Элементы.Событие.СписокВыбора.Добавить("РассылкаНеДоставлена",	"Рассылка не доставлена" , , БиблиотекаКартинок.Пустая);
КонецПроцедуры
