
Функция ПолучитьСтатус(Ссылка) Экспорт
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Сценарии") Тогда
		ИмяРегистраСтатуса = "СостояниеСценариев";
	Иначе
		Возврат Неопределено;
	КонецЕсли;		
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеСценариевСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.%1.СрезПоследних(, Сценарий = &Ссылка) КАК СостояниеСценариевСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = СтрШаблон(Запрос.Текст, ИмяРегистраСтатуса);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Статус;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
 КонецФункции	