// Возвращает статус объекта из регистра сведений состояния по значению первого измерения
// и дополнительным измерениям.
//
// Параметры:
//   ЗначениеПервогоИзмерения - СправочникСсылка.Сценарии, СправочникСсылка.ПрограммыАкций - значение первого измерения регистра состояния.
//   СтруктураДопИзмерений - Структура, Неопределено - дополнительные измерения регистра состояния, где ключ - имя измерения, значение - значение измерения.
//
// Возвращаемое значение:
//   - Статус - значение статуса объекта из регистра сведений состояния.
//   - Неопределено - если тип значения первого измерения не поддерживается или запись не найдена.
Функция ПолучитьСтатус(ЗначениеПервогоИзмерения, СтруктураДопИзмерений = Неопределено) Экспорт
	
	Если ТипЗнч(ЗначениеПервогоИзмерения) = Тип("СправочникСсылка.Сценарии") Тогда
		ИмяРегистраСтатуса = "СостояниеСценариев";
	ИначеЕсли ТипЗнч(ЗначениеПервогоИзмерения) = Тип("СправочникСсылка.ПрограммыАкций") Тогда
		ИмяРегистраСтатуса = "СостояниеПрограммАкций";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяПервогоИзмерения = Метаданные.РегистрыСведений[ИмяРегистраСтатуса].Измерения.Получить(0).Имя;
			
	МассивУсловий = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр(ИмяПервогоИзмерения, ЗначениеПервогоИзмерения);
	МассивУсловий.Добавить(СтрШаблон("%1 = &%1",ИмяПервогоИзмерения));
	
	
	Если ТипЗнч(СтруктураДопИзмерений) = Тип("Структура") Тогда
		Для Каждого Измерение Из СтруктураДопИзмерений Цикл
			Запрос.УстановитьПараметр(Измерение.Ключ, Измерение.Значение);
			МассивУсловий.Добавить(СтрШаблон("%1 = &%1", Измерение.Ключ));
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеОбъекта.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.%1.СрезПоследних(, %2) КАК СостояниеОбъекта";
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ИмяРегистраСтатуса, СтрСоединить(МассивУсловий," И "));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Статус;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
 КонецФункции	