
Функция ПолучитьСтатус(СтруктураИзмерений) Экспорт
	
	Если не ТипЗнч(СтруктураИзмерений) = Тип("Структура") или не СтруктураИзмерений.Свойство("Ссылка") Тогда
		Возврат Неопределено;
	КонецЕсли;	

	МассивУсловий = Новый Массив;
	
	Запрос = Новый Запрос;
	Если ТипЗнч(СтруктураИзмерений.Ссылка) = Тип("СправочникСсылка.Сценарии") Тогда
		ИмяРегистраСтатуса = "СостояниеСценариев";
	Иначе
		Возврат Неопределено;
	КонецЕсли;		
	
	
	Для каждого Измерение из  СтруктураИзмерений Цикл
		Запрос.УстановитьПараметр(Измерение.Ключ, Измерение.Значение);
		МассивУсловий.Добавить(СтрШаблон("%1 = &%1",Измерение.Ключ));
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеОбъекта.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.%1.СрезПоследних(, %2) КАК СостояниеОбъекта";
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ИмяРегистраСтатуса, СтрСоединить(МассивУсловий," И "));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Статус;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
 КонецФункции	