
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТД.НаборПараметров = "ОтправкаРассылки" Тогда
		Если ЗначениеЗаполнено(ТД.Рассылка) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Канал: %1
								 |Рассылка: %2", ТД.Канал, ТД.Рассылка);
		Иначе
			Описание = СтрШаблон("Канал: %1
								 |Не указана рассылка", ТД.Канал);
									 
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "ДействияВКампаниях" Тогда
		ПустыеСтрокиПоИД = 	Объект.ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД,ВидДействияВКампании",
			ТД.ИД, ПредопределенноеЗначение("Справочник.ВидыДействияВКампаниях.ПустаяСсылка")));
		СтрокиПоИД = 	Объект.ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД",ТД.ИД));
		Если ПустыеСтрокиПоИД.Количество() = 0 И Не СтрокиПоИД.Количество() = 0 Тогда
			ОшибкаВПараметрах = Ложь;
			СтрокиПоИДПредставление = "";
			Для каждого СтрокаПоИД из СтрокиПоИД Цикл
				СтрокиПоИДПредставление = СтрокиПоИДПредставление + СтрокаПоИД.ВидДействияВКампании + Символы.ПС;
			КонецЦикла;	
			Описание = "Действия :
			|"+СтрокиПоИДПредставление;
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "ВызватьВебхук" Тогда
		Если ЗначениеЗаполнено(ТД.Вебхук) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Вебхук: %1", ТД.Вебхук);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "СгенерироватьКодАвторизации" Тогда
		Если ЗначениеЗаполнено(ТД.КоличествоПериодовДействияКодаАвторизации) И ЗначениеЗаполнено(
			ТД.ПериодДействияКодаАвторизации) Тогда
			ОшибкаВПараметрах = Ложь;
			ПредставлениеПериода = Элементы.ПоследовательностьДействийПериодДействияКодаАвторизации.СписокВыбора.НайтиПоЗначению(
				ТД.ПериодДействияКодаАвторизации).Представление;
			Описание = СтрШаблон("Код авторизации на %1 %2", ТД.КоличествоПериодовДействияКодаАвторизации,
				ПредставлениеПериода);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "Сегменты" Тогда
		Если ЗначениеЗаполнено(ТД.СегментПартнеров) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Сегмент: %1", ТД.СегментПартнеров);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "СпискиПродуктов" Тогда
		Если ЗначениеЗаполнено(ТД.СписокПродуктов) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Список продуктов: %1", ТД.СписокПродуктов);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "Промокоды" Тогда
		Если ЗначениеЗаполнено(ТД.НаборПромокодов) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Набор промокодов: %1", ТД.НаборПромокодов);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "Лояльность" Тогда
		Если ЗначениеЗаполнено(ТД.БалльныйСчет) И ЗначениеЗаполнено(ТД.СпособИзмененияКоличестваБаллов) Тогда
			Если ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение(
				"Перечисление.СпособыИзмененияКоличества.Увеличить") И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				Если ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ВТечение") и 
						НЕ ТД.КоличествоПериодовДействияНачисленныхБаллов = 0 и
						ЗначениеЗаполнено(ТД.ПериодДействияНачисленныхБаллов) Тогда
							ОшибкаВПараметрах = Ложь;
							ПредставлениеПериода = Элементы.ПоследовательностьДействийПериодДействияНачисленныхБаллов.СписокВыбора.НайтиПоЗначению(
																																					ТД.ПериодДействияНачисленныхБаллов).Представление;
							Описание = СтрШаблон("Увеличить на %1 в течение %2 %3",ТД.КоличествоИзмененияБаллов,ТД.КоличествоПериодовДействияНачисленныхБаллов,ПредставлениеПериода);
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.Бессрочно") Тогда
							ОшибкаВПараметрах = Ложь;
							Описание = СтрШаблон("Увеличить на %1 без ограничения срока действия", ТД.КоличествоИзмененияБаллов);
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ДоДаты") и
							ЗначениеЗаполнено(ТД.ДатаСрокаНачисленияБаллов)	Тогда 
							ОшибкаВПараметрах = Ложь;	
							Описание = СтрШаблон("Увеличить на %1 до %2", ТД.КоличествоИзмененияБаллов ,Формат(ТД.ДатаСрокаНачисленияБаллов,"ДФ='dd.MM.yyyy HH.mm';"));
				КонецЕсли;				
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Обнулить") Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = "Обнулить счет";
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Уменьшить") 
			 			И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = СтрШаблон("Уменьшить счет на %1", ТД.КоличествоИзмененияБаллов);
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Установить") 
			 			И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = СтрШаблон("Установить счет в %1", ТД.КоличествоИзмененияБаллов);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
