
Процедура ПередЗаписью(Отказ)

	Ошибки = Неопределено;
	Для Каждого ТД Из ПоследовательностьДействий Цикл
		
		Если ТД.НаборПараметров = "ОтправкаРассылки" Тогда
			Если не ЗначениеЗаполнено(ТД.Рассылка) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указана рассылка");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "ДействияВКампаниях" Тогда
			ПустыеСтрокиПоИД = 	ФильтрПоДействиямВКампаниях.НайтиСтроки(
				Новый Структура("ИД,ВидДействияВКампании", ТД.ИД, ПредопределенноеЗначение(
				"Справочник.ВидыДействияВКампаниях.ПустаяСсылка")));
			СтрокиПоИД = 	ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД", ТД.ИД));
			Если СтрокиПоИД.Количество() = 0 или не ПустыеСтрокиПоИД.Количество() = 0 Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указаны действия");
			КонецЕсли;	
		ИначеЕсли ТД.НаборПараметров = "ВызватьВебхук" Тогда
			Если не ЗначениеЗаполнено(ТД.Вебхук) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан вебхук");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "СгенерироватьКодАвторизации" Тогда
			Если Не ЗначениеЗаполнено(ТД.КоличествоПериодовДействияКодаАвторизации) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указано время действия кода авторизации");
			КонецЕсли;
			Если ЗначениеЗаполнено(ТД.ПериодДействияКодаАвторизации) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан период действия кода авторизации");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "Сегменты" Тогда
			Если не ЗначениеЗаполнено(ТД.СегментПартнеров) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан сегмент");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "СпискиПродуктов" Тогда
			Если не ЗначениеЗаполнено(ТД.СписокПродуктов) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан список продуктов");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "Промокоды" Тогда
			Если не ЗначениеЗаполнено(ТД.НаборПромокодов) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан набор промокодов");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "Лояльность" Тогда
			Если ЗначениеЗаполнено(ТД.БалльныйСчет) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан балльный счет");
			КонецЕсли;	
			Если ЗначениеЗаполнено(ТД.СпособИзмененияКоличестваБаллов) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан способ изменения количества баллов");
			КонецЕсли;
				
			Если ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение(
				"Перечисление.СпособыИзмененияКоличества.Увеличить") И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				Если ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение(
						"Перечисление.ВидыСроковНачисленияБаллов.ВТечение")
					И Не ТД.КоличествоПериодовДействияНачисленныхБаллов = 0 И ЗначениеЗаполнено(
						ТД.ПериодДействияНачисленныхБаллов) Тогда
					ОшибкаВПараметрах = Ложь;
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение(
						"Перечисление.ВидыСроковНачисленияБаллов.Бессрочно") Тогда
					ОшибкаВПараметрах = Ложь;
					Описание = СтрШаблон("Увеличить на %1 без ограничения срока действия", ТД.КоличествоИзмененияБаллов);
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение(
						"Перечисление.ВидыСроковНачисленияБаллов.ДоДаты") И ЗначениеЗаполнено(
						ТД.ДатаСрокаНачисленияБаллов) Тогда
					ОшибкаВПараметрах = Ложь;
					Описание = СтрШаблон("Увеличить на %1 до %2", ТД.КоличествоИзмененияБаллов, Формат(
							ТД.ДатаСрокаНачисленияБаллов, "ДФ='dd.MM.yyyy HH.mm';"));
				КонецЕсли;
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение(
					"Перечисление.СпособыИзмененияКоличества.Обнулить") Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = "Обнулить счет";
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение(
					"Перечисление.СпособыИзмененияКоличества.Уменьшить") И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = СтрШаблон("Уменьшить счет на %1", ТД.КоличествоИзмененияБаллов);
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение(
					"Перечисление.СпособыИзмененияКоличества.Установить") И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = СтрШаблон("Установить счет в %1", ТД.КоличествоИзмененияБаллов);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);
	
КонецПроцедуры

Процедура ДобавитьОшибкуВГруппу(Ошибки, Данные, ТекстОшибки)
	ПолеОписание = "Объект.ПоследовательностьДействий[%1].Описание";
	Индекс = Данные.НомерСтроки-1;
	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОписание , "", Данные.НаборПараметров ,Индекс, ТекстОшибки);
КонецПроцедуры	
	