
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	Для Каждого ТД Из ПоследовательностьДействий Цикл
		
		Если ТД.НаборПараметров = "ОтправкаРассылки" Тогда
			Если не ЗначениеЗаполнено(ТД.Рассылка) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указана рассылка");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "ДействияВКампаниях" Тогда
			ПустыеСтрокиПоИД = 	ФильтрПоДействиямВКампаниях.НайтиСтроки(
				Новый Структура("ИД,ВидДействияВКампании", ТД.ИД, ПредопределенноеЗначение(
				"Справочник.ВидыДействияВКампаниях.ПустаяСсылка")));
			СтрокиПоИД = 	ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД", ТД.ИД));
			Если СтрокиПоИД.Количество() = 0 или не ПустыеСтрокиПоИД.Количество() = 0 Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указаны действия");
			КонецЕсли;	
		ИначеЕсли ТД.НаборПараметров = "ВызватьВебхук" Тогда
			Если не ЗначениеЗаполнено(ТД.Вебхук) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан вебхук");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "СгенерироватьКодАвторизации" Тогда
			Если Не ЗначениеЗаполнено(ТД.КоличествоПериодовДействияКодаАвторизации) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указано время действия кода авторизации");
			КонецЕсли;
			Если не ЗначениеЗаполнено(ТД.ПериодДействияКодаАвторизации) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан период действия кода авторизации");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "Сегменты" Тогда
			Если не ЗначениеЗаполнено(ТД.СегментПартнеров) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан сегмент");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "СпискиПродуктов" Тогда
			Если не ЗначениеЗаполнено(ТД.СписокПродуктов) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан список продуктов");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "Промокоды" Тогда
			Если не ЗначениеЗаполнено(ТД.НаборПромокодов) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан набор промокодов");
			КонецЕсли;
		ИначеЕсли ТД.НаборПараметров = "Лояльность" Тогда
			Если не ЗначениеЗаполнено(ТД.БалльныйСчет) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан балльный счет");
			КонецЕсли;	
			Если не ЗначениеЗаполнено(ТД.СпособИзмененияКоличестваБаллов) Тогда
				ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан способ изменения количества баллов");
				
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Увеличить") Тогда 
				Если ТД.КоличествоИзмененияБаллов = 0 Тогда
					ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указано количество баллов");
				КонецЕсли;	
				Если не ЗначениеЗаполнено(ТД.ВидСрокаНачисленияБаллов) Тогда
					ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан вид срока увеличения баллов");
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ВТечение") Тогда
					Если ТД.КоличествоПериодовДействияНачисленныхБаллов = 0 Тогда
						ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указано количество периодов увеличения баллов");
					КонецЕсли;
					Если не ЗначениеЗаполнено(ТД.ПериодДействияНачисленныхБаллов) Тогда
						ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указан период срока увеличения баллов");
					КонецЕсли;	
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ДоДаты") Тогда 
					Если не ЗначениеЗаполнено(ТД.ДатаСрокаНачисленияБаллов) Тогда
						ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указана дата окончания действия баллов");
					КонецЕсли;	
				КонецЕсли;
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Уменьшить") Тогда
					Если ТД.КоличествоИзмененияБаллов = 0 Тогда
						ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указано количество баллов");
					КонецЕсли;
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Установить") Тогда
					Если ТД.КоличествоИзмененияБаллов = 0 Тогда
						ДобавитьОшибкуВГруппу(Ошибки, ТД ,"В строке %1 не указано количество баллов");
					КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	
КонецПроцедуры

Процедура ДобавитьОшибкуВГруппу(Ошибки, Данные, ТекстОшибки)
	ПолеОписание = "Объект.ПоследовательностьДействий[%1].Описание";
	Индекс = Данные.НомерСтроки-1;
	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОписание , СтрЗаменить(ТекстОшибки,"%1",""), "ПроверкаТаблицыДействий" ,Индекс, ТекстОшибки);
КонецПроцедуры	
	