#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	КомпоновкаИРасписание_ПКМП.ОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметровЗадания = Неопределено;
	Если ЗапускПоРасписанию Тогда
		СтруктураПараметровЗадания = КомпоновкаИРасписание_ПКМП.СтруктураПараметровЗадания();
		СтруктураПараметровЗадания.ВидРегламентногоЗадания = "СтартСценарияПоРасписанию";
		СтруктураПараметровЗадания.НаименованиеЗадания = "Старт сценария " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Владелец, "Наименование");
	КонецЕсли;
	КомпоновкаИРасписание_ПКМП.ОбъектПередЗаписью(ЭтотОбъект, СтруктураПараметровЗадания, Отказ);

	Если не ЗапускПоРасписанию и ЗначениеЗаполнено(РегламентноеЗаданиеGUID) Тогда
		КомпоновкаИРасписание_ПКМП.ОбъектПередУдалением(ЭтотОбъект);
	КонецЕсли;	
		
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновкаИРасписание_ПКМП.ОбъектПередУдалением(ЭтотОбъект, ,Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновкаИРасписание_ПКМП.ОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КомпоновкаИРасписание_ПКМП.ОбъектПриКопировании(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗапускПоРасписанию Тогда 
		//ПроверяемыеРеквизиты.Добавить("РегламентноеЗаданиеGUID");
		ПроверяемыеРеквизиты.Добавить("НаборыПромокодовПриРасписании.НаборПромокодов");
		ПроверяемыеРеквизиты.Добавить("НаличиеПродуктовВСегментеПриРасписании.Сегмент");
		ПроверяемыеРеквизиты.Добавить("НаличиеПродуктовВСегментеПриРасписании.КоличествоОт");
		ПроверяемыеРеквизиты.Добавить("НаличиеПродуктовВСегментеПриРасписании.КоличествоДо");
	Иначе
		ПроверяемыеРеквизиты.Добавить("ДействиеЗапуска");
		Если не ВидЧастотыЗапускаСценарияНаКлиенте = Перечисления.ЧастотаЗапускаСценарияНаКлиенте.ОдинРаз и ЕстьЛимитСрабатыванияНаКлиенте Тогда
			ПроверяемыеРеквизиты.Добавить("ЛимитСрабатыванияНаКлиенте");
		КонецЕсли;	
		Если ВидЧастотыЗапускаСценарияНаКлиенте = Перечисления.ЧастотаЗапускаСценарияНаКлиенте.ОдинРазЗаПериод Тогда
			ПроверяемыеРеквизиты.Добавить("ПериодЗапускаСценарияНаКлиенте");
			ПроверяемыеРеквизиты.Добавить("ЧастотаЗапуска");
		КонецЕсли;	
	КонецЕсли;		
	
	
КонецПроцедуры

#КонецЕсли