#Область СозданиеЭлементов

// Функци добавления поля ввода.
// 
// Параметры - 
// Имя.
// Путь к данным.
// Родитель.
// Элемент, перед которым создавать.
Функция НовоеПолеВвода(Форма, Знач НаименованиеЭлемента, Знач ПутьКДанным, Знач Родитель = Неопределено, Знач ЭлементПеред = Неопределено, Знач КнопкаОчистки = Ложь) Экспорт 
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		
		// Повторное создание элемента.
		Возврат Неопределено;		
	КонецЕсли;	
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред);
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
	Элемент.Вид 			= ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным 	= ПутьКДанным;
	Элемент.КнопкаОчистки 	= КнопкаОчистки;
	
	Возврат Элемент;             

КонецФункции

// Функци добавления поля ввода.
// 
// Параметры - 
// Имя.
// Путь к данным.
// Родитель.
// Элемент, перед которым создавать.
Функция НовоеПолеПереключателя(Форма, Знач НаименованиеЭлемента, Знач ПутьКДанным, Знач Родитель = Неопределено, Знач ЭлементПеред = Неопределено, Знач КнопкаОчистки = Ложь) Экспорт 
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		
		// Повторное создание элемента.
		Возврат Неопределено;		
	КонецЕсли;	
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред);
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
	Элемент.Вид 			= ВидПоляФормы.ПолеПереключателя;
	Элемент.ПутьКДанным 	= ПутьКДанным;
	
	Возврат Элемент;             

КонецФункции

// Процедура добавления поля ввода.
// 
// Параметры - 
// Имя.
// Путь к данным.
// Родитель.
// Элемент, перед которым создавать.
Функция НовоеПолеНадписи(Форма, Знач НаименованиеЭлемента, Знач ПутьКДанным, Знач Родитель = Неопределено, Знач ЭлементПеред = Неопределено) Экспорт
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		
		// Повторное создание элемента
		Возврат Неопределено;		
	КонецЕсли;
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред);
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
	Элемент.Вид 		= ВидПоляФормы.ПолеНадписи;
	Элемент.ПутьКДанным = ПутьКДанным;
	
	Возврат Элемент;

КонецФункции

// Процедура добавления поля ввода.
// 
// Параметры - 
// Имя.
// Путь к данным.
// Родитель.
// Элемент, перед которым создавать.
Функция НовоеПолеФлажка(Форма, Знач НаименованиеЭлемента, Знач ПутьКДанным, Знач Родитель = Неопределено, Знач ЭлементПеред = Неопределено) Экспорт
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		
		// Повторное создание элемента.
		Возврат Неопределено;		
	КонецЕсли;
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред);
	
	// Создадим элемент.
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
	Элемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	Элемент.ПутьКДанным 		= ПутьКДанным;
	Элемент.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Возврат Элемент;             

КонецФункции

// Процедура добавления группы формы.
// 
// Параметры - 
// Имя.
// Заголовок.
// ВидГруппы.  
// Родитель.
// Элемент, перед которым создавать.
Функция НоваяГруппа(Форма, Знач НаименованиеЭлемента, Знач Заголовок, Знач ВидГруппы = Неопределено, Знач  Родитель = Неопределено, Знач ЭлементПеред = Неопределено) Экспорт
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		
		// Повторное создание элемента.
		Возврат Неопределено;		
	КонецЕсли;
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред);
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ГруппаФормы"), Родитель, ЭлементПеред);
	
	Если ВидГруппы = Неопределено Тогда
		Элемент.Вид 	  = ВидГруппыФормы.ОбычнаяГруппа;
	Иначе			
		Элемент.Вид 	  = ВидГруппы;
	КонецЕсли;	
	
	Если ПустаяСтрока(Заголовок) и Элемент.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
		Элемент.ОтображатьЗаголовок = Ложь;
	Иначе
		Элемент.Заголовок = Заголовок;
	КонецЕсли;		
	
	Возврат Элемент;

КонецФункции

// Процедура добавления группы формы.
// 
// Параметры - 
// Имя.
// Заголовок.
// НаименованиеСтраниц - Структура с названиями страниц, где ключ - это имя, а значение - заголовок. 
Функция НоваяГруппаСтраницы(Форма, Знач НаименованиеЭлемента, Знач Заголовок, Знач НаименованиеСтраниц, Знач Родитель = Неопределено, Знач ЭлементПеред = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		
		// Повторное создание элемента.
		Возврат Неопределено;		
	КонецЕсли;
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред);
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ГруппаФормы"), Родитель, ЭлементПеред);
	Элемент.Вид = ВидГруппыФормы.Страницы;	
	
	Элемент.Заголовок = Заголовок;
			
	Для Каждого ЭлементСтруктуры Из НаименованиеСтраниц Цикл
		Заголовок = ?(ЭлементСтруктуры.Значение.Свойство("Заголовок"), ЭлементСтруктуры.Значение.Заголовок, ""); 
		Группа = НоваяГруппа(Форма, ЭлементСтруктуры.Ключ, Заголовок , ВидГруппыФормы.Страница, НаименованиеЭлемента);
		Для Каждого ЗначениеСвойства Из ЭлементСтруктуры.Значение Цикл
			Группа[ЗначениеСвойства.Ключ] = ЗначениеСвойства.Значение;
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Элемент;

КонецФункции	

// Процедура добавления команды формы.
//
Функция НоваяКомандаФормы(Форма, Знач НаименованиеЭлемента, Знач Заголовок, Знач Отображение, Знач Действие, Знач ИзменяетСохраняемыеДанные = Истина) Экспорт
	
	Команды = Форма.Команды;
	
	НоваяКомандаФормы = Команды.Добавить(НаименованиеЭлемента);
	НоваяКомандаФормы.Заголовок 				= Заголовок;
	НоваяКомандаФормы.ИзменяетСохраняемыеДанные = ИзменяетСохраняемыеДанные;
	НоваяКомандаФормы.Отображение 				= Отображение;	
	НоваяКомандаФормы.Действие 					= Действие;	
	
	Возврат НоваяКомандаФормы
	
КонецФункции	

// Процедура добавления новой кпопки формы.
//
Функция НоваяКнопкаФормы(Форма, НаименованиеЭлемента, Знач ВидКнопки, Знач ИмяКоманды, Знач Родитель = Неопределено, Знач ЭлементПеред = Неопределено, Знач ИспользоватьКоманднуюПанель = Ложь) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред, ИспользоватьКоманднуюПанель);
		
	НоваяКнопкаФормы = Элементы.Вставить(НаименованиеЭлемента, Тип("КнопкаФормы"), Родитель, ЭлементПеред);
	НоваяКнопкаФормы.Вид = ВидКнопки;
	НоваяКнопкаФормы.ИмяКоманды = ИмяКоманды;
	
	Возврат НоваяКнопкаФормы
	
КонецФункции	

// Процедура добавления новой колонки Табличной части.
//
Функция НоваяКолонкаТаблицыФормы(Форма, Элемент, Имя, Заголовок, ПутьКДанным) Экспорт
	
	Элементы = Форма.Элементы;
	
	КолонкаСтоимость = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элемент);
	КолонкаСтоимость.ПутьКДанным		 				= ПутьКДанным;
	КолонкаСтоимость.Заголовок							= Заголовок;
	КолонкаСтоимость.Вид				 				= ВидПоляФормы.ПолеВвода;
	
	Возврат КолонкаСтоимость;
КонецФункции

// Процедула добавления поля ввода.
// 
// Параметры - 
// Имя.
// Путь к данным.
// Родитель.
// Элемент, перед которым создавать.
Функция НоваяТаблицаФормы(Форма, НаименованиеЭлемента, ПутьКДанным, Родитель = Неопределено, ЭлементПеред = Неопределено) Экспорт
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		
		// Повторное создание элемента
		Возврат Неопределено;		
	КонецЕсли;
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред); 
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ТаблицаФормы"), Родитель, ЭлементПеред);	
	Элемент.ПутьКДанным = ПутьКДанным;
	
	Возврат Элемент;

КонецФункции

// Процедура добавления декорации формы.
//
Функция НоваяДекорацияФормы(Форма, НаименованиеЭлемента, Заголовок = "", Родитель = Неопределено, ЭлементПеред = Неопределено) Экспорт 
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		Возврат Неопределено
	КонецЕсли;	
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред); 
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ДекорацияФормы"), Родитель, ЭлементПеред);
	Элемент.Вид 	  = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = Заголовок;
	
	Возврат Элемент;

КонецФункции

// Процедура добавления декорации формы.
//
Функция НоваяДекорацияКартинка(Форма, НаименованиеЭлемента, Картинка = Неопределено, Родитель = Неопределено, ЭлементПеред = Неопределено) Экспорт 
							
	Элементы = Форма.Элементы;						
	
	Если Элементы.Найти(НаименованиеЭлемента) <> Неопределено Тогда
		Возврат Неопределено
	КонецЕсли;	
	
	ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред); 
	
	// Создадим элемент
	Элемент = Элементы.Вставить(НаименованиеЭлемента, Тип("ДекорацияФормы"), Родитель, ЭлементПеред);	
	Элемент.Вид 	  = ВидДекорацииФормы.Картинка;
	Если Картинка <> Неопределено Тогда
		Элемент.Картинка = Картинка;
	КонецЕсли;	
	Элемент.Заголовок = "";
	
	Возврат Элемент;

КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИницилизоватьРодительЭлементПеред(Форма, НаименованиеЭлемента, Родитель, ЭлементПеред, ИспользоватьКоманднуюПанель = Неопределено)
	
	Элементы = Форма.Элементы;
	
	// Установка родителя
	Если Родитель <> Неопределено Тогда
		
		Если ТипЗнч(Родитель) = Тип("Строка") тогда
			ИмяЭлемента = Родитель;
			Родитель = Элементы.Найти(ИмяЭлемента);			
			Если Родитель = Неопределено Тогда
				ВызватьИсключение "Ошибка поиска родителя "+Родитель+" для элемента "+НаименованиеЭлемента;
			КонецЕсли;	
		КонецЕсли;
		
		Если ИспользоватьКоманднуюПанель <> Неопределено Тогда
			Если Родитель <> Неопределено И ИспользоватьКоманднуюПанель Тогда
				Родитель = Родитель.КоманднаяПанель;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;	
	
	// Проверим существует ли элемент ЭлементПеред.
	Если ЭлементПеред <> Неопределено Тогда
		ИмяЭлемента = ЭлементПеред;
		ЭлементПеред = Элементы.Найти(ИмяЭлемента);
		Если ЭлементПеред = Неопределено Тогда
				ВызватьИсключение "Ошибка поиска предыдущего элемента "+ЭлементПеред+" для элемента "+НаименованиеЭлемента;
		ИначеЕсли Родитель = Неопределено Тогда
			Родитель = ЭлементПеред.Родитель;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#Область ГруппаДеньНеделиВремя

// Размещает на форме элементы выбора дней недели и временного диапазона срабатывания.У Объекта формы должны быть
// реквизиты - НеОграничиватьВремяСрабатывания,ВремяС,ВремяПо,ЧасовойПояс
//
// Параметры:
//   Форма - УправляемаяФорма - форма, на которой размещаются элементы
//   ГруппаРазмещения - Строка - имя группы формы, в которую добавляются элементы
//   ЭлементПеред - ЭлементФормы, Неопределено - элемент формы, перед которым вставляются новые элементы.
//                              Если Неопределено, элементы добавляются в конец группы
Процедура ДеньНеделиВремяПриСозданииФормы(Форма, ГруппаРазмещения = "ГруппаДеньНеделиВремя", ЭлементПеред = Неопределено) Экспорт
	
	НеОграничиватьВремяСрабатывания = НовоеПолеФлажка(Форма, "НеОграничиватьВремяСрабатывания", "Объект.НеОграничиватьВремяСрабатывания", ГруппаРазмещения, ЭлементПеред);
	НеОграничиватьВремяСрабатывания.УстановитьДействие("ПриИзменении","Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении");
	
	ГруппаВремя = НоваяГруппа(Форма, "ГруппаВремя", "",, ГруппаРазмещения, ЭлементПеред);	
	ГруппаВремя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НоваяДекорацияФормы(Форма, "ДекорацияВремя", "Сработать с ", ГруппаВремя);
	ПолеВремя = НовоеПолеВвода(Форма, "ВремяС", "Объект.ВремяС", ГруппаВремя);
	ПолеВремя.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	УстановитьСписокВыбораДляПоляВводаВремени(ПолеВремя);
	
	НоваяДекорацияФормы(Форма, "ДекорацияДо", " - ", ГруппаВремя);
	ПолеВремя = НовоеПолеВвода(Форма, "ВремяПо", "Объект.ВремяПо", ГруппаВремя);
	ПолеВремя.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	УстановитьСписокВыбораДляПоляВводаВремени(ПолеВремя);
	
	ЧасовойПояс = НовоеПолеВвода(Форма, "ЧасовойПояс", "Объект.ЧасовойПояс", ГруппаВремя);
	ЧасовойПояс.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	
	НоваяКомандаФормы(Форма, "КомандаВыбратьВремя", "Выбрать время", ОтображениеКнопки.КартинкаИТекст, "Подключаемая_ВыбратьДеньНедели");
	
	ГруппаДеньНедели = НоваяГруппа(Форма, "ГруппаДеньНедели", "",, ГруппаРазмещения);	
	ГруппаДеньНедели.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	БазоваяДата = '00010101';
	
	Для ДеньНедели = 1 по 7 Цикл
		КнопкаДень = НоваяКнопкаФормы(Форма, "ДеньНедели" + ДеньНедели, ВидКнопкиФормы.ОбычнаяКнопка,  "КомандаВыбратьВремя", ГруппаДеньНедели);
		КнопкаДень.Заголовок = ТРег(Формат(БазоваяДата+(ДеньНедели+1) * 86400,"ДФ=ddd;"));
		КнопкаДень.Фигура = ФигураКнопки.Овал;
	КонецЦикла;	
	
КонецПроцедуры	

// Заполняет список выбора поля формы значениями времени с шагом 15 минут
// и настраивает режим выбора из списка.
//
// Параметры:
//   Элемент - ПолеФормы - поле формы, для которого заполняется список выбора времени
Процедура УстановитьСписокВыбораДляПоляВводаВремени(Элемент) Экспорт
	
	Для Час = 0 По 23 Цикл
		Для Минута = 0 По 3 Цикл
			Время = Дата(1, 1, 1, Час, Минута*15, 0);
			ВремяСтрока = Формат(Время, "ДФ=ЧЧ:мм; ДП=00:00;");
			Элемент.СписокВыбора.Добавить(Время, ВремяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Элемент.РежимВыбораИзСписка = Истина;
	Элемент.КнопкаВыпадающегоСписка = Истина;
	Элемент.Формат = "ДФ=HH:mm";
	Элемент.ФорматРедактирования = "ДФ=HH:mm";
КонецПроцедуры	
#КонецОбласти 



Процедура СписокВыбораИзРеквизитовПоТипу(Элемент, ТипРеквизита) Экспорт
	
КонецПроцедуры	

Процедура ДобавитьСтрокуГруппыСписка(Список, НазваниеГруппы) Экспорт
	Список.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока(НазваниеГруппы, Новый Шрифт(, 11, Истина, Истина)), , БиблиотекаКартинок.Группировка);
КонецПроцедуры
