&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийШаблон = "";
	
	Если Параметры.Свойство("Описание") Тогда
		Элементы.тПодсказка.Заголовок = Параметры.Описание;
	КОнецЕсли;	
	
	ЗаголовокОбязательных = "";
	ЗаголовокНеОбязательных = "";
	Если Параметры.Свойство("ТабличныйДокумент") Тогда
		ДокументДляЗагрузки =  Параметры.ТабличныйДокумент; 
	КонецЕсли;	
	СчКолонок = 0;
	Если Параметры.Свойство("СписокКолонок") Тогда 
		СписокКолонок = Параметры.СписокКолонок;
		Для каждого ЭлСписка из  СписокКолонок Цикл 
			СчКолонок = СчКолонок+1;
			ОбластьШапкиКолонки = ДокументДляЗагрузки.Область(1,СчКолонок,1,СчКолонок);
			ОбластьШапкиКолонки.Текст =  ЭлСписка.Значение;
			Если ЭлСписка.Пометка Тогда  
				ОбластьШапкиКолонки.ЦветТекста = WEBЦвета.Красный;
				ОбластьШапкиКолонки.Шрифт = Новый Шрифт(,,Истина); 
				ЗаголовокОбязательных = ЗаголовокОбязательных+""""+ЭлСписка.Значение+""""+ОбщегоНазначенияПКМПКлиентСервер.ВыводЕслиЗаполнено("(",ЭлСписка.Представление,")")+","; 
			Иначе	
				ЗаголовокНеОбязательных = ЗаголовокНеОбязательных+""""+ЭлСписка.Значение+""""+ОбщегоНазначенияПКМПКлиентСервер.ВыводЕслиЗаполнено("(",ЭлСписка.Представление,")")+",";
			КонецЕсли;
			УправлениеФормамиПКМП.НоваяКомандаФормы(этотОбъект,"ДействиеВставки"+СтрЗаменить(СчКолонок,Символы.НПП,""),"",ОтображениеКнопки.КартинкаИТекст,"ДействиеВставки");
			КнопкаШаблон = УправлениеФормамиПКМП.НоваяКнопкаФормы(этотОбъект,"КнопкаШаблон"+СтрЗаменить(СчКолонок,Символы.НПП,""), ВидКнопкиФормы.КнопкаКоманднойПанели, "ДействиеВставки"+СтрЗаменить(СчКолонок,Символы.НПП,""),"КнопкиШаблона");
			КнопкаШаблон.Заголовок = ЭлСписка.Значение;  
			КнопкаШаблон.Фигура = ФигураКнопки.Овал;
		КонецЦикла;	  
		УправлениеФормамиПКМП.НоваяКомандаФормы(этотОбъект,"ДействиеВставкиОчистить","",ОтображениеКнопки.КартинкаИТекст,"ДействиеВставки");
		КнопкаШаблон = УправлениеФормамиПКМП.НоваяКнопкаФормы(этотОбъект,"КнопкаШаблонОчистить", ВидКнопкиФормы.КнопкаКоманднойПанели, "ДействиеВставкиОчистить","КнопкиШаблона");
		КнопкаШаблон.Заголовок = "Очистить";
		КнопкаШаблон.Картинка = БиблиотекаКартинок.Очистить;  
		
		
		Элементы.тПодсказкаОбязательные.Заголовок = ?(ПустаяСтрока(ЗаголовокОбязательных),"Нет обязательных полей загрузки",
																		Лев(ЗаголовокОбязательных,СтрДлина(ЗаголовокОбязательных)-1)+" - должны быть указаны обязательно");
		Элементы.тПодсказкаПоЖеланию.Заголовок = ?(ПустаяСтрока(ЗаголовокНеОбязательных),"Нет произвольных полей загрузки",
																		Лев(ЗаголовокНеОбязательных,СтрДлина(ЗаголовокНеОбязательных)-1)+" - указывается по желанию");
	КонецЕсли;
	
	ДокументДляЗагрузки.Область(1,,1).ЦветФона = WebЦвета.БледноЗолотистый;
	
КонецПроцедуры

&НаКлиенте
Процедура кмдОбработать(Команда)
	Закрыть(ДокументДляЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура кмдПрочитатьИзФайла(Команда)
	ДС = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Открытие);
	ДС.МножественныйВыбор = Ложь;
	ДС.Фильтр = "Документ Excel(*.xls,*.xlsx)|*.xls*|Документ OpenOffice Calc(*.ods)|*.ods|Все файлы(*.*)|*.*|";
	ДС.ИндексФильтра = 0;
	ОповещениеОВыборе = Новый ОписаниеОповещения("ЗавершениеВыбораФайла",ЭтаФорма);
	ДС.Показать(ОповещениеОВыборе);
КонецПроцедуры

&НаКлиенте
Процедура  ЗавершениеВыбораФайла(ВыбранныеФайлы, ДопПар)  Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
	ВыбраныйФайл = СокрЛП(ВыбранныеФайлы[0]);
	
	ОповещениеОЗавершенииПомещения = Новый ОписаниеОповещения("ЗавершениеПомещенияФайла",ЭтаФорма);

	НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершенииПомещения,,,,ВыбраныйФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура  ЗавершениеПомещенияФайла(ОписаниеФайла, ДопПар)  Экспорт
	Если ОписаниеФайла = Неопределено Тогда Возврат; КонецЕсли;
	ДокументЗагрузки_Прочитать(ОписаниеФайла.Адрес,ОписаниеФайла.СсылкаНаФайл.Файл.Расширение);
КонецПроцедуры

&НаСервере
Процедура ДокументЗагрузки_Прочитать(АдресВременногоХранилища,Расширение) 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ДокументДляЗагрузки.Прочитать(ИмяВременногоФайла);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;	
	
КонецПроцедуры


&НаКлиенте
Процедура ДействиеВставки(Команда) 
	
	КодШаблона = СтрЗаменить(Команда.Имя,"ДействиеВставки","");
	ТекущаяКнопка = этотОбъект.Элементы["КнопкаШаблон"+КодШаблона];
	Если КодШаблона="Очистить" Тогда  
		ТекущийШаблон = "";
		ТекущийШрифт = Новый Шрифт(,,Ложь);
	Иначе 
		ТекущийШаблон = ТекущаяКнопка.Заголовок;	
		ТекущийШрифт = Новый Шрифт(,,Истина);
		//ТекущаяКнопка.Пометка = Истина;
	КонецЕсли;	
	
	Если не Элементы.ДокументДляЗагрузки.ТекущаяОбласть.ТипОбласти   = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда Возврат; КонецЕсли;
	Элементы.ДокументДляЗагрузки.ТекущаяОбласть.Текст = ТекущийШаблон;  
	Элементы.ДокументДляЗагрузки.ТекущаяОбласть.Шрифт = ТекущийШрифт;
	
КонецПроцедуры	

