
&НаКлиенте
Процедура ВидТочкиУсловияПриИзменении(Элемент)
	Элементы.СтраницыВидТочки.ТекущаяСтраница = Элементы[ИмяЗначенияПеречисления(Объект.ВидТочкиУсловия)+"_Страница"];
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидТочкиУсловияПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФильтрКлиентов(Команда)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления)
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления);
КонецФункции
