#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоПартнерам",,КомпоновщикКлиентов);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект,ТекущийОбъект,,"КомпоновщикКлиентов",Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидТочкиУсловияПриИзменении(Неопределено);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкиОтборПриИзменении(Элемент)
	Если КомпоновщикКлиентов.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		ОписаниеФильтраКлиентов = "Отбор клиентов не установлен";
	Иначе
		ОписаниеФильтраКлиентов = "Отбор клиентов установлен";
	КонецЕсли;

	Элементы.ОписаниеФильтраКлиентов.Заголовок = ОписаниеФильтраКлиентов;
КонецПроцедуры

&НаКлиенте
Процедура ВидТочкиУсловияПриИзменении(Элемент)
	Элементы.СтраницыВидТочки.ТекущаяСтраница = Элементы[ИмяЗначенияПеречисления(Объект.ВидТочкиУсловия)+"_Страница"];
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ИмяЗначенияПеречисления(ЗначениеПеречисления)
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления);
КонецФункции
#КонецОбласти
