
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	МассивЭлементовОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.Отбор, ,"СлужебныйОтборПоТипуАкции");
	ПараметрыОткрытия = Новый Структура;
	Если не МассивЭлементовОтбора.Количество() = 0 Тогда
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",Новый Структура("ТипАкции",МассивЭлементовОтбора[0].ПравоеЗначение));
	КонецЕсли;
	ОткрытьФорму("Справочник.ПрограммыАкций.Форма.ФормаЭлемента", ПараметрыОткрытия)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипАкции") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ТипАкции", Параметры.ТипАкции,,"СлужебныйОтборПоТипуАкции");
		//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТипАкции", Параметры.ТипАкции);
		Если Параметры.ТипАкции = Перечисления.ТипыАкций.Баллы Тогда
			Заголовок = "Балльные акции";
		ИначеЕсли Параметры.ТипАкции = Перечисления.ТипыАкций.Скидки Тогда
			Заголовок = "Скидочные акции";
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры
