
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипАкции") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ТипАкции", Параметры.ТипАкции);
		//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТипАкции", Параметры.ТипАкции);
		Если Параметры.ТипАкции = Перечисления.ТипыАкций.Баллы Тогда
			Заголовок = "Балльные акции";
		ИначеЕсли Параметры.ТипАкции = Перечисления.ТипыАкций.Скидки Тогда
			Заголовок = "Скидочные акции";
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры
