
Процедура СтартСценарияПоРасписанию() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры


// Заполняет реквизиты формы адресами во временном хранилище для схемы компоновки данных
// и её настроек, полученными из реквизитов объекта формы.
//
// Параметры:
//   Форма - УправляемаяФорма - форма с заполненным объектом, содержащим хранилища СКД и её настроек
//   СхемаКомпоновкиДанных - Строка - имя реквизита объекта с хранилищем значения схемы компоновки данных
//   ХранилищеНастроекКомпоновкиДанных - Строка - имя реквизита объекта с хранилищем значения настроек схемы
//   АдресСКД - Строка - имя реквизита формы для размещения адреса СКД во временном хранилище
//   АдресНастроекСКД - Строка - имя реквизита формы для размещения адреса настроек во временном хранилище
Процедура ИнициализацияКомпоновкиИАдресов(Форма, ИмяШаблонаСКД, РеквизитХранилищеНастроекКомпоновкиДанных = "ХранилищеНастроекКомпоновкиДанных", 
	АдресСКД = "АдресСКД", АдресНастроекСКД = "АдресНастроекСКД", Компоновщик = Неопределено) Экспорт
	
	Объект = Форма.Объект; 
	ОбъектСсылка = Объект.Ссылка;
	
	СхемаИНастройки = ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(ОбъектСсылка, ИмяШаблонаСКД, РеквизитХранилищеНастроекКомпоновкиДанных);	
	
	Если СхемаИНастройки.СхемаКомпоновкиДанных <> Неопределено Тогда
		Форма[АдресСКД] = ПоместитьВоВременноеХранилище(СхемаИНастройки.СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КонецЕсли;
	Если СхемаИНастройки.НастройкиКомпоновкиДанных <> Неопределено Тогда
		Форма[АдресНастроекСКД] = ПоместитьВоВременноеХранилище(СхемаИНастройки.НастройкиКомпоновкиДанных, Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Если не Компоновщик = Неопределено и не СхемаИНастройки.СхемаКомпоновкиДанных = Неопределено  Тогда
		
		Попытка
			Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма[АдресСКД]));
			Если СхемаИНастройки.НастройкиКомпоновкиДанных <> Неопределено Тогда
				Компоновщик.ЗагрузитьНастройки(СхемаИНастройки.НастройкиКомпоновкиДанных);
			Иначе
				Компоновщик.ЗагрузитьНастройки(СхемаИНастройки.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
			КонецЕсли;
			Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,,,
						ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;	
	
КонецПроцедуры

// Заполняет реквизиты формы адресами во временном хранилище для схемы компоновки данных
// и её настроек, полученными из реквизитов объекта формы.
//
// Параметры:
//   Форма - УправляемаяФорма - форма с заполненным объектом, содержащим хранилища СКД и её настроек
//   СхемаКомпоновкиДанных - Строка - имя реквизита объекта с хранилищем значения схемы компоновки данных
//   ХранилищеНастроекКомпоновкиДанных - Строка - имя реквизита объекта с хранилищем значения настроек схемы
//   АдресСКД - Строка - имя реквизита формы для размещения адреса СКД во временном хранилище
//   АдресНастроекСКД - Строка - имя реквизита формы для размещения адреса настроек во временном хранилище
Процедура ИнициализацияКомпоновки(Форма, ИмяШаблонаСКД, РеквизитХранилищеНастроекКомпоновкиДанных = "ХранилищеНастроекКомпоновкиДанных",Компоновщик = Неопределено) Экспорт
	
	Объект = Форма.Объект; 
	ОбъектСсылка = Объект.Ссылка;
	
	СхемаИНастройки = ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(ОбъектСсылка, ИмяШаблонаСКД, РеквизитХранилищеНастроекКомпоновкиДанных);	
	
	Если СхемаИНастройки.СхемаКомпоновкиДанных <> Неопределено Тогда
		АдресСКД = ПоместитьВоВременноеХранилище(СхемаИНастройки.СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Если не Компоновщик = Неопределено и не СхемаИНастройки.СхемаКомпоновкиДанных = Неопределено  Тогда
		Попытка
			Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
			Если СхемаИНастройки.НастройкиКомпоновкиДанных <> Неопределено Тогда
				Компоновщик.ЗагрузитьНастройки(СхемаИНастройки.НастройкиКомпоновкиДанных);
			Иначе
				Компоновщик.ЗагрузитьНастройки(СхемаИНастройки.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
			КонецЕсли;
			Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,,,
						ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;	
	
КонецПроцедуры

// Заполняет реквизиты формы расписанием регламентного задания.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, реквизиты которой заполняются данными расписания
//   РегламентноеЗаданиеGUID - Строка - имя реквизита формы, содержащего уникальный идентификатор регламентного задания
//   Расписание - Строка - имя реквизита формы, в который помещается объект РасписаниеРегламентногоЗадания
//   ФлагИспользования - Булево - признак использования регламентного задания. Заполняется процедурой.
//   РасписаниеСтрокой - Строка - строковое представление расписания. Заполняется процедурой.
Процедура ПолучитьРасписаниеРегламентногоЗадания(Форма, РегламентноеЗаданиеGUID = "РегламентноеЗаданиеGUID", Расписание = "Расписание",ФлагИспользования = Ложь, РасписаниеСтрокой = "") Экспорт
	
	Форма[Расписание] = Новый РасписаниеРегламентногоЗадания;
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		
		ФлагИспользования = Ложь;
		РасписаниеСтрокой = "";
		
		Форма[Расписание].ВремяНачала = '00010101220000'; // в 10:00 вечера
		Форма[Расписание].ПериодПовтораДней = 1; //каждый день
		
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		ИдентификаторЗадания = Форма.Объект[РегламентноеЗаданиеGUID];
		Если ТипЗнч(ИдентификаторЗадания) = Тип("УникальныйИдентификатор") Тогда
			Задание = РегламентныеЗаданияСервер.Задание(ИдентификаторЗадания);
			Если Задание <> Неопределено Тогда
				Расписание = Задание.Расписание;
				ФлагИспользования = Задание.Использование;
				РасписаниеСтрокой = Строка(Расписание);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(Ссылка, ИмяШаблона, РеквизитХранилищеНастроекКомпоновкиДанных = "ХранилищеНастроекКомпоновкиДанных") Экспорт

	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Описание",                  "");
	ВозвращаемоеЗначение.Вставить("СхемаКомпоновкиДанных",     Неопределено);
	ВозвращаемоеЗначение.Вставить("НастройкиКомпоновкиДанных", Неопределено);
	
	ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(Ссылка);
	
	Если не ВидОбъекта = "Справочник" и не ВидОбъекта = "Документ" Тогда
		Возврат ВозвращаемоеЗначение;
	Иначе
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Ссылка);	
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Таблица.%1 КАК ХранилищеНастроекКомпоновкиДанных
	|ИЗ
	|	%2 КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрШаблон(ТекстЗапроса,РеквизитХранилищеНастроекКомпоновкиДанных,ИмяТаблицы);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВозвращаемоеЗначение.Описание = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).Макеты.Найти(ИмяШаблона).Синоним;
	ВозвращаемоеЗначение.СхемаКомпоновкиДанных = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы).ПолучитьМакет(ИмяШаблона);
	Если Выборка.Следующий() Тогда
		ХранилищеНастроекКомпоновкиДанных = Выборка.ХранилищеНастроекКомпоновкиДанных; // ХранилищеЗначения 
		ВозвращаемоеЗначение.НастройкиКомпоновкиДанных = ХранилищеНастроекКомпоновкиДанных.Получить();
	КонецЕсли;
		
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

// Возвращает таблицу значений, содержащую ссылки на элементы,
// входящие в набор, по настройкам СКД.
//
// Параметры:
//   ОбъектСсылка - Ссылка - объект с СКД, настройками и расписанием.
//
// Возвращаемое значение:
//   СписокЗначений - список элементов, входящих в набор по настройкам СКД.
//
Функция СписокЭлементовСКД(СегментСсылка) Экспорт

	Настройки = ПолучитьНастройкиСписка(СегментСсылка);
	Возврат ТаблицаСКД(Настройки.СКД, Настройки.Настройки);

КонецФункции

Функция ПолучитьНастройкиСписка(СегментСсылка)
	
	РеквизитыСКДСегмента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СегментСсылка,
		"СхемаКомпоновкиДанных,ХранилищеНастроекКомпоновкиДанных,ИмяШаблонаСКД");
		
	НастройкиСегмента = РеквизитыСКДСегмента.ХранилищеНастроекКомпоновкиДанных.Получить();
		
	Если ПустаяСтрока(РеквизитыСКДСегмента.ИмяШаблонаСКД) Тогда
		
		СКД = РеквизитыСКДСегмента.СхемаКомпоновкиДанных.Получить();
		
	Иначе
		
		СКД_Макета = ПолучитьОписаниеИСхемуКомпоновкиДанныхПоИмениМакета(СегментСсылка, РеквизитыСКДСегмента.ИмяШаблонаСКД);
		СКД = СКД_Макета.СхемаКомпоновкиДанных;
		
	КонецЕсли;
	
	// подключить поля запроса списка
	
	Если СКД.НаборыДанных.Найти("СписокСегмента") <> Неопределено Тогда
		
		Поля = СКД.НаборыДанных.СписокСегмента.Поля;
		Для Каждого Поле Из Поля Цикл
			Поле.ОграничениеИспользования.Поле = Ложь;
		КонецЦикла;//подключить поля запроса списка
		
		НастройкиСписка = СКД.ВариантыНастроек.Список.Настройки;
		Настройки = СКД.НастройкиПоУмолчанию;
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиСписка.ПараметрыДанных, Настройки.ПараметрыДанных);
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиСписка.Отбор, Настройки.Отбор);
		
	ИначеЕсли  СКД.НаборыДанных.Найти("ФормированиеСегмента") <> Неопределено Тогда
		
		Если НастройкиСегмента <> Неопределено Тогда
			
			НастройкиСписка = НастройкиСегмента;
			
		Иначе
			
			НастройкиСписка = СКД.ВариантыНастроек.ФормированиеСегмента.Настройки;
			
		КонецЕсли;
		
		НаборВыводСегмента = СКД.НаборыДанных.Найти("ВыводСегмента");
		Если НаборВыводСегмента <> Неопределено Тогда
			СКД.НаборыДанных.Удалить(НаборВыводСегмента);
		КонецЕсли;
		
		КомпоновщикНастроекПромежуточный = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекПромежуточный.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
		КомпоновщикНастроекПромежуточный.ЗагрузитьНастройки(НастройкиСписка);
		КомпоновщикНастроекПромежуточный.Восстановить();
		
		НастройкиСписка = КомпоновщикНастроекПромежуточный.Настройки;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Новый Структура("СКД, Настройки", СКД, НастройкиСписка);
	
КонецФункции

Функция ТаблицаСКД(СКД, Настройки)

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СКД,Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Колонка = ТаблицаЗначений.Колонки.Найти("Партнер");
	Если Колонка <> Неопределено Тогда
		Колонка.Имя = "ЭлементСписка";
	КонецЕсли;
	Колонка = ТаблицаЗначений.Колонки.Найти("Номенклатура");
	Если Колонка <> Неопределено Тогда
		Колонка.Имя = "ЭлементСписка";
	КонецЕсли;
	Колонка = ТаблицаЗначений.Колонки.Найти("Характеристика");
	Если Колонка <> Неопределено Тогда
		Колонка.Имя = "ХарактеристикаЭлемента";
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Количество() = 1 Тогда
		ТаблицаЗначений.Свернуть("ЭлементСписка");
	Иначе
		ТаблицаЗначений.Свернуть("ЭлементСписка,ХарактеристикаЭлемента");
	КонецЕсли;

	Возврат ТаблицаЗначений;

КонецФункции


// Создает и возвращает структуру с предопределенными ключами для параметров регламентного задания.
//
// Возвращаемое значение:
//   Структура:
//     * ВидРегламентногоЗадания - Строка - имя вида регламентного задания
//     * РеквизитРегламентноеЗаданиеGUID - Строка - имя реквизита с GUID регламентного задания
//     * НаименованиеЗадания - Строка - наименование регламентного задания
Функция СтруктураПараметровЗадания() Экспорт
	СтруктураПараметровЗадания = Новый Структура;
	СтруктураПараметровЗадания.Вставить("ВидРегламентногоЗадания",Неопределено); 
	СтруктураПараметровЗадания.Вставить("НаименованиеЗадания",Неопределено);
	СтруктураПараметровЗадания.Вставить("РеквизитРегламентноеЗаданиеGUID","РеквизитРегламентноеЗаданиеGUID"); 
	Возврат  СтруктураПараметровЗадания;
КонецФункции	

Функция ОшибкаСтруктурыПараметровЗадания(СтруктураПараметровЗадания, ОписаниеОшибок = "")
	Ошибка  = не (ТипЗнч(СтруктураПараметровЗадания) = Тип("Структура"));
	Если не Ошибка Тогда
		Для каждого Элемент из СтруктураПараметровЗадания Цикл
			Если не (ТипЗнч(Элемент.Значение) = Тип("Строка")) или ПустаяСтрока(Элемент.Значение) Тогда
				Ошибка = Истина;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	Попытка
		Если Метаданные.РегламентныеЗадания.Найти(СтруктураПараметровЗадания.ВидРегламентногоЗадания) = Неопределено Тогда
			Ошибка = Истина;
		КонецЕсли;	
		Если не ОбщегоНазначенияПКМПКлиентСервер.ИмяСвойстваКорректно(СтруктураПараметровЗадания.РеквизитРегламентноеЗаданиеGUID) Тогда
			Ошибка = Истина;
		КонецЕсли;	
	Исключение
		Ошибка = Истина;
	КонецПопытки;		
	Возврат Ошибка;
КонецФункции	

// Сохраняет схему компоновки данных и пользовательские настройки компоновки данных 
// из временного хранилища формы в реквизиты объекта в виде ХранилищеЗначения.
//
// Параметры:
//  Форма - УправляемаяФорма - форма объекта, содержащая адреса временного хранилища
//  ТекущийОбъект - Произвольный - записываемый объект, в реквизиты которого помещаются значения
//  СхемаКомпоновкиДанных - Строка - имя реквизита объекта для хранения схемы компоновки данных
//  ХранилищеНастроекКомпоновкиДанных - Строка - имя реквизита объекта для хранения пользовательских настроек компоновки данных
//  АдресСКД - Строка - имя реквизита формы с адресом временного хранилища схемы компоновки данных
//  АдресНастроекСКД - Строка - имя реквизита формы с адресом временного хранилища пользовательских настроек компоновки данных
Процедура ПередЗаписьюОтбораКомпоновкиНаСервере(Форма,ТекущийОбъект, ХранилищеНастроекКомпоновкиДанных = "ХранилищеНастроекКомпоновкиДанных", 
											ИмяРеквизитаКомпоновщик, Отказ) Экспорт
	
	Ошибки = Неопределено;
	МассивОшибок = Новый Массив;
	Настройки = Форма[ИмяРеквизитаКомпоновщик].Настройки;
	Отбор = Настройки.Отбор;
	Если Не СлужебныйПКМП.ПроверитьОтборКомпоновки(Отбор, МассивОшибок) Тогда
		Для Каждого Текст Из МассивОшибок Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ИмяРеквизитаКомпоновщик , "Не заполнен набор промокодов");
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);
		Возврат;
	КонецЕсли;
	
	
	Если не Отбор.Элементы.Количество() = 0 Тогда 
		
		ТекущийОбъект[ХранилищеНастроекКомпоновкиДанных] =
			Новый ХранилищеЗначения(Настройки);
			
	Иначе
			
		ТекущийОбъект[ХранилищеНастроекКомпоновкиДанных] = Новый ХранилищеЗначения(Неопределено);
			
	КонецЕсли;
	
КонецПроцедуры



// Вызывается из обработчиков события "Перед записью" объектов с СКД, настройками и расписанием.
// Формирует массив заданий в свойстве "Задания" дополнительных свойств объекта из передаваемых параметров
//
// Параметры:
//  Объект  - Произвольный - объект с СКД, настройками и расписанием.
//  Отказ   - Булево - признак отказа от записи.
//  СтруктураПараметровЗадания - см. КомпоновкаИРасписание_ПКМП.СтруктураПараметровЗадания
//
Процедура ОбъектПередЗаписью(Объект, СтруктураПараметровЗадания = Неопределено, Отказ) Экспорт
	
	Если Отказ ИЛИ Объект.ОбменДанными.Загрузка ИЛИ Объект.ЭтоГруппа ИЛИ ОшибкаСтруктурыПараметровЗадания(СтруктураПараметровЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	// Создание регламентное задание (получение уникального идентификатора)
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗаданияСервер.Задание(Объект[СтруктураПараметровЗадания.РеквизитРегламентноеЗаданиеGUID]);
	Если Задание = Неопределено Тогда
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания[СтруктураПараметровЗадания.ВидРегламентногоЗадания]);
		ПараметрыЗадания.Вставить("Использование", Ложь);
		ПараметрыЗадания.Вставить("Наименование",  СтруктураПараметровЗадания.НаименованиеЗадания);
		Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		
		Объект[СтруктураПараметровЗадания.РеквизитРегламентноеЗаданиеGUID] = РегламентныеЗаданияСервер.УникальныйИдентификатор(Задание);
		
	КонецЕсли;
	
	Если не Объект.ДополнительныеСвойства.Свойство("Задания") Тогда
		Объект.ДополнительныеСвойства.Вставить("Задания",ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Задание));
	Иначе
		Объект.ДополнительныеСвойства.Задания.Добавить(Задание);
	КонецЕсли;		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Вызывается из обработчиков события "Перед удаление" объектов с СКД, настройками и расписанием.
// Удаляет связанные с объектом регламентые задания
//
// Параметры:
//  Объект  - Произвольный - объект с СКД, настройками и расписанием. помечаемый на удаление объект.
//  Отказ   - Булево - признак отказа от пометки на удаление.
//
Процедура ОбъектПередУдалением(Объект, РеквизитРегламентноеЗаданиеGUID = "РеквизитРегламентноеЗаданиеGUID", Отказ) Экспорт

	Если Отказ ИЛИ Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныеЗаданияСервер.УдалитьЗадание(Объект[РеквизитРегламентноеЗаданиеGUID]);

КонецПроцедуры

// Вызывается из обработчиков события "Обработка заполнения" объектов с СКД, настройками и расписанием.
//
// Параметры:
//  Объект           - СправочникОбъект.СегментыПартнеров, СправочникОбъект.СегментыНоменклатуры - копируемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//
Процедура ОбъектОбработкаЗаполнения(Объект, ДанныеЗаполнения = Неопределено) Экспорт
	
	Если НЕ Объект.ЭтоГруппа Тогда
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
		КонецЕсли; 
		
		// установить ответственного по умолчанию
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		// установить дату создания
		Если НЕ ЗначениеЗаполнено(Объект.ДатаСоздания) Тогда
			Объект.ДатаСоздания = ТекущаяДатаСеанса();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

// Вызывается из обработчиков события "При копировании" объектов с СКД, настройками и расписанием.
//
// Параметры:
//  Объект  - Произвольный - объект с СКД, настройками и расписанием, копируемый объект.
//
Процедура ОбъектПриКопировании(Объект, РеквизитРегламентноеЗаданиеGUID = "РеквизитРегламентноеЗаданиеGUID") Экспорт
	
	Если Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаСоздания = ТекущаяДатаСеанса();
	Объект[РеквизитРегламентноеЗаданиеGUID] = Неопределено;
	
КонецПроцедуры

// Вызывается из обработчиков события "При записи" объектов с СКД, настройками и расписанием.
//
// Параметры:
//  Объект  - Произвольный - объект с СКД, настройками и расписанием, записываемый объект.
//  Отказ   - Булево - признак отказа от записи.
//
Процедура ОбъектПриЗаписи(Объект, Отказ) Экспорт
	
	Если Отказ ИЛИ Объект.ОбменДанными.Загрузка ИЛИ Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Задания = Неопределено;
	Если не Объект.ДополнительныеСвойства.Свойство("Задания", Задания) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Задание Из Задания Цикл
		Если Задание = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПараметрыЗадания = Новый Структура;

		ПараметрыЗадания.Вставить("Использование", Ложь);
	
	// Расписание устанавливается в форме элемента
		Если Объект.ДополнительныеСвойства.Свойство("Расписание") И ТипЗнч(Объект.ДополнительныеСвойства.Расписание)
			= Тип("РасписаниеРегламентногоЗадания") И Строка(Объект.ДополнительныеСвойства.Расписание) <> Строка(
			Задание.Расписание) Тогда
			ПараметрыЗадания.Вставить("Расписание", Объект.ДополнительныеСвойства.Расписание);
		КонецЕсли;
	
	// Использование устанавливается в форме элемента
		Если Объект.ПометкаУдаления И Задание.Использование Тогда

			ПараметрыЗадания.Вставить("Использование", Ложь);

		ИначеЕсли Объект.ДополнительныеСвойства.Свойство("Использование") И Объект.ДополнительныеСвойства.Использование
			<> Задание.Использование Тогда

			ПараметрыЗадания.Вставить("Использование", Объект.ДополнительныеСвойства.Использование);

		КонецЕсли;

		Если Задание.Параметры.Количество() <> 1 Или Задание.Параметры[0] <> Объект.Ссылка Тогда
			Параметры = Новый Массив;
			Параметры.Добавить(Объект.Ссылка);
			ПараметрыЗадания.Вставить("Параметры", Параметры);
		КонецЕсли;

		РегламентныеЗаданияСервер.ИзменитьЗадание(Объект.РегламентноеЗадание, ПараметрыЗадания);
	КонецЦикла;
КонецПроцедуры






