Процедура ИнициализацияКомпоновки(Форма, СхемаКомпоновкиДанных = "СхемаКомпоновкиДанных", 	
	ХранилищеНастроекКомпоновкиДанных = "ХранилищеНастроекКомпоновкиДанных", 
	АдресСКД = "АдресСКД", АдресНастроекСКД = "АдресНастроекСКД") Экспорт
	
	Объект = Форма.Объект; 
	ОбъектСсылка = Объект.Ссылка;
	
	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
		
		РеквизитыСКД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, СтрШаблон("%1,%2", СхемаКомпоновкиДанных, ХранилищеНастроекКомпоновкиДанных));
		
		СКД = РеквизитыСКД[СхемаКомпоновкиДанных].Получить();
		Настройки = РеквизитыСКД[ХранилищеНастроекКомпоновкиДанных].Получить();
		
		Если СКД <> Неопределено Тогда
			Форма[АдресСКД] = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
		КонецЕсли;
		Если Настройки <> Неопределено Тогда
			Форма[АдресНастроекСКД] = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьРасписаниеРегламентногоЗадания(Форма, РегламентноеЗаданиеGUID = "РегламентноеЗаданиеGUID", Расписание = "Расписание",ФлагИспользования = Ложь, РасписаниеСтрокой = "") Экспорт
	
	Форма[Расписание] = Новый РасписаниеРегламентногоЗадания;
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		
		ФлагИспользования = Ложь;
		РасписаниеСтрокой = "";
		
		Форма[Расписание].ВремяНачала = '00010101220000'; // в 10:00 вечера
		Форма[Расписание].ПериодПовтораДней = 1; //каждый день
		
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		ИдентификаторЗадания = Форма.Объект[РегламентноеЗаданиеGUID];
		Если ТипЗнч(ИдентификаторЗадания) = Тип("УникальныйИдентификатор") Тогда
			Задание = РегламентныеЗаданияСервер.Задание(ИдентификаторЗадания);
			Если Задание <> Неопределено Тогда
				Расписание = Задание.Расписание;
				ФлагИспользования = Задание.Использование;
				РасписаниеСтрокой = Строка(Расписание);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

