#Область ПрограммныйИнтерфейс

// Установка константы
// Имя - имя константы
// Значение - значение константы
// ЭтоГруппа - это группа констант
// Родитель - родитель константы
// Возвращает ссылку на константу
Функция КонстантаУстановить(Имя,Значение = Неопределено, ЭтоГруппа = Ложь, Родитель = Неопределено) Экспорт
	Спр = Справочники.Константы;
	
	Рез = Спр.НайтиПоКоду(Имя);
	
	Если Рез.Пустая() Тогда
		Если ЭтоГруппа Тогда
			Рез = Спр.СоздатьГруппу();
		Иначе	
			Рез = Спр.СоздатьЭлемент();
		КонецЕсли;
		Рез.Код = Имя;
	Иначе
		Рез = Рез.ПолучитьОбъект();
	КонецЕсли;	
	Если не ЭтоГруппа Тогда 
		Рез.Значение = Значение;
	КонецЕсли;
	Рез.Родитель = Родитель;
	Рез.Записать();
	Возврат Рез.Ссылка;
КонецФункции	

// Получение константы
// Имя - имя константы
// ВозвращатьСсылкуНаКонстанту - возвращать ссылку на константу
// Возвращает значение константы
// Если константа не найдена и ВозвращатьСсылкуНаКонстанту = Ложь, то возвращается Неопределено
Функция КонстантаПолучить(Имя,ВозвращатьСсылкуНаКонстанту = Ложь) Экспорт
	Спр = Справочники.Константы;
	Рез = Спр.НайтиПоКоду(СокрЛП(Имя));
	Если Рез.Пустая() Тогда
		Если ВозвращатьСсылкуНаКонстанту Тогда
			Возврат Рез;
		Иначе	
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Если ВозвращатьСсылкуНаКонстанту Тогда
			Возврат Рез;
		ИначеЕсли не Рез.ЭтоГруппа Тогда
			Возврат Рез.Значение;
		Иначе
			мс = Новый Массив;
			Выб =  Справочники.Константы.Выбрать(Рез);
			Пока Выб.Следующий() Цикл
				Если Выб.ЭтоГруппа Тогда Продолжить;КонецЕсли;
				мс.Добавить(Выб.Значение);
			КонецЦикла;
			Возврат мс;
		КонецЕсли;
	КонецЕсли;	
КонецФункции	

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции


// Вывод если заполнено.
// 
// Параметры:
//  Преф - Строка - Преффикс вывода
//  Зн - Произвольный - Значение
//  Пост - Строка - Постфикс вывода
// 
// Возвращаемое значение:
//  Строка - Вывод, если заполнено
Функция ВыводЕслиЗаполнено(Преф="",Зн,Пост="")Экспорт
	Если не ЗначениеЗаполнено(Зн) Тогда Возврат "";
	Иначе Возврат Преф+" "+Зн+Пост;
	КонецЕсли;	
КонецФункции


// Возвращает срез массива по указанному номеру страницы для постраничной навигации
//
// Параметры:
//   МассивЭлементов - Массив из Произвольный
//   НомерЗапроса - Число - номер запрашиваемой страницы (начинается с 1)
//   МаксимальноеКоличествоЭлементов - Число - количество элементов в одном срезе
//
// Возвращаемое значение:
//   Массив из Произвольный - часть исходного массива в соответствии с указанным номером страницы
Функция СрезМассива(МассивЭлементов, НомерЗапроса, МаксимальноеКоличествоЭлементов = 500)Экспорт

	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(МассивЭлементов) Тогда
		МаксимальныйИндекс = МассивЭлементов.ВГраница();

		НачальныйИндекс = МаксимальноеКоличествоЭлементов * (НомерЗапроса - 1);
		КонечныйИндекс  = Мин(МаксимальноеКоличествоЭлементов * НомерЗапроса - 1, МаксимальныйИндекс);
		
		Если НачальныйИндекс <= МаксимальныйИндекс Тогда
			Индекс = НачальныйИндекс;
			Пока Индекс <= КонечныйИндекс Цикл
				Результат.Добавить(МассивЭлементов[Индекс]);
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции    


// Выполняет паузу в выполнении кода на указанное количество секунд.
//
// Параметры:
//   ЗадержкаСекунд - Число - время задержки в секундах
Процедура Пауза(ЗадержкаСекунд) Экспорт 
	ЗадержкаСекунд = Окр(ЗадержкаСекунд);
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СтрНачинаетсяС(СистемнаяИнформация.ТипПлатформы,"Win") Тогда
		СтрокаЗапроса = "ping -n 1 -w "+Формат(1000 * ЗадержкаСекунд, "ЧДЦ=0; ЧГ=") + " 127.255.255.255"; 
		WshShell = Новый COMОбъект("WScript.Shell"); 
		WshShell.Run(СтрокаЗапроса, 0, -1); 
		WshShell = "";  
	КонецЕсли;
КонецПроцедуры



Функция ПреобразоватьВЧисло(ЧислоСтрокой) Экспорт
	Рез = ?(не ЗначениеЗаполнено(ЧислоСтрокой),"0",СокрЛП(ЧислоСтрокой));  
	Рез = СтрЗаменить(Рез,Символы.НПП,"");
	Рез = СтрЗаменить(Рез,"%","");
	Рез = СтрЗаменить(Рез,",",".");
	Попытка
		Возврат Число(Рез);
	Исключение
		Возврат 0;
	КонецПопытки;	
КонецФункции	



Функция СформироватьПодтаблицу(Таблица,Отбор,СтрокаСортировки = "")  Экспорт  
	
	мс = Таблица.НайтиСтроки(Отбор);
	Если не мс.Количество()=0 Тогда 
		Подтаблица = Таблица.Скопировать(мс);
	Иначе
		Подтаблица = Таблица.СкопироватьКолонки();
	КонецЕсли;	
	
	Если не ПустаяСтрока(СтрокаСортировки) Тогда
		Подтаблица.Сортировать(СтрокаСортировки);
	КонецЕсли;	
	Возврат Подтаблица; 
	
КонецФункции
#КонецОбласти
