#Область СлужебныеПроцедурыИФункции

// Выполняет паузу в выполнении кода на указанное количество секунд.
//
// Параметры:
//   ЗадержкаСекунд - Число - время задержки в секундах
Процедура Пауза(ЗадержкаСекунд) Экспорт 
	ЗадержкаСекунд = Окр(ЗадержкаСекунд);
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СтрНачинаетсяС(СистемнаяИнформация.ТипПлатформы,"Win") Тогда
		СтрокаЗапроса = "ping -n 1 -w "+Формат(1000 * ЗадержкаСекунд, "ЧДЦ=0; ЧГ=") + " 127.255.255.255"; 
		WshShell = Новый COMОбъект("WScript.Shell"); 
		WshShell.Run(СтрокаЗапроса, 0, -1); 
		WshShell = "";  
	КонецЕсли;
КонецПроцедуры


// Возвращает подтаблицу значений, отфильтрованную по заданному отбору и отсортированную по строке сортировки.
//
// Параметры:
//   Таблица - ТаблицаЗначений - исходная таблица значений
//   Отбор - Структура - параметры для фильтрации строк
//   СтрокаСортировки - Строка - параметры сортировки
//
// Возвращаемое значение:
//   ТаблицаЗначений - отфильтрованная таблица значений
Функция СформироватьПодтаблицу(Таблица,Отбор,СтрокаСортировки = "")  Экспорт  
	
	мс = Таблица.НайтиСтроки(Отбор);
	Если не мс.Количество()=0 Тогда 
		Подтаблица = Таблица.Скопировать(мс);
	Иначе
		Подтаблица = Таблица.СкопироватьКолонки();
	КонецЕсли;	
	
	Если не ПустаяСтрока(СтрокаСортировки) Тогда
		Подтаблица.Сортировать(СтрокаСортировки);
	КонецЕсли;	
	Возврат Подтаблица; 
	
КонецФункции


Функция СтруктураРезультата(Результат, ИнформацияОбОшибке = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Успешно, Статус,ИнформацияОбОшибке");
	СтруктураВозврата.Результат = Результат;
	СтруктураВозврата.Успешно = (ИнформацияОбОшибке = Неопределено);
	СтруктураВозврата.Статус = ?(ИнформацияОбОшибке = Неопределено,"ОК","Ошибка");
	СтруктураВозврата.ИнформацияОбОшибке = ИнформацияОбОшибке;
	
	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти

#Область РаботаСКонстантами
// Возвращает значение константы из справочника Константы по коду. Если указан код группы, возвращает массив значений всех констант группы.
//
// Параметры:
//   Имя - Строка - код константы или группы констант
//
// Возвращаемое значение:
//   Структура:
//     * Ссылка - см. Справочник.Константы - ссылка на элемент или группу константы, или пустая ссылка, если не найдено
//     * Значение - Произвольный - значение константы или Массив из Произвольный для группы, или Неопределено, если не найдено
Функция ПолучитьИнформациюОКонстанте(Имя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Константы.Ссылка КАК Ссылка,
		|	Константы.ЭтоГруппа КАК ЭтоГруппа,
		|	Константы.Значение КАК Значение
		|ИЗ
		|	Справочник.Константы КАК Константы
		|ГДЕ
		|	Константы.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	

	Если РезультатЗапроса.Пустой() Тогда
		Ссылка = Справочники.Константы.ПустаяСсылка();
		Значение = Неопределено;
	Иначе
		ПозицияВыборки = РезультатЗапроса.Выбрать();
		ПозицияВыборки.Следующий();
		Ссылка = ПозицияВыборки.Ссылка;
		Если не ПозицияВыборки.ЭтоГруппа Тогда
			Значение = ПозицияВыборки.Значение;
		Иначе
			Значение = Новый Массив;
			Выб =  Справочники.Константы.Выбрать(Ссылка);
			Пока Выб.Следующий() Цикл
				Если Выб.ЭтоГруппа Тогда Продолжить;КонецЕсли;
				Значение.Добавить(Выб.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Новый Структура("Ссылка,Значение",Ссылка,Значение);
	
КонецФункции	

// Установка константы
// Имя - имя константы
// Значение - значение константы
// ЭтоГруппа - это группа констант
// Родитель - родитель константы
// Возвращает ссылку на константу
Функция КонстантаУстановить(Имя,Значение = Неопределено, ЭтоГруппа = Ложь, Родитель = Неопределено) Экспорт
	Спр = Справочники.Константы;
	
	Рез = Спр.НайтиПоКоду(Имя);
	
	Если Рез.Пустая() Тогда
		Если ЭтоГруппа Тогда
			Рез = Спр.СоздатьГруппу();
		Иначе	
			Рез = Спр.СоздатьЭлемент();
		КонецЕсли;
		Рез.Код = Имя;
	Иначе
		Рез = Рез.ПолучитьОбъект();
	КонецЕсли;	
	Если не ЭтоГруппа Тогда 
		Рез.Значение = Значение;
	КонецЕсли;
	Рез.Родитель = Родитель;
	Рез.Записать();
	Возврат Рез.Ссылка;
КонецФункции	

#КонецОбласти


