// Выполняет сериализацию объекта в XML
//
// Параметры:
//  Значение  - Произвольный - объект, который необходимо сериализовать в XML.
//
// Возвращаемое значение:
//   Строка   - объект, сериализованный в XML.
//
Функция ПолучитьXML(Значение) Экспорт
	
	Запись = Новый ЗаписьXML();
	Запись.УстановитьСтроку();
	//@skip-check undefined-variable
	СериализаторXDTO.ЗаписатьXML(Запись, Значение);
	Возврат Запись.Закрыть();
	
КонецФункции


// Вывод если заполнено.
// 
// Параметры:
//  Преф - Строка - Преффикс вывода
//  Зн - Произвольный - Значение
//  Пост - Строка - Постфикс вывода
// 
// Возвращаемое значение:
//  Строка - Вывод, если заполнено
Функция ВыводЕслиЗаполнено(Преф="",Зн,Пост="")Экспорт
	Если не ЗначениеЗаполнено(Зн) Тогда Возврат "";
	Иначе Возврат Преф+" "+Зн+Пост;
	КонецЕсли;	
КонецФункции

// Возвращает срез массива по указанному номеру страницы для постраничной навигации
//
// Параметры:
//   МассивЭлементов - Массив из Произвольный
//   НомерЗапроса - Число - номер запрашиваемой страницы (начинается с 1)
//   МаксимальноеКоличествоЭлементов - Число - количество элементов в одном срезе
//
// Возвращаемое значение:
//   Массив из Произвольный - часть исходного массива в соответствии с указанным номером страницы
Функция СрезМассива(МассивЭлементов, НомерЗапроса, МаксимальноеКоличествоЭлементов = 500)Экспорт

	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(МассивЭлементов) Тогда
		МаксимальныйИндекс = МассивЭлементов.ВГраница();

		НачальныйИндекс = МаксимальноеКоличествоЭлементов * (НомерЗапроса - 1);
		КонечныйИндекс  = Мин(МаксимальноеКоличествоЭлементов * НомерЗапроса - 1, МаксимальныйИндекс);
		
		Если НачальныйИндекс <= МаксимальныйИндекс Тогда
			Индекс = НачальныйИндекс;
			Пока Индекс <= КонечныйИндекс Цикл
				Результат.Добавить(МассивЭлементов[Индекс]);
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции    

// Преобразует строковое представление числа в числовое значение. Удаляет пробелы, символ процента и заменяет запятую на точку. 
// Если преобразование невозможно или строка не заполнена, возвращает 0.
//
// Параметры:
//   ЧислоСтрокой - Строка - строковое представление числа, может содержать пробелы, запятые или символ процента
//
// Возвращаемое значение:
//   Число - преобразованное числовое значение или 0 при ошибке преобразования
Функция ПреобразоватьВЧисло(ЧислоСтрокой) Экспорт
	Рез = ?(не ЗначениеЗаполнено(ЧислоСтрокой),"0",СокрЛП(ЧислоСтрокой));  
	Рез = СтрЗаменить(Рез,Символы.НПП,"");
	Рез = СтрЗаменить(Рез,"%","");
	Рез = СтрЗаменить(Рез,",",".");
	Попытка
		Возврат Число(Рез);
	Исключение
		Возврат 0;
	КонецПопытки;	
КонецФункции	

Функция ИмяСвойстваКорректно(Знач ИмяСвойства) Экспорт

   ВременнаяСтруктура = Новый Структура;
   Попытка
       ВременнаяСтруктура.Вставить(ИмяСвойства);
       Возврат Истина;
   Исключение
       Возврат Ложь;
   КонецПопытки;

КонецФункции



