
&НаСервере
Процедура СгенерироватьНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура Сгенерировать(Команда)
	СгенерироватьНаСервере();
КонецПроцедуры

#Область ЗагрузкаПромокодов
&НаКлиенте
Процедура ЗагрузитьИзТаблицы(Команда)
	ОписаниеОповещенияПриЗакрытииФормыЗагрузки = Новый ОписаниеОповещения("ПриЗакрытииОкнаЗагрузки",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаИзТабличногоДокумента",ПолучитьПараметрыОткрытия(),ЭтаФорма,,,,ОписаниеОповещенияПриЗакрытииФормыЗагрузки);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыОткрытия()
	СписокКолонок = Новый СписокЗначений;
	СписокКолонок.Добавить("Промокод","Промокод",Истина);
	СписокКолонок.Добавить("Начало","Дата начала действия (в формате дд.мм.гггг чч:мм)");
	СписокКолонок.Добавить("Окончание","Дата окончания действия (в формате дд.мм.гггг чч:мм)");

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокКолонок",СписокКолонок);
	ПараметрыОткрытия.Вставить("Описание","В таблицу необходимо скорпировать иил загрузить из файла список промокодов. 
											|Над данными необходимо ввести наименование столбцов для загрузки в любом порядке.");
	Возврат ПараметрыОткрытия;
КонецФункции

&НаКлиенте
Процедура ПовторноеОткрытиеОкнаЗагрузки(ТабличныйДокумент) Экспорт
	ОписаниеОповещенияПриЗакрытииФормыЗагрузки = Новый ОписаниеОповещения("ПриЗакрытииОкнаЗагрузки",ЭтаФорма);
	ПараметрыОткрытия = ПолучитьПараметрыОткрытия();
	ПараметрыОткрытия.Вставить("ТабличныйДокумент",ТабличныйДокумент);
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаИзТабличногоДокумента",ПараметрыОткрытия,ЭтаФорма,,,,ОписаниеОповещенияПриЗакрытииФормыЗагрузки);
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытииОкнаЗагрузки(РезультатЗакрытия,ДопПараметры) Экспорт
	Если не ТипЗнч(РезультатЗакрытия) = Тип("ТабличныйДокумент") Тогда Возврат; КонецЕсли;
	СтрокаИнформации = 0;КолонкаПромокод = 0;КолонкаНачало = 0; КолонкаОкончание = 0;
	Для Строка=1 по 100 Цикл
		СтрокаИнформации = Строка;
		Для Колонка=1 по 100 Цикл
			ТекстОбласти =  СтрЗаменить((Врег(РезультатЗакрытия.Область(Строка,Колонка,Строка,Колонка).Текст))," ","");
			Если ТекстОбласти = "ПРОМОКОД"  Тогда КолонкаПромокод = Колонка;КонецЕсли;
			Если ТекстОбласти = "НАЧАЛО"  Тогда КолонкаНачало = Колонка;КонецЕсли;
			Если ТекстОбласти = "ОКОНЧАНИЕ"  Тогда КолонкаОкончание = Колонка;КонецЕсли;
		КонецЦикла;	
		Если не КолонкаПромокод = 0 Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Если КолонкаПромокод = 0 Тогда
		ОписаниеОповещенияПриОшибке = Новый ОписаниеОповещения("ПовторноеОткрытиеОкнаЗагрузки",ЭтаФорма,РезультатЗакрытия);
		ПоказатьПредупреждение(ОписаниеОповещенияПриОшибке,"Не все обязательные колонки указаны.");
		Возврат;
	КонецЕсли;   
	
//	ТаблицаНоменклатурыКЗагрузке.Очистить();  Объект.Товары.Очистить();
//	
//	КоличествоПустых=0;
//	Пока КоличествоПустых<50 Цикл
//		
//		СтрокаИнформации = СтрокаИнформации+1; 
//		
//		Идентификатор = СокрЛП(РезультатЗакрытия.Область(СтрокаИнформации,КолонкаИдентификатора,СтрокаИнформации,КолонкаИдентификатора).Текст);
//		
//		Если ПустаяСтрока(Идентификатор) Тогда 
//				КоличествоПустых  =  КоличествоПустых+1;
//				Продолжить;
//		КонецЕсли;	
//		КоличествоПустых = 0;
//		
//		Если не КолонкаКоэфф = 0 Тогда
//			Коэфф = ССА_ДопМодульСУЗ.ПреобразоватьВЧисло(РезультатЗакрытия.Область(СтрокаИнформации,КолонкаКоэфф,СтрокаИнформации,КолонкаКоэфф).Текст);
//		Иначе
//			Коэфф = 1;
//		КонецЕсли;
//		
//		Товар = "";
//		Если не КолонкаТовара = 0 Тогда
//			Товар = СокрЛП(РезультатЗакрытия.Область(СтрокаИнформации,КолонкаТовара,СтрокаИнформации,КолонкаТовара).Текст);
//		КонецЕсли;
//
//		С_ТаблицаНоменклатурыКЗагрузке = ТаблицаНоменклатурыКЗагрузке.Добавить();
//		С_ТаблицаНоменклатурыКЗагрузке.Идентификатор = Идентификатор;
//		С_ТаблицаНоменклатурыКЗагрузке.Товар = Товар;
//		С_ТаблицаНоменклатурыКЗагрузке.Коэффициент = Коэфф; 
//		
//	КонецЦИкла;	
//	
//	ЗаполнитьНаСервере();
//	
//	
//	Для каждого С_ТаблицаНоменклатурыКЗагрузке из ТаблицаНоменклатурыКЗагрузке Цикл
//		Если С_ТаблицаНоменклатурыКЗагрузке.Номенклатура.Пустая() Тогда
//			Сообщить("Товар "+С_ТаблицаНоменклатурыКЗагрузке.Товар+"( идентификатор "+С_ТаблицаНоменклатурыКЗагрузке.Идентификатор+") не найден.");
//		КонецЕсли;	                                                                                                                                
//	КонецЦикла;	
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьНаСервере()
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ТЧ.Идентификатор,
//		|	ТЧ.Товар,
//		|	ТЧ.Коэффициент
//		|ПОМЕСТИТЬ ТоварКЗагрузке
//		|ИЗ
//		|	&ТЧ КАК ТЧ
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТоварКЗагрузке.Идентификатор,
//		|	ТоварКЗагрузке.Товар,
//		|	ТоварКЗагрузке.Коэффициент,
//		|	СправочникНоменклатура.Ссылка как Номенклатура
//		|ИЗ
//		|	ТоварКЗагрузке КАК ТоварКЗагрузке 
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
//		|		ПО Выразить(ТоварКЗагрузке.Идентификатор как СТРОКА(100)) = СправочникНоменклатура.Код";
//		
//	Запрос.Параметры.Вставить("ТЧ",ТаблицаНоменклатурыКЗагрузке.Выгрузить());
//	РезультатЗапроса = Запрос.Выполнить();
//	Если не РезультатЗапроса.Пустой() Тогда
//		тзРезультат = РезультатЗапроса.Выгрузить();
//		ТаблицаНоменклатурыКЗагрузке.Загрузить(тзРезультат);
//		Объект.Товары.Загрузить(тзРезультат);
//	КонецЕсли;
//	
//КонецПроцедуры
#КонецОбласти
