
&НаКлиенте
Процедура ТипПромокодаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры


&НаКлиенте
Процедура НастройкаГенерацииПриИзменении(Элемент)
	РассчитатьПараметрыГенерации();
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьПромокодыПриИзменении(Элемент)
	Если Объект.ГенерироватьПромокоды Тогда
		РассчитатьПараметрыГенерации();
	КонецЕсли;	
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОшибок(Команда)
	Элементы.ФильтрОшибок.Пометка = не Элементы.ФильтрОшибок.Пометка;
	Если Элементы.ФильтрОшибок.Пометка Тогда
		Элементы.ФильтрОшибок.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Элементы.ПромокодыКСозданию.ОтборСтрок = Новый ФиксированнаяСтруктура("Ошибка", Истина);
	Иначе
		Элементы.ФильтрОшибок.Отображение = ОтображениеКнопки.Текст;
		Элементы.ПромокодыКСозданию.ОтборСтрок = Неопределено;
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформлениеПромокодов();
	
	ИнформацияОСостоянииНабораНаФорму();
	
	Если Объект.ГенерироватьПромокоды Тогда
		РассчитатьПараметрыГенерации();
	КонецЕсли;	
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура ИнформацияОСостоянииНабораНаФорму()
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Справочники.НаборыПромокодов.ТекущееСостояниеНабораПромокодов(Объект.Ссылка));
КонецПроцедуры	
	
&НаСервере
Процедура УправлениеФормой()
	Элементы.ГруппаСгенерировать.Видимость = Объект.ГенерироватьПромокоды;
	Элементы.ГруппаЗагрузить.Видимость = не Объект.ГенерироватьПромокоды;
	
	Если Объект.ГенерироватьПромокоды Тогда
		Если не Объект.НастройкаГенерации.Пустая() и МаксимальноеКоличествоГенерации>ОбщееКоличество Тогда
			ГенерацияВозможна = Истина;
			Элементы.КоличествоГенерации.Заголовок = СтрШаблон("Количество промокодов генерации (от 1 до %1)",МаксимальноеКоличествоГенерации-ОбщееКоличество);
			Элементы.КоличествоГенерации.МинимальноеЗначение = 1;
			Элементы.КоличествоГенерации.МаксимальноеЗначение = МаксимальноеКоличествоГенерации-ОбщееКоличество;
			КоличествоГенерации = 1;
		Иначе
			ГенерацияВозможна = Ложь;
			Если Объект.НастройкаГенерации.Пустая() Тогда 
				Элементы.ДекорацияГенерацияНевозможна.Заголовок = "выберите настройку генерации"; 
			Иначе 
				Элементы.ДекорацияГенерацияНевозможна.Заголовок = СтрШаблон("превышено максимальное количество генерации %1",МаксимальноеКоличествоГенерации); 
			КонецЕсли;
		КонецЕсли;
		Элементы.ГруппаВозможнаГенерация.Видимость = 	ГенерацияВозможна;		
		Элементы.ГруппаГенерацияНевозможна.Видимость = 	не ГенерацияВозможна;		
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьПараметрыГенерации()
	Если Объект.НастройкаГенерации.Пустая() Тогда
		МаксимальноеКоличествоГенерации = 0;
	Иначе
		МаксимальноеКоличествоГенерации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.НастройкаГенерации, "МаксимальноеКоличество");
	КонецЕсли;	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформлениеПромокодов()

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПромокодыКСозданию.Ошибка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПромокодыКСозданиюПромокод");

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПромокодыКСозданиюНачало");

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПромокодыКСозданиюОкончание");

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПромокодыКСозданиюЕстьДействующийДубль");

КонецПроцедуры

&НаСервере
Процедура СгенерироватьНаСервере()
	РезультатГенерации = Справочники.НастройкиГенерацииПромокодов.СгенерироватьПромокодыНаСервере(Объект.НастройкаГенерации, КоличествоГенерации);
	Если РезультатГенерации.Ошибка Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатГенерации.Сообщение);
	Иначе
		Для каждого СгенерированныйПромокод из РезультатГенерации.Промокоды Цикл
		КонецЦикла;	
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура Сгенерировать(Команда)
	СгенерироватьНаСервере();
КонецПроцедуры

#Область ЗагрузкаПромокодов
&НаКлиенте
Процедура ЗагрузитьИзТаблицы(Команда)
	ОписаниеОповещенияПриЗакрытииФормыЗагрузки = Новый ОписаниеОповещения("ПриЗакрытииОкнаЗагрузки",ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаИзТабличногоДокумента",ПолучитьПараметрыОткрытия(),ЭтотОбъект,,,,ОписаниеОповещенияПриЗакрытииФормыЗагрузки);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыОткрытия()
	СписокКолонок = Новый СписокЗначений;
	СписокКолонок.Добавить("Промокод","Промокод",Истина);
	СписокКолонок.Добавить("Начало","Дата начала действия (в формате дд.мм.гггг чч:мм)");
	СписокКолонок.Добавить("Окончание","Дата окончания действия (в формате дд.мм.гггг чч:мм)");

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокКолонок",СписокКолонок);
	ПараметрыОткрытия.Вставить("Описание","В таблицу необходимо скорпировать или загрузить из файла список промокодов. 
											|Над данными необходимо ввести наименование столбцов для загрузки в любом порядке.");
	Возврат ПараметрыОткрытия;
КонецФункции

&НаКлиенте
Процедура ПовторноеОткрытиеОкнаЗагрузки(ТабличныйДокумент) Экспорт
	ОписаниеОповещенияПриЗакрытииФормыЗагрузки = Новый ОписаниеОповещения("ПриЗакрытииОкнаЗагрузки",ЭтотОбъект);
	ПараметрыОткрытия = ПолучитьПараметрыОткрытия();
	ПараметрыОткрытия.Вставить("ТабличныйДокумент",ТабличныйДокумент);
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаИзТабличногоДокумента",ПараметрыОткрытия,ЭтотОбъект,,,,ОписаниеОповещенияПриЗакрытииФормыЗагрузки);
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытииОкнаЗагрузки(РезультатЗакрытия,ДопПараметры) Экспорт
	Если не ТипЗнч(РезультатЗакрытия) = Тип("ТабличныйДокумент") Тогда Возврат; КонецЕсли;
	СтрокаИнформации = 0;КолонкаПромокод = 0;КолонкаНачало = 0; КолонкаОкончание = 0;
	Для Строка=1 по 100 Цикл
		СтрокаИнформации = Строка;
		Для Колонка=1 по 100 Цикл
			ТекстОбласти =  СтрЗаменить((Врег(РезультатЗакрытия.Область(Строка,Колонка,Строка,Колонка).Текст))," ","");
			Если ТекстОбласти = "ПРОМОКОД"  Тогда КолонкаПромокод = Колонка;КонецЕсли;
			Если ТекстОбласти = "НАЧАЛО"  Тогда КолонкаНачало = Колонка;КонецЕсли;
			Если ТекстОбласти = "ОКОНЧАНИЕ"  Тогда КолонкаОкончание = Колонка;КонецЕсли;
		КонецЦикла;	
		Если не КолонкаПромокод = 0 Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Если КолонкаПромокод = 0 Тогда
		ОписаниеОповещенияПриОшибке = Новый ОписаниеОповещения("ПовторноеОткрытиеОкнаЗагрузки",ЭтотОбъект,РезультатЗакрытия);
		ПоказатьПредупреждение(ОписаниеОповещенияПриОшибке,"Не все обязательные колонки указаны.");
		Возврат;
	КонецЕсли;   
	
	ПромокодыКСозданию.Очистить();  
	
	КоличествоПустых=0;
	Пока КоличествоПустых<50 Цикл
		
		СтрокаИнформации = СтрокаИнформации+1; 
		
		Промокод = СокрЛП(РезультатЗакрытия.Область(СтрокаИнформации,КолонкаПромокод,СтрокаИнформации,КолонкаПромокод).Текст);
		
		Если ПустаяСтрока(Промокод) Тогда 
				КоличествоПустых  =  КоличествоПустых+1;
				Продолжить;
		КонецЕсли;	
		КоличествоПустых = 0;
		
		Если не КолонкаНачало = 0 Тогда
			Начало = ОбщегоНазначенияПКМПКлиентСервер.ДатаИзСтроки(РезультатЗакрытия.Область(СтрокаИнформации,КолонкаНачало,СтрокаИнформации,КолонкаНачало).Текст);
		Иначе
			Начало = Дата(1,1,1);
		КонецЕсли;
		
		Если не КолонкаОкончание = 0 Тогда
			Окончание = ОбщегоНазначенияПКМПКлиентСервер.ДатаИзСтроки(РезультатЗакрытия.Область(СтрокаИнформации,КолонкаОкончание,СтрокаИнформации,КолонкаОкончание).Текст);
		Иначе
			Окончание = Дата(1,1,1);
		КонецЕсли;
		

		С_ПромокодыКСозданию = ПромокодыКСозданию.Добавить();
		С_ПромокодыКСозданию.Промокод = ВРег(Промокод);
		С_ПромокодыКСозданию.Начало = Начало;
		С_ПромокодыКСозданию.Окончание = Окончание; 
		
	КонецЦИкла;	
	
	ПроверитьНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	
	ПромокодыКПроверке = Новый ТаблицаЗначений;
	ПромокодыКПроверке.Колонки.Добавить("Промокод",Метаданные.ОпределяемыеТипы.Промокод.Тип);
	ПромокодыКПроверке.Колонки.Добавить("Начало",Новый ОписаниеТипов("Дата"));
	ПромокодыКПроверке.Колонки.Добавить("Окончание",Новый ОписаниеТипов("Дата"));
	ПромокодыКПроверке.Колонки.Добавить("ИДСтроки",Новый ОписаниеТипов("Число"));
	
	УникальныеПромокоды = Новый Массив;
	ОшибкиСтроки = Новый Массив;
	НомерСтроки = 0; 
	ПолныйАлфавит = Справочники.НастройкиГенерацииПромокодов.ПолныйАлфавит();
	Для каждого С_ПромокодыКСозданию из ПромокодыКСозданию Цикл
		
		С_ПромокодыКСозданию.Ошибка = Ложь;
		С_ПромокодыКСозданию.ТекстОшибки = "";
		
		НомерСтроки = НомерСтроки + 1;  
		ОшибкиСтроки.Очистить();
		Если ПустаяСтрока(С_ПромокодыКСозданию.Промокод) Тогда
			ОшибкиСтроки.Добавить(" не указан промокод");
		ИначеЕсли не Справочники.НастройкиГенерацииПромокодов.СостоитИзСимволовАлфавита(С_ПромокодыКСозданию.Промокод, ПолныйАлфавит) Тогда
			ОшибкиСтроки.Добавить(" в промокоде есть недопустимые символы");
		КонецЕсли;	
		Если ЗначениеЗаполнено(С_ПромокодыКСозданию.Начало) 
				и ЗначениеЗаполнено(С_ПромокодыКСозданию.Окончание) 
				и С_ПромокодыКСозданию.Начало>С_ПромокодыКСозданию.Окончание 
			Тогда
			ОшибкиСтроки.Добавить(" ошибочный диапазон времени действия");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(С_ПромокодыКСозданию.Окончание) 
				и (С_ПромокодыКСозданию.Окончание - ТекущаяДатаСеанса() < 3600)
			Тогда
			ОшибкиСтроки.Добавить(" окончание действия промокодов ранее часа от текущего времени");
		КонецЕсли;	
		
		Если не УникальныеПромокоды.Найти(С_ПромокодыКСозданию.Промокод) = Неопределено Тогда
			ОшибкиСтроки.Добавить(" промокод неуникальный в текущем наборе к созданию");
		КонецЕсли;	
		
		Если не ОшибкиСтроки.Количество() = 0 Тогда
			С_ПромокодыКСозданию.ТекстОшибки = СтрШаблон("В строке %1: %2)",НомерСтроки, СтрСоединить(ОшибкиСтроки,";"));
			С_ПромокодыКСозданию.Ошибка = Истина;
			Продолжить;
		КонецЕсли;	
		
		С_ПромокодыКПроверке = ПромокодыКПроверке.Добавить();
		ЗаполнитьЗначенияСвойств(С_ПромокодыКПроверке, С_ПромокодыКСозданию);
		С_ПромокодыКПроверке.ИДСтроки = С_ПромокодыКСозданию.ПолучитьИдентификатор();
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Промокод КАК Промокод,
		|	ТЧ.Начало КАК Начало,
		|	ТЧ.Окончание КАК Окончание,
		|	ТЧ.ИДСтроки КАК ИДСтроки
		|ПОМЕСТИТЬ ПромокодыКЗагрузке
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПромокодыКЗагрузке.ИДСтроки КАК ИДСтроки,
		|	СУММА(ВЫБОР
		|		КОГДА РС_Промокоды.Промокод ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|	КОНЕЦ) КАК КоличествоВСуществующих,
		|	СУММА(ВЫБОР
		|		КОГДА РС_Промокоды.НаборПромокодов = &ТекущийНабор
		|			ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоВТекущем
		|ИЗ
		|	ПромокодыКЗагрузке КАК ПромокодыКЗагрузке
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Промокоды КАК РС_Промокоды
		|		ПО РС_Промокоды.Промокод = ПромокодыКЗагрузке.Промокод
		|		И НЕ РС_Промокоды.Отозван
		|		И (РС_Промокоды.Многоразовый
		|		ИЛИ НЕ РС_Промокоды.Использован)
		|		И ПромокодыКЗагрузке.Начало <= &РС_Окончание
		|		И &ТЧ_Окончание >= РС_Промокоды.НачалоДействия
		|СГРУППИРОВАТЬ ПО
		|	ПромокодыКЗагрузке.ИДСтроки
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|		КОГДА РС_Промокоды.Промокод ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|	КОНЕЦ) > 0";
		
		
	Запрос.Параметры.Вставить("ТЧ",ПромокодыКПроверке);
	Запрос.Параметры.Вставить("ТекущийНабор",Объект.Ссылка);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&РС_Окончание",СлужебныйПКМП.ДатаПустаяКакМакс("РС_Промокоды.ОкончаниеДействия"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТЧ_Окончание",СлужебныйПКМП.ДатаПустаяКакМакс("ПромокодыКЗагрузке.Окончание"));
	
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();

	НомерСтроки = 0; 
	Для каждого С_ПромокодыКСозданию из ПромокодыКСозданию Цикл
		НомерСтроки = НомерСтроки + 1;                                                                                                                                
		ИндексСтроки = Формат((НомерСтроки-1), "ЧН=0; ЧГ=");
		АдресСтроки = СтрШаблон("ПромокодыКСозданию[%1].Промокод",ИндексСтроки);
		Если С_ПромокодыКСозданию.Ошибка Тогда
			ОбщегоНазначения.СообщитьПользователю(С_ПромокодыКСозданию.ТекстОшибки,,АдресСтроки);
		Иначе
			ВыборкаЗапроса.Сбросить();
			Если ВыборкаЗапроса.НайтиСледующий(С_ПромокодыКСозданию.ПолучитьИдентификатор(), "ИДСтроки") Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке %1 промокод %2 дублирует сформированный неиспользованный промокод с пересекающимися периодами действия",НомерСтроки,С_ПромокодыКСозданию.Промокод),,АдресСтроки);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
