#Область ГруппаДеньНеделиВремя

// Размещает на форме элементы выбора дней недели и временного диапазона срабатывания.У Объекта формы должны быть
// реквизиты - НеОграничиватьВремяСрабатывания,ВремяС,ВремяПо,ЧасовойПояс
//
// Параметры:
//   Форма - УправляемаяФорма - форма, на которой размещаются элементы
//   ГруппаРазмещения - Строка - имя группы формы, в которую добавляются элементы
//   ЭлементПеред - ЭлементФормы, Неопределено - элемент формы, перед которым вставляются новые элементы.
//                              Если Неопределено, элементы добавляются в конец группы
Процедура ДеньНеделиВремяПриСозданииФормы(Форма, ГруппаРазмещения = "ГруппаДеньНеделиВремя", ЭлементПеред = Неопределено) Экспорт
	
	НеОграничиватьВремяСрабатывания = УправлениеФормамиПКМП.НовоеПолеФлажка(Форма, "НеОграничиватьВремяСрабатывания", "Объект.НеОграничиватьВремяСрабатывания", ГруппаРазмещения, ЭлементПеред);
	НеОграничиватьВремяСрабатывания.УстановитьДействие("ПриИзменении","Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении");
	
	ГруппаВремя = УправлениеФормамиПКМП.НоваяГруппа(Форма, "ГруппаВремя", "",, ГруппаРазмещения, ЭлементПеред);	
	ГруппаВремя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	УправлениеФормамиПКМП.НоваяДекорацияФормы(Форма, "ДекорацияВремя", "Сработать с ", ГруппаВремя);
	ПолеВремя = УправлениеФормамиПКМП.НовоеПолеВвода(Форма, "ВремяС", "Объект.ВремяС", ГруппаВремя);
	ПолеВремя.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	УстановитьСписокВыбораДляПоляВводаВремени(ПолеВремя);
	
	УправлениеФормамиПКМП.НоваяДекорацияФормы(Форма, "ДекорацияДо", " - ", ГруппаВремя);
	ПолеВремя = УправлениеФормамиПКМП.НовоеПолеВвода(Форма, "ВремяПо", "Объект.ВремяПо", ГруппаВремя);
	ПолеВремя.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	УстановитьСписокВыбораДляПоляВводаВремени(ПолеВремя);
	
	ЧасовойПояс = УправлениеФормамиПКМП.НовоеПолеВвода(Форма, "ЧасовойПояс", "Объект.ЧасовойПояс", ГруппаВремя);
	ЧасовойПояс.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	
	УправлениеФормамиПКМП.НоваяКомандаФормы(Форма, "КомандаВыбратьВремя", "Выбрать время", ОтображениеКнопки.КартинкаИТекст, "Подключаемая_ВыбратьДеньНедели");
	
	ГруппаДеньНедели = УправлениеФормамиПКМП.НоваяГруппа(Форма, "ГруппаДеньНедели", "",, ГруппаРазмещения);	
	ГруппаДеньНедели.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	БазоваяДата = '00010101';
	
	Для ДеньНедели = 1 по 7 Цикл
		КнопкаДень = УправлениеФормамиПКМП.НоваяКнопкаФормы(Форма, "ДеньНедели" + ДеньНедели, ВидКнопкиФормы.ОбычнаяКнопка,  "КомандаВыбратьВремя", ГруппаДеньНедели);
		КнопкаДень.Заголовок = ТРег(Формат(БазоваяДата+(ДеньНедели+1) * 86400,"ДФ=ddd;"));
		КнопкаДень.Фигура = ФигураКнопки.Овал;
	КонецЦикла;	
	
КонецПроцедуры	

// Заполняет список выбора поля формы значениями времени с шагом 15 минут
// и настраивает режим выбора из списка.
//
// Параметры:
//   Элемент - ПолеФормы - поле формы, для которого заполняется список выбора времени
Процедура УстановитьСписокВыбораДляПоляВводаВремени(Элемент) Экспорт
	
	Для Час = 0 По 23 Цикл
		Для Минута = 0 По 3 Цикл
			Время = Дата(1, 1, 1, Час, Минута*15, 0);
			ВремяСтрока = Формат(Время, "ДФ=ЧЧ:мм; ДП=00:00;");
			Элемент.СписокВыбора.Добавить(Время, ВремяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Элемент.РежимВыбораИзСписка = Истина;
	Элемент.КнопкаВыпадающегоСписка = Истина;
	Элемент.Формат = "ДФ=HH:mm";
	Элемент.ФорматРедактирования = "ДФ=HH:mm";
КонецПроцедуры	

#КонецОбласти 



#Область ОбработкаСписковЗначений

Процедура СписокВыбораИзРеквизитовПоТипу(Элемент, Объект, ТипРеквизита) Экспорт
	
КонецПроцедуры	

Процедура СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение, Падеж) Экспорт
	Для каждого ЭлементСписка из Список Цикл
		Если не Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементСписка.Значение)) Тогда Продолжить; КонецЕсли;
		ЗначениеИсходное = ОбщегоНазначения.ИмяЗначенияПеречисления(ЭлементСписка.Значение);
		ЭлементСписка.Представление = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
	КонецЦикла;	
КонецПроцедуры

Процедура ДобавитьСтрокуГруппыСписка(Список, НазваниеГруппы) Экспорт
	Список.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока(НазваниеГруппы, Новый Шрифт(, 11, Истина, Истина)), , БиблиотекаКартинок.Группировка);
КонецПроцедуры
#КонецОбласти


