
&НаКлиенте
Процедура ПоследовательностьДействийВидДействияПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СВД = Справочники.ВидыДействийКлиента;
	ЭВД = Элементы.ПоследовательностьДействийВидДействия;
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Отправка рассылки");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия,Канал","ОтправкаРассылки_Страница",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Email);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"E-mail расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.SMS;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"SMS расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Mobile;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Мобильный пуш" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Website;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Веб пуш " , , БиблиотекаКартинок.Пустая);


	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Действия");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","ДействияВКампаниях_Страница",СВД.ДействиеВКампании);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","ВызватьВебхук_Страница",СВД.ВызватьВебхук);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Вызвать вебхук" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","СгенерироватьКодАвторизации_Страница",СВД.СгенерироватьКодАвторизации);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Сгенерировать код авторизации" , , БиблиотекаКартинок.Пустая);

	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Сегменты");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","Сегменты_Страница",СВД.КлиентПопалВСегмент);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент попал в сегмент" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.ВидДействия = СВД.КлиентВышелИзСегмента;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент вышел из сегмента" , , БиблиотекаКартинок.Пустая);

	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Списки продуктов");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","СпискиПродуктов_Страница",СВД.УстановкаСпискаПродуктов);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Очистка списка продуктов" , , БиблиотекаКартинок.Пустая);

	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Промокоды");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","Промокоды_Страница",СВД.КлиентуВыданПромокод);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Выдать промокод" , , БиблиотекаКартинок.Пустая);

	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Лояльность");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","Лояльность_Страница",СВД.ИзменениеБалансаБалловПоДействию);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Изменить баланс бального счета" , , БиблиотекаКартинок.Пустая);
	
	
	
КонецПроцедуры


	