&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СВД = Справочники.ВидыДействийКлиента;
	ЭВД = Элементы.ПоследовательностьДействийВидДействия;
	
	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Отправка рассылки");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Email);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"E-mail расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.SMS;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"SMS расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Mobile;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Мобильный пуш" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Website;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Веб пуш " , , БиблиотекаКартинок.Пустая);


	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Действия");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","ДействияВКампаниях",СВД.ДействиеВКампании);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","ВызватьВебхук",СВД.ВызватьВебхук);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Вызвать вебхук" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","СгенерироватьКодАвторизации",СВД.СгенерироватьКодАвторизации);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Сгенерировать код авторизации" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Сегменты");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Сегменты",СВД.КлиентПопалВСегмент);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент попал в сегмент" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.ВидДействия = СВД.КлиентВышелИзСегмента;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент вышел из сегмента" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Списки продуктов");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","СпискиПродуктов",СВД.УстановкаСпискаПродуктов);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Очистка списка продуктов" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Промокоды");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Промокоды",СВД.КлиентуВыданПромокод);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Выдать промокод" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Лояльность");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Лояльность",СВД.ИзменениеБалансаБалловПоДействию);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Изменить баланс бального счета" , , БиблиотекаКартинок.Пустая);
КонецПроцедуры



&НаКлиенте
Процедура ПоследовательностьДействийВидДействияОчистка(Элемент, СтандартнаяОбработка)
	ОбработкаТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийВидДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
	ОбработкаТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийПриАктивизацииСтроки(Элемент)
	ОбработкаТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаТекущейСтроки()
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено или не ЗначениеЗаполнено(ТекущиеДанные.НаборПараметров) Тогда
		Элементы.СтраницыПараметрыДействия.ТекущаяСтраница = Элементы.СтраницаПустая;
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыПараметрыДействия.ТекущаяСтраница = Элементы["Страница" + ТекущиеДанные.НаборПараметров];
	
КонецПроцедуры	



	