
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СВД = Справочники.ВидыДействийКлиента;
	ЭВД = Элементы.ПоследовательностьДействийВидДействия;
	
	ЭВД.СписокВыбора.Добавить("ЭтоГруппа", СтрокаГруппы("Отправка рассылки"), , БиблиотекаКартинок.Группировка);
	ЭВД.СписокВыбора.Добавить(СВД.ОтправкаРассылки	,	"E-mail расылка" , , БиблиотекаКартинок.Пустая);
	ЭВД.СписокВыбора.Добавить("ЭтоГруппа", СтрокаГруппы("ВыдачаДействий"), , БиблиотекаКартинок.Группировка);
	ЭВД.СписокВыбора.Добавить(СВД.ПустаяСсылка(), "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
КонецПроцедуры

&НаСервере
Функция СтрокаГруппы(Название)
	Возврат Новый ФорматированнаяСтрока(Название,Новый Шрифт(, 11, Истина, Истина));
КонецФункции	