
&НаКлиенте
Процедура ПоследовательностьДействийВидДействияПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СВД = Справочники.ВидыДействийКлиента;
	ЭВД = Элементы.ПоследовательностьДействийВидДействия;
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Отправка рассылки");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия,Канал","ОтправкаРассылки_Страница",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Email);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"E-mail расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.SMS;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"SMS расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Mobile;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Мобильный пуш" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Website;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Веб пуш " , , БиблиотекаКартинок.Пустая);


	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Действия");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","ДействияВКампаниях_Страница",СВД.ДействиеВКампании);
	ЭВД.СписокВыбора.Добавить(СВД.ДействиеВКампании, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
КонецПроцедуры


	