

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СВД = Справочники.ВидыДействийКлиента;
	ЭВД = Элементы.ПоследовательностьДействийВидДействия;
	
	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Отправка рассылки");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Email);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"E-mail расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.SMS);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"SMS расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Mobile);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Мобильный пуш" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Website);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Веб пуш " , , БиблиотекаКартинок.Пустая);


	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Действия");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","ДействияВКампаниях",СВД.ДействиеВКампании);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","ВызватьВебхук",СВД.ВызватьВебхук);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Вызвать вебхук" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","СгенерироватьКодАвторизации",СВД.СгенерироватьКодАвторизации);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Сгенерировать код авторизации" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Сегменты");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Сегменты",СВД.КлиентПопалВСегмент);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент попал в сегмент" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Сегменты",СВД.КлиентВышелИзСегмента);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент вышел из сегмента" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Списки продуктов");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","СпискиПродуктов",СВД.УстановкаСпискаПродуктов);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Очистка списка продуктов" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Промокоды");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Промокоды",СВД.КлиентуВыданПромокод);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Выдать промокод" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Лояльность");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Лояльность",СВД.ИзменениеБалансаБалловПоДействию);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Изменить баланс бального счета" , , БиблиотекаКартинок.Пустая);
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПоследовательностьДействий.ОшибкаВПараметрах");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ПоследовательностьДействий");
	ПолеЭлемента.Использование = Истина;
КонецПроцедуры

#Область ОбработкаИзмененийТЧПоследовательностьДействий
&НаКлиенте
Процедура ПоследовательностьДействийПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено И ТекущиеДанные.ВидДействия = ПредопределенноеЗначение(
		"Справочник.ВидыДействийКлиента.ДействиеВКампании") Тогда

		СтрокиПоИД = 	Объект.ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД", ТекущиеДанные.ИД));
		Для Каждого СтрокаПоИД Из СтрокиПоИД Цикл
			Объект.ФильтрПоДействиямВКампаниях.Удалить(СтрокаПоИД);
		КонецЦикла;

		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ОтменаРедактирования Тогда
		ОбработкаТекущейСтроки(Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийВидДействияОчистка(Элемент, СтандартнаяОбработка)
	ОбработкаТекущейСтроки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийВидДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ВыбранноеЗначение = "ЭтоГруппа" Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	ДействиеИзменено = (НЕ ТекущиеДанные.ВидДействия = ВыбранноеЗначение.ВидДействия ИЛИ 
									ВыбранноеЗначение.Свойство("Канал") И НЕ ТекущиеДанные.Канал = ВыбранноеЗначение.Канал);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
	ОбработкаТекущейСтроки(ДействиеИзменено);
	Элементы.ПоследовательностьДействий.ЗакончитьРедактированиеСтроки(Ложь);
	ОбработатьИзменениеПараметровДействия(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийПриАктивизацииСтроки(Элемент)
	ОбработкаТекущейСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаТекущейСтроки(ДействиеИзменено)
	
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено или не ЗначениеЗаполнено(ТекущиеДанные.НаборПараметров) Тогда
		Элементы.СтраницыПараметрыДействия.ТекущаяСтраница = Элементы.Пустая_Страница;
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыПараметрыДействия.ТекущаяСтраница = Элементы[ТекущиеДанные.НаборПараметров + "_Страница"];
	Если не ЗначениеЗаполнено(ТекущиеДанные.ИД) Тогда ТекущиеДанные.ИД = Новый УникальныйИдентификатор; КонецЕсли;


	Если ТекущиеДанные.ВидДействия = ПредопределенноеЗначение("Справочник.ВидыДействийКлиента.ДействиеВКампании") Тогда
			Элементы.ФильтрПоДействиямВКампаниях.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД", ТекущиеДанные.ИД);
	КонецЕсли;

	Если НЕ ДействиеИзменено Тогда
		Возврат;
	КонецЕсли;

	
	Если ТекущиеДанные.НаборПараметров = "ОтправкаРассылки" Тогда
		ТекущиеДанные.Рассылка = Неопределено;
	ИначеЕсли ТекущиеДанные.ВидДействия = ПредопределенноеЗначение("Справочник.ВидыДействийКлиента.ВызватьВебхук") Тогда
		ТекущиеДанные.Вебхук = Неопределено;
	ИначеЕсли ТекущиеДанные.ВидДействия = ПредопределенноеЗначение("Справочник.ВидыДействийКлиента.СгенерироватьКодАвторизации") Тогда
		ТекущиеДанные.КоличествоПериодовДействияКодаАвторизации = 5;
		ТекущиеДанные.	ПериодДействияКодаАвторизации = ПредопределенноеЗначение("Перечисление.ПериодыДействий.Минута");
		ПоследовательностьДействийКоличествоПериодовДействияКодаАвторизацииПриИзменении(Неопределено);	
	ИначеЕсли ТекущиеДанные.НаборПараметров = "Сегменты" Тогда
		ТекущиеДанные.СегментПартнеров = Неопределено;
	ИначеЕсли ТекущиеДанные.НаборПараметров = "СпискиПродуктов" Тогда
		ТекущиеДанные.СписокПродуктов = Неопределено;
	ИначеЕсли ТекущиеДанные.НаборПараметров = "Промокоды" Тогда
		ТекущиеДанные.НаборПромокодов = Неопределено;
	ИначеЕсли ТекущиеДанные.НаборПараметров = "Лояльность" Тогда
		ТекущиеДанные.БалльныйСчет = ПредопределенноеЗначение("Справочник.ВидыБалльныхСчетов.Основной");
		ТекущиеДанные.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Обнулить");
		ТекущиеДанные.КоличествоИзмененияБаллов = 0;
		ТекущиеДанные.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.Бессрочно");
		ТекущиеДанные.ДатаСрокаНачисленияБаллов = Неопределено;
		ТекущиеДанные.КоличествоПериодовДействияНачисленныхБаллов = 0;
		ТекущиеДанные.	ПериодДействияНачисленныхБаллов = ПредопределенноеЗначение("Перечисление.ПериодыДействий.День");
		ПоследовательностьДействийКоличествоПериодовДействияНачисленныхБалловПриИзменении(Неопределено);
		ПоследовательностьДействийСпособИзмененияКоличестваПриИзменении(Неопределено);
	КонецЕсли;	
		
КонецПроцедуры	

#КонецОбласти


#Область ОбработкаИзмененияПараметровДействийНаФорме
&НаКлиенте
Процедура ФильтрПоДействиямВКампанияхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Если не ТекущиеДанные = Неопределено и НоваяСтрока  Тогда
		Элементы.ФильтрПоДействиямВКампаниях.ТекущиеДанные.ИД = ТекущиеДанные.ИД;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПараметровДействия(Элемент)
	ТД = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	
	Описание = "Не все параметры указаны";
	ОшибкаВПараметрах = Истина;
	Если ТД.НаборПараметров = "ОтправкаРассылки" Тогда
		Если ЗначениеЗаполнено(ТД.Рассылка) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Канал: %1
								 |Рассылка: %2", ТД.Канал, ТД.Рассылка);
		Иначе
			Описание = СтрШаблон("Канал: %1
								 |Не указана рассылка", ТД.Канал);
									 
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "ДействияВКампаниях" Тогда
		ПустыеСтрокиПоИД = 	Объект.ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД,ВидДействияВКампании",
			ТД.ИД, ПредопределенноеЗначение("Справочник.ВидыДействияВКампаниях.ПустаяСсылка")));
		СтрокиПоИД = 	Объект.ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД",ТД.ИД));
		Если ПустыеСтрокиПоИД.Количество() = 0 И Не СтрокиПоИД.Количество() = 0 Тогда
			ОшибкаВПараметрах = Ложь;
			СтрокиПоИДПредставление = "";
			Для каждого СтрокаПоИД из СтрокиПоИД Цикл
				СтрокиПоИДПредставление = СтрокиПоИДПредставление + СтрокаПоИД.ВидДействияВКампании + Символы.ПС;
			КонецЦикла;	
			Описание = "Действия :
			|"+СтрокиПоИДПредставление;
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "ВызватьВебхук" Тогда
		Если ЗначениеЗаполнено(ТД.Вебхук) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Вебхук: %1", ТД.Вебхук);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "СгенерироватьКодАвторизации" Тогда
		Если ЗначениеЗаполнено(ТД.КоличествоПериодовДействияКодаАвторизации) И ЗначениеЗаполнено(
			ТД.ПериодДействияКодаАвторизации) Тогда
			ОшибкаВПараметрах = Ложь;
			ПредставлениеПериода = Элементы.ПоследовательностьДействийПериодДействияКодаАвторизации.СписокВыбора.НайтиПоЗначению(
				ТД.ПериодДействияКодаАвторизации).Представление;
			Описание = СтрШаблон("Код авторизации на %1 %2", ТД.КоличествоПериодовДействияКодаАвторизации,
				ПредставлениеПериода);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "Сегменты" Тогда
		Если ЗначениеЗаполнено(ТД.СегментПартнеров) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Сегмент: %1", ТД.СегментПартнеров);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "СпискиПродуктов" Тогда
		Если ЗначениеЗаполнено(ТД.СписокПродуктов) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Список продуктов: %1", ТД.СписокПродуктов);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "Промокоды" Тогда
		Если ЗначениеЗаполнено(ТД.НаборПромокодов) Тогда
			ОшибкаВПараметрах = Ложь;
			Описание = СтрШаблон("Набор промокодов: %1", ТД.НаборПромокодов);
		КонецЕсли;
	ИначеЕсли ТД.НаборПараметров = "Лояльность" Тогда
		Если ЗначениеЗаполнено(ТД.БалльныйСчет) И ЗначениеЗаполнено(ТД.СпособИзмененияКоличестваБаллов) Тогда
			Если ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение(
				"Перечисление.СпособыИзмененияКоличества.Увеличить") И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				Если ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ВТечение") и 
						НЕ ТД.КоличествоПериодовДействияНачисленныхБаллов = 0 и
						ЗначениеЗаполнено(ТД.ПериодДействияНачисленныхБаллов) Тогда
							ОшибкаВПараметрах = Ложь;
							ПредставлениеПериода = Элементы.ПоследовательностьДействийПериодДействияНачисленныхБаллов.СписокВыбора.НайтиПоЗначению(
																																					ТД.ПериодДействияНачисленныхБаллов).Представление;
							Описание = СтрШаблон("Увеличить на %1 в течение %2 %3",ТД.КоличествоИзмененияБаллов,ТД.КоличествоПериодовДействияНачисленныхБаллов,ПредставлениеПериода);
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.Бессрочно") Тогда
							ОшибкаВПараметрах = Ложь;
							Описание = СтрШаблон("Увеличить на %1 без ограничения срока действия", ТД.КоличествоИзмененияБаллов);
				ИначеЕсли ТД.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.ДоДаты") и
							ЗначениеЗаполнено(ТД.ДатаСрокаНачисленияБаллов)	Тогда 
							ОшибкаВПараметрах = Ложь;	
							Описание = СтрШаблон("Увеличить на %1 до %2", ТД.КоличествоИзмененияБаллов ,Формат(ТД.ДатаСрокаНачисленияБаллов,"ДФ='dd.MM.yyyy HH.mm';"));
				КонецЕсли;				
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Обнулить") Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = "Обнулить счет";
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Уменьшить") 
			 			И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = СтрШаблон("Уменьшить счет на %1", ТД.КоличествоИзмененияБаллов);
			ИначеЕсли ТД.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Установить") 
			 			И Не ТД.КоличествоИзмененияБаллов = 0 Тогда
				ОшибкаВПараметрах = Ложь;
				Описание = СтрШаблон("Установить счет в %1", ТД.КоличествоИзмененияБаллов);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	ТД.ОшибкаВПараметрах = ОшибкаВПараметрах;
	ТД.Описание = Описание;
	
КонецПроцедуры	



&НаКлиенте
Процедура ПоследовательностьДействийВидСрокаНачисленияБалловПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Элементы.СтраницыВидСрокаНачисленияБаллов.ТекущаяСтраница = Элементы["СНБ_" + СтрЗаменить(ТекущиеДанные.ВидСрокаНачисленияБаллов," ","") + "_Страница"];
	ОбработатьИзменениеПараметровДействия(Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийСпособИзмененияКоличестваПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если ТекущиеДанные.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Увеличить") Тогда
		ВидимостьБаллов = Истина;
		ВидимостьВидСрокаБаллов = Истина;
		ВидимостьСтраницыВидСрокаНачисленияБаллов = Истина;
	ИначеЕсли ТекущиеДанные.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Обнулить") Тогда
		ВидимостьБаллов = Ложь;
		ВидимостьВидСрокаБаллов = Ложь;
		ВидимостьСтраницыВидСрокаНачисленияБаллов = Ложь;
	Иначе
		ВидимостьБаллов = Истина;
		ВидимостьВидСрокаБаллов = Ложь;
		ВидимостьСтраницыВидСрокаНачисленияБаллов = Ложь;
	КонецЕсли;	
	
	Элементы.ПоследовательностьДействийИзменениеКоличества.Видимость = ВидимостьБаллов;
	Элементы.ПоследовательностьДействийВидСрокаНачисленияБаллов.Видимость = ВидимостьВидСрокаБаллов;
	Элементы.СтраницыВидСрокаНачисленияБаллов.Видимость = ВидимостьСтраницыВидСрокаНачисленияБаллов;
	
	ОбработатьИзменениеПараметровДействия(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПериодовАктуальностиПриИзменении(Элемент)
	ОбработатьСклонениеСпискаКлиент("ПериодАктуальности",	Объект.КоличествоПериодовАктуальности);
КонецПроцедуры


&НаКлиенте
Процедура ПоследовательностьДействийКоличествоПериодовДействияНачисленныхБалловПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	ОбработатьСклонениеСпискаКлиент("ПоследовательностьДействийПериодДействияНачисленныхБаллов",
										ТекущиеДанные.КоличествоПериодовДействияНачисленныхБаллов);
	ОбработатьИзменениеПараметровДействия(Элемент);									
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийКоличествоПериодовДействияКодаАвторизацииПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	ОбработатьСклонениеСпискаКлиент("ПоследовательностьДействийПериодДействияКодаАвторизации",
										ТекущиеДанные.КоличествоПериодовДействияКодаАвторизации,
										"Именительный");
	ОбработатьИзменениеПараметровДействия(Элемент);										
КонецПроцедуры

&НаКлиенте
Процедура 	ОбработатьСклонениеСпискаКлиент(ИмяЭлемента, ЧисловоеЗначение, Падеж = "Родительный")
	тмпСписок = Элементы[ИмяЭлемента].СписокВыбора.Скопировать();
	ОбработатьСклонениеСписка(тмпСписок, ЧисловоеЗначение, Падеж);
	Для каждого ЭлементСклонения из тмпСписок Цикл
		ЭлементСписка = Элементы[ИмяЭлемента].СписокВыбора.НайтиПоЗначению(ЭлементСклонения.Значение);
		мс = СтрРазделить(ЭлементСклонения.Представление," ");
		ЭлементСписка.Представление = мс[1];
		ЭлементСписка.Картинка = ЭлементСклонения.Картинка;
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	ОбработатьСклонениеСписка(Список, ЧисловоеЗначение, Падеж)
	ФормыСлужебныйПКМП.СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение, Падеж);
КонецПроцедуры
#КонецОбласти	