

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СВД = Справочники.ВидыДействийКлиента;
	ЭВД = Элементы.ПоследовательностьДействийВидДействия;
	
	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Отправка рассылки");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Email);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"E-mail расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.SMS);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"SMS расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Mobile);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Мобильный пуш" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия,Канал","ОтправкаРассылки",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Website);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Веб пуш " , , БиблиотекаКартинок.Пустая);


	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Действия");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","ДействияВКампаниях",СВД.ДействиеВКампании);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","ВызватьВебхук",СВД.ВызватьВебхук);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Вызвать вебхук" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","СгенерироватьКодАвторизации",СВД.СгенерироватьКодАвторизации);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Сгенерировать код авторизации" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Сегменты");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Сегменты",СВД.КлиентПопалВСегмент);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент попал в сегмент" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Сегменты",СВД.КлиентВышелИзСегмента);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Клиент вышел из сегмента" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Списки продуктов");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","СпискиПродуктов",СВД.УстановкаСпискаПродуктов);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Очистка списка продуктов" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Промокоды");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Промокоды",СВД.КлиентуВыданПромокод);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Выдать промокод" , , БиблиотекаКартинок.Пустая);

	ФормыСлужебныйПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Лояльность");
	ВидыПараметров = Новый Структура("НаборПараметров,ВидДействия","Лояльность",СВД.ИзменениеБалансаБалловПоДействию);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров, "Изменить баланс бального счета" , , БиблиотекаКартинок.Пустая);
КонецПроцедуры


&НаКлиенте
Процедура ПоследовательностьДействийПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено И ТекущиеДанные.ВидДействия = ПредопределенноеЗначение(
		"Справочник.ВидыДействийКлиента.ДействиеВКампании") Тогда

		СтрокиПоИД = 	Объект.ФильтрПоДействиямВКампаниях.НайтиСтроки(Новый Структура("ИД", ТекущиеДанные.ИД));
		Для Каждого СтрокаПоИД Из СтрокиПоИД Цикл
			Объект.ФильтрПоДействиямВКампаниях.Удалить(СтрокаПоИД);
		КонецЦикла;

		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ОтменаРедактирования Тогда
		ОбработкаТекущейСтроки(Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийВидДействияОчистка(Элемент, СтандартнаяОбработка)
	ОбработкаТекущейСтроки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийВидДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	ДействиеИзменено = (НЕ ТекущиеДанные.ВидДействия = ВыбранноеЗначение.ВидДействия ИЛИ 
									ВыбранноеЗначение.Свойство("Канал") И НЕ ТекущиеДанные.Канал = ВыбранноеЗначение.Канал);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
	ОбработкаТекущейСтроки(ДействиеИзменено);
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийПриАктивизацииСтроки(Элемент)
	ОбработкаТекущейСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаТекущейСтроки(ДействиеИзменено)
	
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено или не ЗначениеЗаполнено(ТекущиеДанные.НаборПараметров) Тогда
		Элементы.СтраницыПараметрыДействия.ТекущаяСтраница = Элементы.Пустая_Страница;
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыПараметрыДействия.ТекущаяСтраница = Элементы[ТекущиеДанные.НаборПараметров + "_Страница"];
	Если не ЗначениеЗаполнено(ТекущиеДанные.ИД) Тогда ТекущиеДанные.ИД = Новый УникальныйИдентификатор; КонецЕсли;

	Если НЕ ДействиеИзменено Тогда
		Возврат;
	КонецЕсли;

	
	Если ТекущиеДанные.НаборПараметров = "ОтправкаРассылки" Тогда
		ТекущиеДанные.Рассылка = Неопределено;
	ИначеЕсли ТекущиеДанные.ВидДействия = ПредопределенноеЗначение("Справочник.ВидыДействийКлиента.ДействиеВКампании") Тогда
		Элементы.ФильтрПоДействиямВКампаниях.ОтборСтрок(Новый ФиксированнаяСтруктура("ИД",ТекущиеДанные.ИД));
	ИначеЕсли ТекущиеДанные.ВидДействия = ПредопределенноеЗначение("Справочник.ВидыДействийКлиента.ВызватьВебхук") Тогда
		ТекущиеДанные.Вебхук = Неопределено;
	ИначеЕсли ТекущиеДанные.ВидДействия = ПредопределенноеЗначение("Справочник.ВидыДействийКлиента.СгенерироватьКодАвторизации") Тогда
		ТекущиеДанные.КоличествоПериодовДействияКодаАвторизации = 5;
		ТекущиеДанные.	ПериодДействияКодаАвторизации = ПредопределенноеЗначение("Перечисление.ПериодыДействий.Минута");
		ПоследовательностьДействийКоличествоПериодовДействияНачисленныхБалловПриИзменении(Неопределено);
	ИначеЕсли ТекущиеДанные.НаборПараметров = "Сегменты" Тогда
		ТекущиеДанные.СегментПартнеров = Неопределено;
	ИначеЕсли ТекущиеДанные.НаборПараметров = "СпискиПродуктов" Тогда
		ТекущиеДанные.СписокПродуктов = Неопределено;
	ИначеЕсли ТекущиеДанные.НаборПараметров = "Промокоды" Тогда
		ТекущиеДанные.НаборПромокодов = Неопределено;
	ИначеЕсли ТекущиеДанные.НаборПараметров = "Лояльность" Тогда
		ТекущиеДанные.БалльныйСчет = ПредопределенноеЗначение("Справочник.ВидыБалльныхСчетов.Основной");
		ТекущиеДанные.СпособИзмененияКоличестваБаллов = ПредопределенноеЗначение("Перечисление.СпособыИзмененияКоличества.Обнулить");
		ТекущиеДанные.КоличествоИзмененияБаллов = 0;
		ТекущиеДанные.ВидСрокаНачисленияБаллов = ПредопределенноеЗначение("Перечисление.ВидыСроковНачисленияБаллов.Бессрочно");
		ТекущиеДанные.ДатаСрокаНачисленияБаллов = Неопределено;
		ТекущиеДанные.КоличествоПериодовДействияНачисленныхБаллов = 0;
		ТекущиеДанные.	ПериодДействияНачисленныхБаллов = ПредопределенноеЗначение("Перечисление.ПериодыДействий.День");
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиенте
Процедура ПоследовательностьДействийВидСрокаНачисленияБалловПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	Элементы.СтраницыВидСрокаНачисленияБаллов.ТекущаяСтраница = Элементы["СНБ_" + ТекущиеДанные.ВидСрокаНачисленияБаллов + "_Страница"];
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийКоличествоПериодовДействияНачисленныхБалловПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	ОбработатьСклонениеСпискаКлиент("ПоследовательностьДействийПериодДействияНачисленныхБаллов",ТекущиеДанные.КоличествоПериодовДействияНачисленныхБаллов);
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьДействийКоличествоПериодовДействияКодаАвторизацииПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПоследовательностьДействий.ТекущиеДанные;
	ОбработатьСклонениеСпискаКлиент("ПоследовательностьДействийПериодДействияКодаАвторизации",ТекущиеДанные.КоличествоПериодовДействияКодаАвторизации);
КонецПроцедуры

&НаКлиенте
Процедура 	ОбработатьСклонениеСпискаКлиент(ИмяЭлемента, ЧисловоеЗначение)
	тмпСписок = Элементы[ИмяЭлемента].СписокВыбора.Скопировать();
	ОбработатьСклонениеСписка(тмпСписок, ЧисловоеЗначение);
	Элементы[ИмяЭлемента].СписокВыбора.Очистить();
	Для каждого ЭлементСклонения из тмпСписок Цикл
		Элементы[ИмяЭлемента].СписокВыбора.Добавить(ЭлементСклонения.Значение, ЭлементСклонения.Представление,,ЭлементСклонения.Картинка);
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	ОбработатьСклонениеСписка(Список, ЧисловоеЗначение)
	ФормыСлужебныйПКМП.СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение);
КонецПроцедуры	