#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализацияДанныхФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект,
		"НастройкиЗаказовПоПродуктам", "Компоновщик_ЗаказыПоПродуктам", Отказ);
КонецПроцедуры
#КонецОбласти

#Область Инициализация
&НаСервере
Процедура ИнициализацияДанныхФормы()
	
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоПартнерам", "НастройкиПолучателей",
		Компоновщик_ПоПолучателям);
КонецПроцедуры
#КонецОбласти