#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ТекущееСостояниеНабораПромокодов(НаборПромокодов) Экспорт
	
	СтруктураСостояния  = Новый Структура("ОбщееКоличество,ВПериодеДействия,Выдано,Использовано,Отозвано,АктивныеВыданные,ДоступноДляВыдачи",0,0,0,0,0,0,0);
	
	Если не ЗначениеЗаполнено(НаборПромокодов) Тогда Возврат СтруктураСостояния; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Промокоды.Промокод) КАК ОбщееКоличество,
		|	СУММА(ВЫБОР
		|		КОГДА &ТекущаяДата МЕЖДУ Промокоды.НачалоДействия И &ДатаОкончания
		|			ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ВПериодеДействия,
		|	СУММА(ВЫБОР
		|		КОГДА Промокоды.Выдан
		|			ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Выдано,
		|	СУММА(ВЫБОР
		|		КОГДА Промокоды.Использован
		|			ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Использовано,
		|	СУММА(ВЫБОР
		|		КОГДА Промокоды.Отозван
		|			ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Отозвано,
		|	СУММА(ВЫБОР
		|		КОГДА &ТекущаяДата МЕЖДУ Промокоды.НачалоДействия И &ДатаОкончания
		|		И Промокоды.Выдан
		|		И НЕ Промокоды.Использован
		|		И НЕ Промокоды.Отозван
		|			ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК АктивныеВыданные,
		|	СУММА(ВЫБОР
		|		КОГДА &ТекущаяДата < ДОБАВИТЬКДАТЕ(&ДатаОкончания, ЧАС, -1)
		|		И НЕ Промокоды.Выдан
		|		И НЕ Промокоды.Использован
		|		И НЕ Промокоды.Отозван
		|			ТОГДА ВЫРАЗИТЬ(1 КАК ЧИСЛО(17, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ДоступноДляВыдачи
		|ИЗ
		|	РегистрСведений.Промокоды КАК Промокоды
		|ГДЕ
		|	Промокоды.НаборПромокодов = &НаборПромокодов";
	
	Запрос.УстановитьПараметр("НаборПромокодов", НаборПромокодов);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДатаОкончания",СлужебныйПКМП.ДатаПустаяКакМакс("Промокоды.ОкончаниеДействия"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураСостояния, ВыборкаДетальныеЗаписи);
	КонецЕсли;	
	
	Возврат СтруктураСостояния;
	
КонецФункции	

#КонецЕсли