#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ГенерироватьПромокоды Тогда
		ПроверитьЗаполнениеРеквизита(Отказ, "НастройкаГенерации", НастройкаГенерации);
	КонецЕсли;

	ПроверитьЗаполнениеРеквизита(Отказ, "ТипПромокода", ТипПромокода);

	Если ПроверятьВыдачу Тогда
		ПроверитьЗаполнениеРеквизита(Отказ, "ВидПериодаДоступности", ВидПериодаДоступности);
		ПроверитьЗаполнениеРеквизита(Отказ, "ВидСрокаДействия", ВидСрокаДействия);

		Если ВидПериодаДоступности = Перечисления.ПередСразуПослеДатой.После Тогда
			ПроверитьЗаполнениеРеквизита(Отказ, "КоличествоПериодовДоступности", КоличествоПериодовДоступности);
			ПроверитьЗаполнениеРеквизита(Отказ, "ПериодДоступности", ПериодДоступности);
		КонецЕсли;

		Если ВидСрокаДействия = Перечисления.ВидыОграниченияПериодовДействий.ВТечение Тогда
			ПроверитьЗаполнениеРеквизита(Отказ, "КоличествоПериодовСрокаДействия", КоличествоПериодовСрокаДействия);
			ПроверитьЗаполнениеРеквизита(Отказ, "ПериодСрокаДействия", ПериодСрокаДействия);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизита(Отказ, ИмяРеквизита, Значение)

	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;

	Реквизит = Метаданные.Реквизиты.Найти(ИмяРеквизита);
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Поле ""%1"" не заполнено", Реквизит.Синоним),,"Объект."+ИмяРеквизита,,Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПромокодыКСозданию = Неопределено;
	Если ДополнительныеСвойства.Свойство("ПромокодыКСозданию",ПромокодыКСозданию) Тогда
		ЗаписатьПромокодыВРегистр(ПромокодыКСозданию);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьПромокодыВРегистр(ПромокодыКСозданию)
	
	Если ПромокодыКСозданию.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Многоразовый = (ТипПромокода = Перечисления.ТипыПромокодов.Многоразовый);
	
	НаборЗаписей = РегистрыСведений.Промокоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НаборПромокодов.Установить(Ссылка);
	
	КоличествоЗаписей = 0;
	Для Каждого СтрокаПромокода Из ПромокодыКСозданию Цикл
		
		Если СтрокаПромокода.Ошибка Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.НаборПромокодов = Ссылка;
		ЗаписьРегистра.Промокод = СтрокаПромокода.Промокод;
		ЗаписьРегистра.НачалоДействия = СтрокаПромокода.Начало;
		ЗаписьРегистра.ОкончаниеДействия = СтрокаПромокода.Окончание;
		ЗаписьРегистра.Многоразовый = Многоразовый;
		
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
	Если КоличествоЗаписей = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

#КонецЕсли