
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФормыСлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
//	Фиксированное = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Фиксированное"));
	Динамическое = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Динамическое"));
	Интервал = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Интервал"));
	
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени или Интервал;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
	
	Элементы.ГруппаДинамическое.Видимость = Динамическое;
	Элементы.ОграничитьПоВремени.Видимость = не Интервал;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидТочкиОжиданияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоВремениПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры


&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

