
&НаКлиенте
Процедура ГраницаСрабатыванияДинамическиПриИзменении(Элемент)
	Элементы.ПараметрыДинамическиСПериодом.Видимость = 
		не(Объект.ГраницаСрабатыванияДинамически  = ПредопределенноеЗначение("Перечисление.ПередСразуПосле.Сразу"));
	Если Объект.ГраницаСрабатыванияДинамически  = ПредопределенноеЗначение("Перечисление.ПередСразуПосле.Перед")	Тогда
		Элементы.ЗаголовокПоляКлиента.Заголовок = "до даты";
	Иначе
		Элементы.ЗаголовокПоляКлиента.Заголовок = "после даты";
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПериодовДействияДинамическиПриИзменении(Элемент)
	ОбработатьСклонениеСпискаКлиент("ПериодДействияДинамически",Объект.КоличествоПериодовДействия);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПериодовДействияФиксированоПриИзменении(Элемент)
	ОбработатьСклонениеСпискаКлиент("ПериодДействияФиксировано",Объект.КоличествоПериодовДействия);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФормыСлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	
	
	ФормыСлужебныйПКМП.СписокВыбораИзРеквизитовПоТипу(Элементы.ПолеКлиентаДляДинамического, Справочники.Клиенты.ПустаяСсылка(), Тип("Дата"));
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	Фиксированное = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Фиксированное"));
	Динамическое = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Динамическое"));
	Интервал = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Интервал"));
	
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени или Интервал;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
	
	Элементы.ГруппаФиксированное.Видимость = Фиксированное;
	Элементы.ГруппаДинамическое.Видимость = Динамическое;
	Элементы.ОграничитьПоВремени.Видимость = не Интервал;
	
	ОбработатьСклонениеСпискаКлиент("ПериодДействияДинамически",Объект.КоличествоПериодовДействия);
	ОбработатьСклонениеСпискаКлиент("ПериодДействияФиксировано",Объект.КоличествоПериодовДействия);
	
	ГраницаСрабатыванияДинамическиПриИзменении(Неопределено);
КонецПроцедуры	

&НаКлиенте
Процедура ВидТочкиОжиданияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоВремениПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры


&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура 	ОбработатьСклонениеСпискаКлиент(ИмяЭлемента, ЧисловоеЗначение, Падеж = "Винительный")
	тмпСписок = Элементы[ИмяЭлемента].СписокВыбора.Скопировать();
	ОбработатьСклонениеСписка(тмпСписок, ЧисловоеЗначение, Падеж);
	Для каждого ЭлементСклонения из тмпСписок Цикл
		ЭлементСписка = Элементы[ИмяЭлемента].СписокВыбора.НайтиПоЗначению(ЭлементСклонения.Значение);
		мс = СтрРазделить(ЭлементСклонения.Представление," ");
		ЭлементСписка.Представление = мс[1];
		ЭлементСписка.Картинка = ЭлементСклонения.Картинка;
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	ОбработатьСклонениеСписка(Список, ЧисловоеЗначение, Падеж)
	ФормыСлужебныйПКМП.СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение, Падеж);
КонецПроцедуры

