
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если ВидТочкиОжидания = Перечисления.ВидыТочкиОжидания.Фиксированное Тогда
		Если КоличествоПериодовДействия = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПериодовДействия" , "Не заполнено время ожидания");
		КонецЕсли;	
		Если не ЗначениеЗаполнено(ПериодДействия) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПериодДействия" , "Не заполнен период ожидания");
		КонецЕсли;	
	ИначеЕсли ВидТочкиОжидания = Перечисления.ВидыТочкиОжидания.Динамическое Тогда
		Если не ЗначениеЗаполнено(ПолеКлиентаДляДинамического) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПолеКлиентаДляДинамического" , "Не заполнено поле даты клиента");
		КонецЕсли;	
		Если не ЗначениеЗаполнено(ГраницаСрабатыванияДинамически) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ГраницаСрабатыванияДинамически" , "Не заполнен вариант срабатывания");
		ИначеЕсли 	не ГраницаСрабатыванияДинамически = Перечисления.ПередСразуПосле.Сразу Тогда
			Если КоличествоПериодовДействия = 0 Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КоличествоПериодовДействия" , "Не заполнено время срабатывания");
			КонецЕсли;	
			Если не ЗначениеЗаполнено(ПериодДействия) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПериодДействия" , "Не заполнен период срабатывания");
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	Если ВидТочкиОжидания = Перечисления.ВидыТочкиОжидания.Интервал или ОграничитьПоВремени Тогда
		Если не ЗначениеЗаполнено(ДниНедели) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ОграничитьПоВремени" , "Не заполнены дни недели");
		КонецЕсли;	
	КонецЕсли;	

	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);
		
КонецПроцедуры


