#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;//используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	

	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Номенклатура", Номенклатура);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)

	Если Номенклатура.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru= 'Не указана номенклатура.'"),
		                                                  ,
		                                                  "Номенклатура");
		Возврат;
	КонецЕсли;
	
	
	Закрыть(Новый Структура("Номенклатура", Номенклатура));

КонецПроцедуры

#КонецОбласти
