	Результат.Добавить("Код;СформироватьИД");
	Результат.Добавить("ДатаРождения");
	Результат.Добавить("Пол");
	Результат.Добавить("ГруппаДоступа");
	Результат.Добавить("ЧасовойПояс");
	Результат.Добавить("ЗонаДоставки");
	Результат.Добавить("Телефон");
	Результат.Добавить("Почта");
	Результат.Добавить("Фамилия");
	Результат.Добавить("Имя");
	Результат.Добавить("Отчество");
	Результат.Добавить("КодДисконтнойКарты");
	Результат.Добавить("ДатаРегистрации");

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	РазрешитьРедактированиеКод = Истина;
	РазрешитьРедактированиеДатаРождения                      = Истина;
	РазрешитьРедактированиеПол                        = Истина;
	РазрешитьРедактированиеГруппаДоступа                = Истина;
	РазрешитьРедактированиеЛокации                    = Истина;
	РазрешитьРедактированиеТелефон                    = Истина;
	РазрешитьРедактированиеПочта                    = Истина;
	РазрешитьРедактированиеФИО                    = Истина;
	РазрешитьРедактированиеКодДисконтнойКарты                    = Истина;
	РазрешитьРедактированиеДатаРегистрации                    = Истина;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеКод Тогда
		Результат.Добавить("Код");
	КонецЕсли;
	
	Если РазрешитьРедактированиеДатаРождения Тогда
		Результат.Добавить("ДатаРождения");
	КонецЕсли;
	
	Если РазрешитьРедактированиеРасписание Тогда
		Результат.Добавить("Расписание");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСпособФормирования Тогда
		Результат.Добавить("СпособФормирования");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЗапретОтгрузки Тогда
		Результат.Добавить("ЗапретОтгрузки");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
